SELECT A.DISCNT_CODE,DECODE(A.DISCNT_CODE, '4801',
               '尊敬的客户，您好！由于您变更套餐为移动数据流量5元套餐，如需办理1元超级流量王，请编辑短信内容“KTCJLLW5”至10086。1元超级流量王让您拥有更超值的上网流量。',
               '4809',
               '尊敬的客户，您好！由于您变更套餐为移动数据流量10元套餐，如需办理1元超级流量王，请编辑短信内容“KTCJLLW10”至10086。1元超级流量王让您拥有更超值的上网流量。',
               '4802',
               '尊敬的客户，您好！由于您变更套餐为移动数据流量20元套餐，如需办理1元超级流量王，请编辑短信内容“KTCJLLW20”至10086。1元超级流量王让您拥有更超值的上网流量。',
               '4813',
               '尊敬的客户，您好！由于您变更套餐为移动数据流量30元套餐，如需办理1元超级流量王，请编辑短信内容“KTCJLLW30”至10086。1元超级流量王让您拥有更超值的上网流量。',
               '4803',
               '尊敬的客户，您好！由于您变更套餐为移动数据流量50元套餐，如需办理1元超级流量王，请编辑短信内容“KTCJLLW50”至10086。1元超级流量王让您拥有更超值的上网流量。',
               '1057',
               '尊敬的客户，您好！由于您变更套餐为移动数据流量校园卡5元专享包，如需办理1元超级流量王，请编辑短信内容“KTCJLLW1”至10086。1元超级流量王让您拥有更超值的上网流量。',
               '') NOTICE_CONTENT
  FROM TF_B_TRADE_DISCNT A
 WHERE 1=1
   AND A.TRADE_ID = :TRADE_ID
   AND A.ACCEPT_MONTH = TO_NUMBER(SUBSTR(:TRADE_ID, 5, 2))
   AND A.MODIFY_TAG = '0'


