
package com.asiainfo.veris.crm.order.pub.exception;

import com.asiainfo.veris.crm.order.pub.frame.bcf.exception.IBusiException;

public enum CrmCardException implements IBusiException // 卡异常
{
    CRM_CARD_1("目前只支持一卡通和400白名单查询"), //
    CRM_CARD_10("获取SIM卡信息无数据!"), //
    CRM_CARD_100("根据RES_STATE_CODE获取有价卡状态, 编码为空!"), //
    CRM_CARD_101("主卡与子卡的身份证件不一致,请先过户到同一身份证名下!"), //
    CRM_CARD_102("根据RES_STATE_CODE获取有价卡状态, 未查到记录 TD_S_RESSTATE,SEL_BY_PK,RES_STATE_CODE:"), //
    CRM_CARD_103("更新业务流水号至POS刷卡信息失败"), //
    CRM_CARD_104("获卡类型出错!"), //
    CRM_CARD_105("获取副卡标识出错"), //
    CRM_CARD_106("获取卡类型参数错误!"), // 
    CRM_CARD_107("获取新卡资源失败"), //
    CRM_CARD_108("获取主卡用户资料失败"), //
    CRM_CARD_109("激活卡号[%s~%s]失败!"), //
    CRM_CARD_11("获取用户有效SIM卡信息无数据!"), //
    CRM_CARD_110("卡号不能为空"), //
    CRM_CARD_111("没有获取到有价卡的销售历史表信息, 不能返销！"), //
    CRM_CARD_112("插入电子卡购卡日志表时发生错误!"), //
    CRM_CARD_113("主卡与子卡的身份证件不一致,请先过户到同一身份证名下!或分配特权SYS_PID_NOSAME"), //
    CRM_CARD_114("没有获取到有价卡的销售信息, 不能返销！"), //
    CRM_CARD_115("没有获取到有效的一卡双号资料，业务无法继续！"), //
    CRM_CARD_116("没有获取到有效的有价卡售价参数，该段卡无法销售！"), //
    CRM_CARD_117("没有可以登记的福佑卡信息！如果没有按[确认]按钮,请先按确认后再提交."), //
    CRM_CARD_118("没有配置家庭套餐的副卡个数"), //
    CRM_CARD_119("没有取到主卡信息！"), //
    CRM_CARD_12("该客户还不是大客户用户，不能办理大客户备卡申请业务！"), //
    CRM_CARD_120("您不是家庭群的主卡用户，不能订购组合产品"), //
    CRM_CARD_121("您输入的服务号码不是一卡双号副号码，业务无法继续！"), //
    CRM_CARD_122("亲情产品对应的主卡优惠配置错误,请联系系统管理员!"), //
    CRM_CARD_123("请配置该产品可以办理的副卡数"), //
    CRM_CARD_124("获取副卡标识出错"), //
    CRM_CARD_125("请输入卡类型编码CAPACITY_TYPE_CODE"), //
    CRM_CARD_126("取家庭套餐可办理副卡个数配置出错"), //
    CRM_CARD_127("取消亲情关系时，获取主卡优惠信息失败"), //
    CRM_CARD_128("手机绑定的SIM卡无效，请更换!"), //
    CRM_CARD_129("输入卡段不是全满足操作条件[%s]，请减少卡段范围分批销售！"), //
    CRM_CARD_13("%s卡为过期的卡"), //
    CRM_CARD_130("同一登记时间内存在相同SIM制卡信息，请核实"), //
    CRM_CARD_131("同一个号码最多只能获得5张福佑卡!"), //
    CRM_CARD_132("同一张福佑卡不能重复登记，请核实"), //
    CRM_CARD_133("未知的写卡返回值，写卡后更新失败！"), //
    CRM_CARD_134("无法查询到内置卡号,操作失败"), //
    CRM_CARD_135("写卡失败！"), //
    CRM_CARD_136("选择的卡号不是可用的号码"), //
    CRM_CARD_137("用户办理了副卡或家庭套餐"), //
    CRM_CARD_138("已经赠送的有价卡请到有价卡赠送返销界面办理！"), //
    CRM_CARD_139("用户未办理过刮刮卡相关业务"), //
    CRM_CARD_14("该客户还没有备卡！"), //
    CRM_CARD_140("有价卡信息解析错误，业务不能继续，请检查输入信息！"), //
    CRM_CARD_141("有可以登记的SIM卡信息！"), //
    CRM_CARD_142("主号码用户不存在SIM卡资源!"), //
    CRM_CARD_143("资料查询：当前卡非一卡双号卡！"), //
    CRM_CARD_144("资料查询：获取白卡信息未发现记录！"), //
    CRM_CARD_145("查询用户原SIM卡资源信息无记录！"), //
    CRM_CARD_146("资料查询：获取一卡双号信息未发现记录！"), //
    CRM_CARD_147("查询用户原SIM卡资源信息无记录！"), //
    CRM_CARD_148("远程写卡组件版本错误，请更新最新版本！"), //
    CRM_CARD_149("远程写卡，该卡非空白卡，请检验！"), //
    CRM_CARD_15("当前用户持有备卡数量已经达到允许持有数量[%s]！不能办理该业务"), //
    CRM_CARD_150("获取远程写卡参数失败！"), //
    CRM_CARD_151("输入的【归属员工】无效！"), //
    CRM_CARD_152("该电子卡类型参数未配置![%s]"), //
    CRM_CARD_153("更新白卡及SIM个性化资料状态失败!"), //
    CRM_CARD_155("更新白卡资料状态失败!"), //
    CRM_CARD_156("释放白卡失败!"), //
    CRM_CARD_157("该用户不是VPMN集团用户!"), //
    CRM_CARD_158("释放SIM卡失败!"), //
    CRM_CARD_159("销售列表中包含未激活实体卡，不能销售!"), CRM_CARD_16("该用户没有办理备卡，业务无法继续！"), //
    CRM_CARD_160("获取SIM卡再利用参数失败！"), //
    CRM_CARD_161("销售列表中包含未激活实体卡，不能销售!RES_NO=[%s],ACTIVE_FLAG=[%s]"), CRM_CARD_162("该白卡【%s】的状态不是占用或回收状态，不能进行SIM卡再利用！"), //
    CRM_CARD_163("该号码[%s]一小时内已经购卡成功，请一小时后再继续!"), //
    CRM_CARD_164("白卡的状态不是占用或回收状态，不能进行SIM卡再利用！"), //
    CRM_CARD_165("回收状态的白卡:%s归属不是本部门，不能进行SIM卡再利用！"), //
    CRM_CARD_167("回收状态的白卡归属不是本部门，不能进行SIM卡再利用！"), //
    CRM_CARD_168("该SIM卡:[%s]的状态是占用或空闲状态，不能进行SIM卡再利用！"), //
    CRM_CARD_169("SIM卡的状态不是非占用或非空闲状态，不能进行SIM卡再利用！"), //
    CRM_CARD_17("您的备卡数量已经达到最大数[%s]！不能办理该业务"), //
    CRM_CARD_170("修改白卡资源信息出错！"), //
    CRM_CARD_171("已充值的卡不能换卡！"), CRM_CARD_172("更新白卡及SIM个性化资料状态失败!"), //
    CRM_CARD_174("未找到对应的WLAN售卡登记记录![%s]"), //
    CRM_CARD_175("释放白卡失败!"), //
    CRM_CARD_177("释放SIM卡失败!"), //
    CRM_CARD_179("该SIM卡:[%s]%s"), //
    CRM_CARD_18("获取SIM卡ki信息无数据!"), //
    CRM_CARD_180("获取是否分库标识失败！"), //
    CRM_CARD_181("根据sim卡号获取用户信息无记录！"), //
    CRM_CARD_182("SIM卡的归属移动局错误!"), //
    CRM_CARD_183("该sim卡最后使用者存在欠费记录，不能进行sim卡重利用！"), //
    CRM_CARD_184("SIM卡入库时间不符合标准,不能进行SIM卡再利用！"), //
    CRM_CARD_185("由实体卡平台下发卡密码短信失败!"), //
    CRM_CARD_186("3G卡，OPC字段不能为空！"), //
    CRM_CARD_187("SIM卡校验，数据资料错误，KI为空！"), //
    CRM_CARD_19("该卡不是全球通专属SIM卡，业务无法继续！"), //
    CRM_CARD_190("校验SIM卡信息并预占SIM卡失败！\n</br>%s"), //
    CRM_CARD_191("远程写卡组件版本错误[%s]，请更新最新版本！"), //
    CRM_CARD_192("校验白卡信息并预占白卡失败！"), //
    CRM_CARD_193("写卡后更新资源状态出错：%s"), //
    CRM_CARD_194("获取远程写卡参数失败！"), //
    CRM_CARD_195("入库时间在%s之前的SIM卡，不能进行SIM卡重个人化！[%s]"), //
    CRM_CARD_196("WLAN售卡登记记录不是购卡请求待确认状态，您可能已经回复过了"), //
    CRM_CARD_197("获取卡类型：传入卡号不能为空！"), //
    CRM_CARD_198("原卡卡类型数据异常！"), //
    CRM_CARD_199("更新白卡资料状态失败!"), //
    CRM_CARD_2("SIM卡的归属移动局错误！"), //
    CRM_CARD_20("获取用户有效SIM卡信息无数据!"), //
    CRM_CARD_200("获取白卡卡费失败：未查询到白卡资料[%s]"), //
    CRM_CARD_201("写卡结果回写失败：%s"), //
    CRM_CARD_202("读卡未完成，未获取到卡费"), //
    CRM_CARD_203("原卡与新卡的类型不同！"), //
    CRM_CARD_205("原卡与新卡的面值不同！"), //
    CRM_CARD_206("【ACTIVE_FLAG】返回为null！"), //
    CRM_CARD_207("兑换的奖品必须是非实物类的电子刮刮卡奖品!"), //
    CRM_CARD_208("没有查询到卡信息！"), //
    CRM_CARD_209("没有查询到卡信息！"), //
    CRM_CARD_21("该刮刮卡已使用"), //
    CRM_CARD_210("输入卡号有不同类型的卡！[%s]"), //
    CRM_CARD_212("输入卡号有不同面值的卡！[%s]"), //
    CRM_CARD_214("原卡与新卡的子类型不同！"), //
    CRM_CARD_215("输入卡号有不同子类型的卡！[%s]"), //
    CRM_CARD_217("没有获取到有价卡的销售信息, 不能返销！"), //
    CRM_CARD_218("获取用户刮刮卡资料失败::%s,请确认是否有获取刮刮卡"), //
    CRM_CARD_219("没有获取到有价卡的销售历史表信息, 不能返销！"), //
    CRM_CARD_22("验证码和刮刮卡号不匹配"), //
    CRM_CARD_220("不能销售话费卡！"), //
    CRM_CARD_221("该有价卡的状态不符合换卡条件！"), //
    CRM_CARD_222("该充值卡只能被激活一次，不可被再激活！"), //
    CRM_CARD_223("没有获取到有效的有价卡售价参数，该段卡无法销售！"), //
    CRM_CARD_224("充值卡[%s]状态不满足条件，不能办理换卡！[状态：%s]"), //
    CRM_CARD_225("获取电信卡查询参数无数据！"), //
    CRM_CARD_226("充值卡未过期且离充值截止日超过5天，不能换卡！"), //
    CRM_CARD_227("充值卡过期超过95天，不能换卡！"), //
    CRM_CARD_228("充值卡未过期，不能激活！"), //
    CRM_CARD_229("起始卡号不能为空"), //
    CRM_CARD_23("此刮刮卡非法!"), //
    CRM_CARD_230("结束卡号不能为空"), //
    CRM_CARD_231("未查询到相关的数据!"), //
    CRM_CARD_232("该卡为过期的卡"), //
    CRM_CARD_233("一级BOSS未返回!"), //
    CRM_CARD_234("获取有价卡成本折让信息无数据！"), //
    CRM_CARD_235("获取全省移动局号信息无数据"), //
    CRM_CARD_236("原卡状态信息错误。"), //
    CRM_CARD_237("新卡状态信息错误。"), //
    CRM_CARD_24("%s卡已绑定"), //
    CRM_CARD_25("该刮刮卡未分配到营业厅或已使用"), //
    CRM_CARD_26("该刮刮卡异常"), //
    CRM_CARD_27("特殊补偿卡业务：该卡已是作废卡，不能做补偿业务！"), //
    CRM_CARD_28("特殊补偿卡业务：该卡不归属%s"), //
    CRM_CARD_29("特殊补偿卡业务：获取SIM卡资料异常！"), //
    CRM_CARD_3("充值卡过期超过95天，不能激活！"), //
    CRM_CARD_30("特殊补偿卡业务：没有找到该SIM卡类型的补偿费用！"), //
    CRM_CARD_31("特殊补偿卡业务：获取打印数据失败！"), //
    CRM_CARD_32("该用户为校园卡集团客户，暂时不能申请呼入限制业务！"), //
    CRM_CARD_33("未配置副卡产品信息，请联系系统管理员"), //
    CRM_CARD_34("用户sim卡资源无数据!"), //
    CRM_CARD_35("%s卡已失效"), //
    CRM_CARD_36("两个SIM卡的DOUBLE_TAG标志不一致，业务无法继续!"), //
    CRM_CARD_37("两个新SIM卡的DOUBLE_TAG标志不一致，业务无法继续!"), //
    CRM_CARD_38("查询用户SIM卡信息失败"), //
    CRM_CARD_39("当前用户卡非一卡双号卡型，业务无法继续"), //
    CRM_CARD_4("新老卡面值不一致！"), //
    CRM_CARD_40("没有获取到有效的用户SIM卡资源信息！"), //
    CRM_CARD_41("主卡用户没有找到"), //
    CRM_CARD_42("主卡订购信息没有找到"), //
    CRM_CARD_43("该用户是一卡双号副卡，不能办理本业务！"), //
    CRM_CARD_44("业务前特殊限制表判断-TD家庭亲情产品主卡不能办理此业务！"), //
    CRM_CARD_45("该号码不是熟卡"), //
    CRM_CARD_46("%s卡已锁定"), //
    CRM_CARD_47("弱密码管理：获取用户SIM卡信息失败"), //
    CRM_CARD_48("您选择的主卡优惠没有绑定任何副卡优惠"), //
    CRM_CARD_49("您设置的亲情主卡优惠中没有您选择的副卡优惠！"), //
    CRM_CARD_5("您没有权限操作:充值卡延期180天！"), //
    CRM_CARD_50("已达到副卡数目上限，不能再添加副卡！"), //
    CRM_CARD_51("主卡和副卡不能是相同手机号码！"), //
    CRM_CARD_52("副卡数目为空，请核对"), //
    CRM_CARD_53("资源卡类型编码不能为空,请联系资源约定类型编码!"), //
    CRM_CARD_54("IC卡号IC_CODE不能为空!"), //
    CRM_CARD_55("SIM卡类型[D]与用户品牌不符，业务无法继续！"), //
    CRM_CARD_56("SIM卡类型[F]与用户品牌不符，业务无法继续！"), //
    CRM_CARD_57("查询%s卡失败"), //
    CRM_CARD_58("SIM卡类型[H]与用户品牌不符，业务无法继续！"), //
    CRM_CARD_59("SIM卡类型[I]与用户品牌不符，业务无法继续！"), //
    CRM_CARD_6("您没有权限操作:充值卡延期360天！"), //
    CRM_CARD_60("USIM卡[%s]校验出错,OPC值为空!"), //
    CRM_CARD_61("该卡不是一卡双号的卡，请换卡！"), //
    CRM_CARD_62("获取一卡双号控制标记失败！"), //
    CRM_CARD_63("白卡校验失败！"), //
    CRM_CARD_64("不能销售话费卡！"), //
    CRM_CARD_65("不支持的卡类型！"), //
    CRM_CARD_66("查无刮刮卡记录"), //
    CRM_CARD_67("查询该订单类型已销售拜年卡信息无记录！"), //
    CRM_CARD_68("根据卡%s未查询到相关的数据"), //
    CRM_CARD_69("查询用户SIM卡资源号码为空！"), //
    CRM_CARD_7("有价卡不存在或已销售！"), //
    CRM_CARD_70("查询用户SIM卡资源信息无记录！"), //
    CRM_CARD_71("查询用户原SIM卡资源信息无记录！"), //
    CRM_CARD_72("传入的IMSI卡号不合法,含有字母"), //
    CRM_CARD_73("传入的IMSI卡号不能为空！"), //
    CRM_CARD_74("传入的IMSI卡号的长度不足15！"), //
    CRM_CARD_76("传入的SIM卡号不合法,非89860开头"), //
    CRM_CARD_77("传入的SIM卡号不能为空！"), //
    CRM_CARD_78("传入的SIM卡号的长度不足20！"), //
    CRM_CARD_79("选择的卡号不能进行换卡操作"), //
    CRM_CARD_8("获取用户无备卡申请信息!"), //
    CRM_CARD_80("传入的SIM卡号的长度超过20！"), //
    CRM_CARD_81("传入的白卡卡号不合法,含有字母"), //
    CRM_CARD_82("传入的白卡卡号不能为空！"), //
    CRM_CARD_83("传入的白卡卡号的长度不足16！"), //
    CRM_CARD_85("此卡您兑换过奖品!"), //
    CRM_CARD_86("此卡已经被记录,请去[刮刮卡兑奖管理]界面兑奖!"), //
    CRM_CARD_87("此张福佑卡[%s]已经有用户办理了业务!"), //
    CRM_CARD_88("此张福佑卡[%s]已经有用户使用!"), //
    CRM_CARD_89("读卡未完成，未获取到卡费"), //
    CRM_CARD_9("获取SIM卡ki信息无数据!"), //
    CRM_CARD_90("VIP卡号错误"), //
    CRM_CARD_91("读取业务限制出错，副卡限制类型，TD_S_TAG::SEL_BY_TAGCODE"), //
    CRM_CARD_92("对不起,您不是家庭主卡用户,不能办理该业务!"), //
    CRM_CARD_93("多号卡激活失败！"), //
    CRM_CARD_94("副卡产品限制参数配置有误！"), //
    CRM_CARD_95("副卡数不能超过该套餐能办理的数量"), //
    CRM_CARD_96("副卡优惠参数没有配置"), //
    CRM_CARD_97("该用户没有备卡，不能办理取消！"), //
    CRM_CARD_98("该用户没有可领取的充值卡！"), //
    CRM_CARD_99("该用户有多个相同的亲情主卡优惠,资料不对,请联系系统管理员！"), //
    CRM_CARD_238("没有配置IMS自选群套餐的副卡个数"), //
    CRM_CARD_239("用户为LTE-4GUSIM卡用户，不能换为其他类型的卡"), //
    CRM_CARD_240("为了保证号码正常使用，办理USIM卡换卡业务前，请先开通GPRS功能。"), //
    CRM_CARD_241("该号码已办理的优惠中，与USIM卡换卡业务存在互斥，存在互斥的优惠编码为[%s]"), //
    CRM_CARD_242("获取大客户免费换卡次数失败！"), //
    CRM_CARD_243("获取在网3年以上老客户免费换卡次数失败！"), //
    CRM_CARD_244("该用户是一卡双号用户，新老号码必须同号段，否则请先取消一卡双号关系！"), //
    CRM_CARD_245("该资源不存在或者已经被占用！"), //
    CRM_CARD_246("改号业务：获取白卡信息失败！白卡号：[%s]"), //
    CRM_CARD_247("该用户已经订购了手机支付业务，请先去注销手机支付业务后再来办理[改号]业务。"), //
    CRM_CARD_248("没有获取到有效的用户资源信息！"), //
    CRM_CARD_249("副号码不能为空，请检查输入参数！"), //
    CRM_CARD_250("写卡后处理,未获取到空卡号！"), //
    CRM_CARD_251("系统已升级，为保证业务正常办理，请更新写卡控件，版本信息[%s][%s]！"), //
    CRM_CARD_252("Http获取写卡服务器失败，status=[%s]，ATR=[%s]，cardType=[%s]！"), //
    CRM_CARD_253("该号码为吉祥号码，代理渠道网点无法办理该业务，请前往自办营业网点办理"), //
    CRM_CARD_254("获取2011年全球通商旅套餐免费换卡次数失败！"), //
    CRM_CARD_255("只有客服数据班工号才能对移动公司的VPMN用户办理改号业务!"), //
    CRM_CARD_256("该用户已经订购了[手机支付业务]，取消后才可申请[备卡]！"), //
    CRM_CARD_265("该用户已经订购了[手机支付业务]，取消后才可激活[备卡]！"), //
    CRM_CARD_257("调用现场实时写卡系统失败！"), //
    CRM_CARD_258("根据空白卡号找不到对应的卡类型信息！"), //
    CRM_CARD_259("跨省补换卡不能补换4G卡！"), //
    CRM_CARD_260("根据CARD_TYPE:[%s]和SIM_CARD_TYPE_CODE：[%s]找不到对应的卡类型！"), //
    CRM_CARD_261("写卡系统验证失败!"), //
    CRM_CARD_262("数量过大将导致超时，请缩小数据段在【%s】内！"), CRM_CARD_263("审批工号【%s】对应的记录已经存在不能再增加！"), //
    CRM_CARD_264("修改的审批总金额不能少于原来的审核总金额。"), //
    CRM_CARD_266("实体卡已激活，无需再激活！"), //
    CRM_CARD_267("实体卡激活失败！"), //
    CRM_CARD_268("557503:特殊补偿卡业务：获取SIM卡资料异常！"), //
    CRM_CARD_269("557509:获取资源资料信息未发现记录！"), //
    CRM_CARD_270("已经销售的有价卡不能在此返销。"), //
    CRM_CARD_271("548109:输入的卡号段中有销售的有价卡，不允许办理有价卡赠送返销！"), //
    CRM_CARD_272("获取导入文件中卡号失败,请检查文件！"), //
    CRM_CARD_273("不能同时存在需要激活和不需要激活的卡!"), //
    CRM_CARD_274("获取3至5星级客户免费换卡次数失败!"), //
    CRM_CARD_1000("未获取到该号码的有效备卡信息！"),//
    /**
     * 客户号码:为必填项！
     */
    CRM_CARD_275("客户号码:为必填项！");//有价卡赠送  赠送信息

    private final String value;

    private CrmCardException(String value)
    {

        this.value = value;
    }

    public String getValue()
    {

        return value;
    }
}
