
package com.asiainfo.veris.crm.order.pub.exception;

import com.asiainfo.veris.crm.order.pub.frame.bcf.exception.IBusiException;

public enum CrmCommException implements IBusiException // 公共异常
{
    CRM_COMM_1("[%s][%s]"), //
    CRM_COMM_10("IBOSS小额授信资料查询返回结果异常！"), //
    CRM_COMM_100("该注销的副号异常，请检查数据！"), //
    CRM_COMM_101("该注销的副号异常，请检查数据！"), //
    CRM_COMM_102("非同一归属区，不能办理该业务"), //
    CRM_COMM_103("[%s]"), //
    CRM_COMM_105("串号不能为空！"), //
    CRM_COMM_106("串号不能为空或长度不能小于14位！"), //
    CRM_COMM_107("请先输入异网手机号码再进行校验！"), //
    CRM_COMM_108("%s DEFINE_MONTHS配置有误!"), //
    CRM_COMM_109("根据号码[%s]获取地州失败,请确认号码是否输入正确!"), //
    CRM_COMM_110("非裸机销售串号,不能使用该串号进行业务办理!"), //
    CRM_COMM_111("该串码在终端串码库，限制办理当前业务"), //
    CRM_COMM_112("该号码不在手机号码库，限制办理当前业务"), //
    CRM_COMM_113("该号码是异地用户，不允许查询异地用户的积分调整记录！"), //
    CRM_COMM_114("该号码是异地用户，不允许查询异地用户的积分兑奖明细！"), //
    CRM_COMM_115("该号码是异地用户，不允许查询异地用户的积分明细！"), //
    CRM_COMM_116("该号码是异地用户，不允许查询异地用户的积分转赠记录！"), //
    CRM_COMM_117("根据动作编码获取规则错误！"), //
    CRM_COMM_118("获取是否分库标识失败！"), //
    CRM_COMM_120("接入号码不能为空"), //
    CRM_COMM_127("根据号码[%s]获取地州失败,请确认号码是否输入正确!"), //
    CRM_COMM_13("%s:%s"), //
    CRM_COMM_130("空卡序列号不能为空！"), //
    CRM_COMM_134("查询局向失败！[%s]"), //
    CRM_COMM_135("销号标记不能为空"), //
    CRM_COMM_138("激活失败！"), //
    CRM_COMM_139("激活失败！<br>%s"), //
    CRM_COMM_14("调用IBOSS积分兑换接口失败！"), //
    CRM_COMM_141("获取信息提示标记失败!"), //
    CRM_COMM_142("获取是否是否打开接触查询特权标记失败!"), //
    CRM_COMM_143("获取是否需要插入接触查询日志标记失败!"), //
    CRM_COMM_144("操作员权限无权查看！"), //
    CRM_COMM_145("对不起，您没有垃圾短信人工仲裁数据访问权限！"), //
    CRM_COMM_146("操作类型值非法"), //
    CRM_COMM_147("没有选择处理方式！"), //
    CRM_COMM_148("对不起，您没有垃圾短信人工仲裁审核权限!"), //
    CRM_COMM_149("对不起，您没有其他不良短信人工仲裁审核权限!"), //
    CRM_COMM_15("调用IBOSS积分兑换接口异常！IBOSS未返回结果！"), //
    CRM_COMM_150("获取业务类型编码失败！"), //
    CRM_COMM_151("获取业务类型编码失败！"), //
    CRM_COMM_152("获取折扣出错！"), //
    CRM_COMM_153("获取折扣出错！"), //
    CRM_COMM_154("获取交换机信息失败！"), //
    CRM_COMM_155("查询无数据！"), //
    CRM_COMM_157("DISCNT_ACTION 产品属性代码格式错误！"), //
    CRM_COMM_159("查询无数据！"), //
    CRM_COMM_161("IN_DATE数据异常！"), //
    CRM_COMM_162("最多带一个随员!"), //
    CRM_COMM_163("对不起，您的积分不够！"), //
    CRM_COMM_167("该业务不能异地办理！"), //
    CRM_COMM_168("DISCNT_ATTR_CODE 产品属性代码格式错误！"), //
    CRM_COMM_17("传进来的翻译字段无效"), //
    CRM_COMM_170("查询电话类型限制出错！"), //
    CRM_COMM_171("家长号码没有传入，请重新输入！"), //
    CRM_COMM_172("不存在符合查询条件的手机号码!"), //
    CRM_COMM_173("查询电话类型限制出错！"), //
    CRM_COMM_175("短信息拒收过滤,出现异常！"), //
    CRM_COMM_176("导入文件格式错误，只支持Excel格式，请下载导入模板"), //
    CRM_COMM_177("该业务不允许在异地受理!"), //
    CRM_COMM_178("该业务不允许在异地受理!"), //
    CRM_COMM_179("DISCNT_ATTR_NAME 产品属性代码格式错误！"), //
    CRM_COMM_180("该业务不允许在异地受理!"), //
    CRM_COMM_181("该业务不允许在异地受理!"), //
    CRM_COMM_182("没有数据可以提交！"), //
    CRM_COMM_184("获取业务类型信息无数据！"), //
    CRM_COMM_186("获取动态加载页面无数据!"), //
    CRM_COMM_187("操作类型为空！"), //
    CRM_COMM_188("操作条件为空！"), //
    CRM_COMM_189("归档部门为空！"), //
    CRM_COMM_19("生效方式只能传0、1、2"), //
    CRM_COMM_190("DISCNT_ATTR_VALUE 产品属性代码格式错误！"), //
    CRM_COMM_191("归档时间为空！"), //
    CRM_COMM_192("归档意见为空！"), //
    CRM_COMM_193("归档员工为空！"), //
    CRM_COMM_194("请求页码为空！"), //
    CRM_COMM_195("受理渠道为空！"), //
    CRM_COMM_196("受理省代码为空！"), //
    CRM_COMM_197("业务类别为空！"), //
    CRM_COMM_198("该业务不允许在本地受理！"), //
    CRM_COMM_199("该业务不允许在异地受理"), //
    CRM_COMM_2("[%s]-[%s]"), //
    CRM_COMM_200("无法获取TradeType数据   TRADE_TYPE_CODE=%s"), //
    CRM_COMM_201("DISCNT_NAME 产品属性代码格式错误！"), //
    CRM_COMM_204("传入的缩位信息格式不正确"), //
    CRM_COMM_205("一级boss接口调用，静态参数表中未配置业务类型对应关系"), //
    CRM_COMM_206("无法获取正确的路由信息!"), //
    CRM_COMM_21("操作代码错误！"), //
    CRM_COMM_213("SERVICE_ACTION 产品属性代码格式错误！"), //
    CRM_COMM_22("根据IMSI获取局向失败！"), //
    CRM_COMM_224("SERVICE_ATTR_CODE 产品属性代码格式错误！"), //
    CRM_COMM_23("业务代码，内容编排类型，内容编码必填！"), //
    CRM_COMM_235("SERVICE_ATTR_NAME 产品属性代码格式错误！"), //
    CRM_COMM_239("该串号已被申请故不能重复申请！"), //
    CRM_COMM_24("%s:赠送错误,%s"), //
    CRM_COMM_240("该号码已申请故不能重复申请！"), //
    CRM_COMM_242("操作失败,失败原因为,%s"), //
    CRM_COMM_243("登记类型不正确"), //
    CRM_COMM_244("无记录存在"), //
    CRM_COMM_245("删除失败,需要删除的列表丢失"), //
    CRM_COMM_246("SERVICE_ATTR_VALUE 产品属性代码格式错误！"), //
    CRM_COMM_247("无记录存在"), //
    CRM_COMM_248("无法识别业务操作类型(申请挂失/解挂)"), //
    CRM_COMM_249("无法识别业务操作类型(申请挂失/解挂)"), //
    CRM_COMM_25("该资料不存在"), //
    CRM_COMM_250("无法识别业务操作类型(报停/报开)"), //
    CRM_COMM_251("弱密码管理:渠道接入类型是必须输入的条件!"), //
    CRM_COMM_252("对不起，您输入的号码不正确！"), //
    CRM_COMM_253("测试号码不能兑换!"), //
    CRM_COMM_254("该号码没有进行打多少送多少登记申请，不能办理打多少送多少兑奖业务！"), //
    CRM_COMM_255("请设置构造类！"), //
    CRM_COMM_256("无法获取正确的路由信息!"), //
    CRM_COMM_257("SERVICE_NAME 产品属性代码格式错误！"), //
    CRM_COMM_26("资料错误"), //
    CRM_COMM_260("@9988103: %s"), //
    CRM_COMM_261("CMNET开户未准备好，请稍候！"), //
    CRM_COMM_262("EPARCHY_CODE不能为空"), //
    CRM_COMM_263("IMSI不能为空！"), //
    CRM_COMM_264("ProductElementView component: type of parameter model is no other than com.linkage.appframework.data.IDataset."), //
    CRM_COMM_265("ProductElementView must-be-contained-by-body"), //
    CRM_COMM_266("TRADE_TYPE_CODE不能为空"), //
    CRM_COMM_267("WLAN密码是必传的!"), //
    CRM_COMM_268("操作编码错误"), //
    CRM_COMM_269("WLAN资费是必传的!"), //
    CRM_COMM_27("调用流程QAM_QUERY_HUNAN_SCORETYPEINFO出错！"), //
    CRM_COMM_270("X_TRANS_CODE不能为空"), //
    CRM_COMM_271("[查询异常]"), //
    CRM_COMM_272("[系统错误!]"), //
    CRM_COMM_273("[有效天数]必须是正整数!"), //
    CRM_COMM_274("dataCode不能为空"), //
    CRM_COMM_277("绑定/去绑定操作的计费类型错误"), //
    CRM_COMM_278("保存POS信息出错"), //
    CRM_COMM_279("调用端对端接口获取订单具体信息失败[%s]：%s"), //
    CRM_COMM_28("无权限操作"), //
    CRM_COMM_280("保存失败"), //
    CRM_COMM_281("被举号请输入非86开头的手机号！"), //
    CRM_COMM_282("本地门票信息资料表修改失败！"), //
    CRM_COMM_283("本地门票信息资料修改失败！"), //
    CRM_COMM_284("比例和不超过100％!"), //
    CRM_COMM_285("必填信息不能为空"), //
    CRM_COMM_286("必须选择查询类型"), //
    CRM_COMM_287("变更二维码出现异常，请检查！"), //
    CRM_COMM_288("不能单条与段混合录入! "), //
    CRM_COMM_289("调用端对端校验失败反馈接口失败[%s]：%s"), //
    CRM_COMM_29("导入数据为空，请检查文件！"), //
    CRM_COMM_290("不能设置本身号码为拒接号码！"), //
    CRM_COMM_291("不能同时录入两个段! "), //
    CRM_COMM_292("不允许同时修改【业务开展省】和【是否支持语音】属性"), //
    CRM_COMM_293("参与原因不能为空"), //
    CRM_COMM_294("参与原因缺失"), //
    CRM_COMM_295("操作标识不能为空"), //
    CRM_COMM_296("操作类型编码不符合规范!"), //
    CRM_COMM_297("操作类型不能为空"), //
    CRM_COMM_298("操作类型不能为空！"), //
    CRM_COMM_299("操作流水号不能为空！"), //
    CRM_COMM_3("业务受理前条件判断:当前员工无权办理该用户的业务！"), //
    CRM_COMM_30("导入数据为空，请检查导入文件！"), //
    CRM_COMM_300("配置信息不正确！"), //
    CRM_COMM_301("操作失败,%s"), //
    CRM_COMM_302("操作失败,标识丢失"), //
    CRM_COMM_303("操作失败！<br>%s"), //
    CRM_COMM_304("操作时按号码查询信息失败"), //
    CRM_COMM_305("查无资料!"), //
    CRM_COMM_306("查询到多个短信模板"), //
    CRM_COMM_307("查询返回无数据！"), //
    CRM_COMM_308("查询宽带信息出错"), //
    CRM_COMM_309("密码修改失败：%s"), //
    CRM_COMM_31("导入数据为空，请检查文件！"), //
    CRM_COMM_310("查询省代码无资料！"), //
    CRM_COMM_311("查询省代码无资料！TD_S_STATIC-》COP_SI_PROV_CODE"), //
    CRM_COMM_312("查询失败,查询方式编码丢失."), //
    CRM_COMM_313("查询时间范围不合法！"), //
    CRM_COMM_314("查询时间范围不能为空！"), //
    CRM_COMM_315("查询数据错误！<br>%s"), //
    CRM_COMM_316("查询无返回信息！"), //
    CRM_COMM_317("长途漫游级别不允许有删除操作！"), //
    CRM_COMM_318("长途漫游级别不允许有修改操作！"), //
    CRM_COMM_319("程序异常，请过后再试..."), //
    CRM_COMM_32("输入批售号码或导入号码文件都为空，请检查文件或输入号码！"), //
    CRM_COMM_320("[%s][%s]"), //
    CRM_COMM_322("触发值超范围"), //
    CRM_COMM_323("传入被举报号码为空！"), //
    CRM_COMM_324("传入串长度过大： CODING_DESC > 10000!!"), //
    CRM_COMM_325("传入串长度过大： CODING_STR > 10000!!"), //
    CRM_COMM_326("传入的数据中找不到[COUNT]！"), //
    CRM_COMM_327("串号录入系统为空,请重新录入串号校验并提交！"), //
    CRM_COMM_328("此业务不能通过BOSS订购，请直接上行指令订购！"), //
    CRM_COMM_329("此业务类型不能返销!"), //
    CRM_COMM_33("%s查询出错！"), //
    CRM_COMM_330("存在相反的名单与删除失败！"), //
    CRM_COMM_331("错误。"), //
    CRM_COMM_332("动作原因代码非法"), //
    CRM_COMM_333("错误：当前票数%s"), //
    CRM_COMM_334("错误的操作，非新增和删除操作！"), //
    CRM_COMM_335("错误的操作类型！"), //
    CRM_COMM_336("错误亲情查询方式！"), //
    CRM_COMM_337("导出数据不能超过1000"), //
    CRM_COMM_338("导入的文件名重复，请更换文件名重新导入！"), //
    CRM_COMM_339("登录员工ID不能为空"), //
    CRM_COMM_34("输入批售号码或导入号码文件都为空，请检查文件或输入号码！"), //
    CRM_COMM_340("电话号码非法"), //
    CRM_COMM_341("店员编号不存在，请确认后再办理!"), //
    CRM_COMM_343("调一级BOSS服务IDC业务预受理接口失败,出错原因：[%s]"), //
    CRM_COMM_344("调用lcu错误！"), //
    CRM_COMM_345("调用程序异常，返回结果错误！"), //
    CRM_COMM_346("调用储存过程INSERT_INTO_BH_TRADE后返回的trade_id为空!"), //
    CRM_COMM_347("调用端对端接口出错：%s"), //
    CRM_COMM_348("调用二维码使用状态查询接口无返回值！"), //
    CRM_COMM_349("调用服务失败！<br/><br/>错误代码：[%s] <br/>错误描述：[%s]"), //
    CRM_COMM_35("3g上网本去绑定调用一级boss接口失败！"), //
    CRM_COMM_350("调用一级BOSS出错！"), //
    CRM_COMM_351("调用一级客服接口进行归属省归档出错"), //
    CRM_COMM_352("调用一级客服接口进行归属省归档出错[%s"), //
    CRM_COMM_353("查询到多个短信模板"), //
    CRM_COMM_354("调用一级客服接口进行举报回退出错"), //
    CRM_COMM_355("订购信息错误"), //
    CRM_COMM_357("读取application.xml中的batnum配置出错!"), //
    CRM_COMM_358("读取td_s_product_trans记录出错！"), //
    CRM_COMM_359("短信规则配置不存在，请检查配置"), //
    CRM_COMM_36("3g天语共模去绑定调用一级boss接口失败！"), //
    CRM_COMM_360("兑奖类型不能为空"), //
    CRM_COMM_361("兑奖类型缺失"), //
    CRM_COMM_362("对不起，你的操作有误：非新增和删除操作！"), //
    CRM_COMM_363("对不起，你尚未进行任何操作。"), //
    CRM_COMM_364("企业代码、业务代码、业务类型均不能为空"), //
    CRM_COMM_365("对不起，页面数据获取失败，请重新打开界面办理。"), //
    CRM_COMM_366("对不起，终端订购数量大于一个"), //
    CRM_COMM_367("二维码原交易流水不能为空，如果为空则不能进行返销！"), //
    CRM_COMM_368("发送请求无返回信息！"), //
    CRM_COMM_369("发送业务短信通知:未知的操作对象类型！"), //
    CRM_COMM_37("礼品未配置"), //
    CRM_COMM_370("反馈属性数据不完整，请核实后提交！"), //
    CRM_COMM_371("返库处理失败！"), //
    CRM_COMM_372("返销前业务限制判断-在输入inData中没有找到[ID]"), //
    CRM_COMM_373("返销前业务限制判断-在输入inData中没有找到[PROVINCE_CODE]"), //
    CRM_COMM_374("缺少预约相关配置参数"), //
    CRM_COMM_375("返销前业务限制判断-在输入inData中没有找到[ROUTE_EPARCHY_CODE]"), //
    CRM_COMM_376("返销前业务限制判断-在输入inData中没有找到[TRADE_EPARCHY_CODE]"), //
    CRM_COMM_377("返销前业务限制判断-在输入inData中没有找到[TRADE_ID]"), //
    CRM_COMM_378("返销前业务限制判断-在输入inData中没有找到[TRADE_STAFF_ID]"), //
    CRM_COMM_379("非同一归属区,不能办理该业务!"), //
    CRM_COMM_38("提示信息不能为空"), //
    CRM_COMM_380("分页查询时操作失败！<br>%s"), //
    CRM_COMM_381("服务号码【起始、终止】范围不能不能超过1000!"), //
    CRM_COMM_382("服务请求标识不能为空！"), //
    CRM_COMM_383("服务请求标识不正确或者距第一次查询服务请求超过10分钟，为获取到最新数据，请重新点击查询按钮!"), //
    CRM_COMM_384("服务请求类别不能为空！"), //
    CRM_COMM_385("一级boss确认接口无返回信息！"), //
    CRM_COMM_386("服务有重复数据！"), //
    CRM_COMM_387("该操作类型不存在！"), //
    CRM_COMM_388("该串号不是销售状态，不能返销!"), //
    CRM_COMM_389("该串号不属于该部门，不能返销!"), //
    CRM_COMM_390("该次导入超过1000条数据,请按照约定重新导入"), //
    CRM_COMM_391("该地区已经开通了网络，不能重复开通！"), //
    CRM_COMM_392("该店员编号已办理过两次补贴!"), //
    CRM_COMM_393("该二维码不是未使用状态，不能进行返销！"), //
    CRM_COMM_394("该号码本月已办理过补贴!"), //
    CRM_COMM_395("该号码不是总机号码，不需要删除总机号"), //
    CRM_COMM_396("该号码不是总机号码，不需要修改总机号信息"), //
    CRM_COMM_397("该号码数据有异常，请更换号码操作！"), //
    CRM_COMM_398("该奖品无可使用库存"), //
    CRM_COMM_399("该商户ID已经存在！"), //
    CRM_COMM_40("不能异地办理此业务!"), //
    CRM_COMM_400("该数据存在问题！"), //
    CRM_COMM_401("该网络不属于所选择的地区，请重新选择网络！"), //
    CRM_COMM_402("该业务不允许在异地受理！"), //
    CRM_COMM_403("该营业厅不能办理此项业务！"), //
    CRM_COMM_404("根据厂家编码factoryCode获取厂家名称, 编码为空!"), //
    CRM_COMM_405("根据动作编码获取规则错误！"), //
    CRM_COMM_406("一级boss接口调用，静态参数表中未配置业务类型对应关系"), //
    CRM_COMM_407("根据条件查询数据条数为0，无数据导出！"), //
    CRM_COMM_408("更新失败"), //
    CRM_COMM_409("规则引擎错误BRE_ERROR:规则配置有问题splCheckByData, 需要匹配解析结构的字符串为空!"), //
    CRM_COMM_41("您未做任何修改，不能提交!"), //
    CRM_COMM_410("规则引擎错误BRE_ERROR:获取X_TRADE_DATA错误!"), //
    CRM_COMM_411("合作方地区不能为空！"), //
    CRM_COMM_412("合作方网络不能为空！"), //
    CRM_COMM_413("后4位必须是数字"), //
    CRM_COMM_414("获取CMNET开户的赠送信用度信息失败!"), //
    CRM_COMM_415("获取EC编码为空"), //
    CRM_COMM_416("获取IP直通车无数据"), //
    CRM_COMM_418("获取OLCOM_SERV_CODE错误！"), //
    CRM_COMM_419("获取部门Id错误！"), //
    CRM_COMM_42("不是宽带业务，不能办理此业务!"), //
    CRM_COMM_420("获取部门id错误！"), //
    CRM_COMM_421("获取参与原因出错!"), //
    CRM_COMM_422("获取登记类型参数错误!"), //
    CRM_COMM_423("获取登记类型出错!"), //
    CRM_COMM_424("获取登记类型信息错误!"), //
    CRM_COMM_425("获取短信状态信息失败!"), //
    CRM_COMM_426("获取兑奖类型出错!"), //
    CRM_COMM_427("获取对比结果信息无数据"), //
    CRM_COMM_428("%s%s]！"), //
    CRM_COMM_429("%s没有导入对应的短号！"), //
    CRM_COMM_43("同一流水号不能重复登记"), //
    CRM_COMM_430("获取个性化参数失败！"), //
    CRM_COMM_431("获取奖品档次出错!"), //
    CRM_COMM_432("获取局向的流无结果: %s"), //
    CRM_COMM_433("获取礼品出错!"), //
    CRM_COMM_434("获取礼品赠送类型出错!"), //
    CRM_COMM_435("获取设备型号信息错误!"), //
    CRM_COMM_436("获取设备型号信息错误"), //
    CRM_COMM_437("获取业务办理历史信息异常!"), //
    CRM_COMM_438("获取业务类别信息错误!"), //
    CRM_COMM_439("获取业务类型错误！"), //
    CRM_COMM_44("%s发送请求出错！"), //
    CRM_COMM_440("获取业务流水号错误！"), //
    CRM_COMM_441("获取业务信息资料无数据！"), //
    CRM_COMM_442("获取引擎接口url失败"), //
    CRM_COMM_443("获取资源设备费用：请输入业务类型编码[TRADE_TYPE_CODE]"), //
    CRM_COMM_444("获取资源设备费用：请输入资源类型编码[RES_TYPE_CODE]"), //
    CRM_COMM_445("激活失败！<br>%s"), //
    CRM_COMM_446("记录Common_Log日志发生异常:pk_cms_trade_log.Common_Log@[%s|%s]"), //
    CRM_COMM_447("记录没有改变, 不需要提交!"), //
    CRM_COMM_448("奖品编码不能为空"), //
    CRM_COMM_449("奖品档次编码不能为空"), //
    CRM_COMM_45("Error message：组号码不是当前集团的IMS用户，不能作为组号码使用！"), //
    CRM_COMM_450("err"), //
    CRM_COMM_451("交易标识不能为空"), //
    CRM_COMM_452("交易代码不能为空"), //
    CRM_COMM_453("结果回传失败！"), //
    CRM_COMM_454("解析业务数据出错，请检查输入的数据！"), //
    CRM_COMM_455("举报内容没有传入！"), //
    CRM_COMM_456("距第一次查询服务请求超过10分钟，为获取到最新数据，请重新点击查询按钮!"), //
    CRM_COMM_457("开户类型校验失败！"), //
    CRM_COMM_458("可能由于网络不通，终端型号校验无返回信息,本次业务办理失败！"), //
    CRM_COMM_459("宽带冲正失败。"), //
    CRM_COMM_46("Error message：该组号码已经被使用！请核实后重新录入！"), //
    CRM_COMM_460("垃圾短信关键字入库失败!"), //
    CRM_COMM_461("into onSubmitBaseTrade"), //
    CRM_COMM_462("垃圾短信关键字已经存在!"), //
    CRM_COMM_463("礼品编码不存在！"), //
    CRM_COMM_464("礼品编码不能为空"), //
    CRM_COMM_465("连接中间件异常"), //
    CRM_COMM_466("流程节点对应属性配置有误!请联系系统管理员"), //
    CRM_COMM_467("流程信息节点为空!请联系管理员"), //
    CRM_COMM_468("六星级渠道只可维护录入15个无卡店员!"), //
    CRM_COMM_469("六星级渠道只可维护录入三名负责人!"), //
    CRM_COMM_470("录入资料失败(TF_F_USER_STANDBY_TERMINAL)"), //
    CRM_COMM_471("落地方domain不能为空"), //
    CRM_COMM_472("没有查到符合条件的手机号码路由!"), //
    CRM_COMM_473("没有查询到对应的服务信息"), //
    CRM_COMM_474("没有查询到对应的业务信息"), //
    CRM_COMM_475("没有查询到您需要的信息"), //
    CRM_COMM_476("没有查询到业务信息"), //
    CRM_COMM_477("没有导入数据！"), //
    CRM_COMM_478("没有返销业务数据!"), //
    CRM_COMM_479("没有该笔业务"), //
    CRM_COMM_480("没有可操作类型!"), //
    CRM_COMM_481("没有需要处理的业务！"), //
    CRM_COMM_482("插入短信二次确认表异常"), //
    CRM_COMM_483("没有需要提交的服务!"), //
    CRM_COMM_484("没有选择省BBOSS反馈的下一步骤,请选择!"), //
    CRM_COMM_485("没有选择要操作的记录!"), //
    CRM_COMM_486("没有选择要删除的记录!"), //
    CRM_COMM_487("没有要导入的SP结算费用信息！"), //
    CRM_COMM_488("没有业务返销轨迹!"), //
    CRM_COMM_489("没有找到3g上网本的局数据"), //
    CRM_COMM_49("Error message: 未定义的操作类型！"), //
    CRM_COMM_490("没有找到此笔预约受理业务"), //
    CRM_COMM_491("没有找到改交易类型信息!"), //
    CRM_COMM_492("没有找到相关对应信息！"), //
    CRM_COMM_493("插入修改日志出错!"), //
    CRM_COMM_494("没有找到相应的兑奖比例! 请联系系统管理员"), //
    CRM_COMM_495("每个店员编号仅能对应一个补贴号码!"), //
    CRM_COMM_496("内部错误"), //
    CRM_COMM_497("你好，请勿提交界面滞留数据，请关闭页面，再打开重新办理。"), //
    CRM_COMM_498("您没有查询此类业务数据的权限!"), //
    CRM_COMM_499("您没有此类业务数据的操作权限"), //
    CRM_COMM_5("新串号手机终端没有对应的终端集采价参数配置，不能申请办理手机保障服务变更！"), //
    CRM_COMM_50("未定义的操作类型！"), //
    CRM_COMM_500("您没有订购手机公交业务,无法给公交IC卡充值!"), //
    CRM_COMM_501("您没有审批优先接入号码权限.审批失败!"), //
    CRM_COMM_502("您没有修改任何资料!"), //
    CRM_COMM_503("您无权全量导出，请选择要导出的内容！"), //
    CRM_COMM_504("查询条件有误,请检查!"), //
    CRM_COMM_505("您选择的兑换礼品种类太多，请重新选择！"), //
    CRM_COMM_506("您要查看的记录已不存在"), //
    CRM_COMM_507("您已经获取了全部查询记录，如果您需要再次浏览记录，请重新点击查询按钮!"), //
    CRM_COMM_508("配送信息变更失败！%s"), //
    CRM_COMM_51("传入的黑白名单信息列表为空，无法受理业务！"), //
    CRM_COMM_510("起始号码不能比结束号码大！"), //
    CRM_COMM_511("企业，业务代码错误，没有找到对应的服务"), //
    CRM_COMM_512("企业编码不能为空，若通配，请填写 ： -1"), //
    CRM_COMM_513("请检查您输入的查询条件的值是否有误,在重新操作！"), //
    CRM_COMM_514("传入串长度过大： CODING_STR > 10000!!"), //
    CRM_COMM_515("请检查数据是否正确！"), //
    CRM_COMM_516("请配置URL地址！"), //
    CRM_COMM_517("请设置构造类！"), //
    CRM_COMM_519("请先查询后导出."), //
    CRM_COMM_52("您添加的是轮选组，轮选组的组号码是必填选项！请填写后再提交！"), //
    CRM_COMM_520("请先做查询操作在导出数据 ！"), //
    CRM_COMM_521("请选择不良信息后，再继续办理业务！"), //
    CRM_COMM_522("请选择查询类型"), //
    CRM_COMM_523("请选择预受理业务！"), //
    CRM_COMM_524("请选择正确的平台编码"), //
    CRM_COMM_525("调用交易中间件异常：%s"), //
    CRM_COMM_526("请选择正确的业务类型"), //
    CRM_COMM_527("请验证数据是否正确！"), //
    CRM_COMM_528("去重对象不能为空!"), //
    CRM_COMM_529("权限不够,请联系管理员!"), //
    CRM_COMM_53("您添加的是轮选组，轮选组的轮选组类型是必填选项！请填写后再提交！"), //
    CRM_COMM_530("缺少管理属相编码！"), //
    CRM_COMM_531("弱密码管理:不支持校验方式！"), //
    CRM_COMM_532("三星级渠道只可维护2个无卡店员!"), //
    CRM_COMM_533("三星级以下渠道不可维护无卡店员!"), //
    CRM_COMM_534("删除失败,%s"), //
    CRM_COMM_535("审核失败!"), //
    CRM_COMM_536("[%s],[%s]"), //
    CRM_COMM_537("该号码不属于中国移动[%s]"), //
    CRM_COMM_538("生成流水号失败！"), //
    CRM_COMM_539("省代码不能为空！"), //
    CRM_COMM_54("您添加的是代答组，代答组的代答接入码是必填选项！请填写后再提交！"), //
    CRM_COMM_540("失效目标号码不能合并!"), //
    CRM_COMM_541("实名信息更新失败！其它错误"), //
    CRM_COMM_542("实时结余转换出错！"), //
    CRM_COMM_543("受理省编码不能为空！"), //
    CRM_COMM_544("输入的操作类型的值中不能含有逗号,分毫,大括号！"), //
    CRM_COMM_545("输入的流水号为空！"), //
    CRM_COMM_546("输入兑奖标识错误"), //
    CRM_COMM_547("数据存在问题，请查询该数据的准确性！"), //
    CRM_COMM_548("获取EC编码为空"), //
    CRM_COMM_549("数据错误，该举报信息不存在！"), //
    CRM_COMM_55("%s已经受理！"), //
    CRM_COMM_550("数据库中网络类型配置为空！"), //
    CRM_COMM_551("数据没配置完全,请联系管理员"), //
    CRM_COMM_552("四星级及以下渠道只可维护一个负责人!"), //
    CRM_COMM_553("四星级渠道只可维护6个无卡店员!"), //
    CRM_COMM_554("特殊限制表判断:该用户办理了个人代扣业务，请取消后办理当前业务！"), //
    CRM_COMM_555("特殊限制判断:用户业务受限"), //
    CRM_COMM_556("铁通接口异常"), //
    CRM_COMM_557("同步出现异常，请过后再试..."), //
    CRM_COMM_558("退库失败，存在未完工的备机处理记录"), //
    CRM_COMM_559("获取银行合同号生成配置出错!"), //
    CRM_COMM_56("取消的记录不能为空！"), //
    CRM_COMM_560("为了不影响系统速度,建议每次只操作20条记录!"), //
    CRM_COMM_561("为了不影响系统效率,每次最多只能显示20条记录!"), //
    CRM_COMM_562("未查出结果！请确认查询条件！"), //
    CRM_COMM_563("未获取到实物类型记录!"), //
    CRM_COMM_564("未能被识别的操作类型0开通1关闭"), //
    CRM_COMM_565("未能被识别的操作类型0新增1删除2修改"), //
    CRM_COMM_566("未能正确获取到您的操作信息，请重试！"), //
    CRM_COMM_567("文件不存在！"), //
    CRM_COMM_568("无法查找到对应预登记的礼品赠送记录,请确认是否已兑奖!"), //
    CRM_COMM_569("无法读取配置文件"), //
    CRM_COMM_570("获取组信息失败！"), //
    CRM_COMM_571("无法根据部门Depart_id获取部门编码!"), //
    CRM_COMM_572("无法识别参与原因"), //
    CRM_COMM_573("无符合条件的记录!"), //
    CRM_COMM_574("无符合条件数据！"), //
    CRM_COMM_575("无权限操作"), //
    CRM_COMM_576("五星级渠道只可维护录入10个无卡店员!"), //
    CRM_COMM_577("五星级渠道只可维护录入二名负责人!"), //
    CRM_COMM_578("系统发生异常，请与管理员联系"), //
    CRM_COMM_579("系统异常:%s"), //
    CRM_COMM_58("调用一级BOSS接口失败！"), //
    CRM_COMM_580("校验不通过：商品信息不能为空!"), //
    CRM_COMM_581("没有选择，无效的提交！"), //
    CRM_COMM_582("校验不通过：商品信息不能为空！"), //
    CRM_COMM_583("效验处理失败！"), //
    CRM_COMM_584("修改失败，信息在此操作前已经被操作过"), //
    CRM_COMM_585("选择的释放号码为空！"), //
    CRM_COMM_586("学校编码已经存在!"), //
    CRM_COMM_587("验证码不能为空"), //
    CRM_COMM_588("验证无线号码错误!原因:%s"), //
    CRM_COMM_589("要删除的数据为空，请确认"), //
    CRM_COMM_590("业务编码不能为空"), //
    CRM_COMM_591("业务编码不能为空，若通配，请填写 ： -1"), //
    CRM_COMM_592("没有选择操作类型：0-新增,1-删除!"), //
    CRM_COMM_593("业务处理失败！"), //
    CRM_COMM_594("业务登记后规则判断：获取业务类型编码失败!"), //
    CRM_COMM_595("业务登记失败！"), //
    CRM_COMM_596("业务返销前判断:本业务收取的押金已被清退，不能被返销！"), //
    CRM_COMM_597("业务返销前条件判断:您没有权限进行业务返销！"), //
    CRM_COMM_598("业务返销前条件判断:您无权返销其它部门所做的业务！"), //
    CRM_COMM_599("业务返销前条件判断:您无权返销其它地市所做的业务！"), //
    CRM_COMM_6("新老串号机型在当月没有在同一价格段，不能申请办理手机保障服务变更！"), //
    CRM_COMM_60("获取宽带资料无数据"), //
    CRM_COMM_600("业务返销前条件判断:您无权返销其它业务区所做的业务！"), //
    CRM_COMM_601("业务返销前条件判断:您无权返销其它员工所做的业务！"), //
    CRM_COMM_602("业务鉴权调用用接口失败:%s"), //
    CRM_COMM_603("取消预约时异常,异常原因:%s"), //
    CRM_COMM_604("业务鉴权失败:%s"), //
    CRM_COMM_605("业务类型(BIZ_TYPE_CODE=B3)错误"), //
    CRM_COMM_606("业务类型不能为空!"), //
    CRM_COMM_607("业务类型不能为空"), //
    CRM_COMM_608("业务流水不能为空！"), //
    CRM_COMM_609("业务请求无返回信息！"), //
    CRM_COMM_610("业务受理前条件判断-获取当前省代码无有效数据！"), //
    CRM_COMM_611("业务受理前条件判断-在输入inData中没有找到[FEE]或者[LEAVE_REAL_FEE]"), //
    CRM_COMM_612("商品级暂停、恢复、预取消、冷冻期恢复不能与其它操作类型组合！"), //
    CRM_COMM_613("业务受理前条件判断-在输入inData中没有找到[ID]"), //
    CRM_COMM_614("业务受理前条件判断-在输入inData中没有找到[PROVINCE_CODE]"), //
    CRM_COMM_615("业务受理前条件判断-在输入inData中没有找到[ROUTE_EPARCHY_CODE]"), //
    CRM_COMM_616("业务受理前条件判断-在输入inData中没有找到[RULE_BIZ_KIND_CODE]"), //
    CRM_COMM_617("业务受理前条件判断-在输入inData中没有找到[TRADE_EPARCHY_CODE]"), //
    CRM_COMM_618("业务受理前条件判断-在输入inData中没有找到[TRADE_STAFF_ID]"), //
    CRM_COMM_619("业务受理前条件判断-在输入inData中没有找到[TRADE_TYPE_CODE]"), //
    CRM_COMM_620("业务受理前条件判断-在输入inData中没有找到[X_CHOICE_TAG]"), //
    CRM_COMM_621("业务受理失败,失败原因:%s"), //
    CRM_COMM_622("业务已经提交，请不要多次点击提交按钮！"), //
    CRM_COMM_623("数据库操作失败!"), //
    CRM_COMM_624("业务子类[CMRBinding]错误"), //
    CRM_COMM_625("一次发送的商户业务状态信息不能多于20个!"), //
    CRM_COMM_626("一次性导入不能大于1000条记录！"), //
    CRM_COMM_627("一个号码在一个月内只能录入一次，请核实"), //
    CRM_COMM_628("一级BOSS返回无响应！"), //
    CRM_COMM_629("一级BOSS未返回！"), //
    CRM_COMM_630("已经失效或终止的商户信息不能修改！"), //
    CRM_COMM_631("已卖出的号码不能再次销售！"), //
    CRM_COMM_632("异常操作日志:号码不能为空"), //
    CRM_COMM_633("异常操作日志:业务类型编码不能为空"), //
    CRM_COMM_634("系统发生异常，获取批次的数据失败"), //
    CRM_COMM_635("应急申请信息提交失败!"), //
    CRM_COMM_636("应急执行失败!"), //
    CRM_COMM_637("预登记的礼品赠送记录，已兑奖，请先返销!"), //
    CRM_COMM_638("预定门票出现异常，请查询余票数目！"), //
    CRM_COMM_641("赠送号码不正确!"), //
    CRM_COMM_642("终止号必须大于等于起始号"), //
    CRM_COMM_643("资料录入失败(TF_B_TRADE)"), //
    CRM_COMM_644("资料修改失败(TF_F_USER_STANDBY_TERMINAL)"), //
    CRM_COMM_645("%s,ACTION=%s"), //
    CRM_COMM_646("移除标识[%s]不合法!"), //
    CRM_COMM_647("资料修改失败(tf_f_user_imei)"), //
    CRM_COMM_648("字符串输入格式有误！"), //
    CRM_COMM_650("总数不能超过 10 条! "), //
    CRM_COMM_651("总机分机号[%s]校验没有通过，请修改!"), //
    CRM_COMM_652("往短信表插入短信日志发生错误!"), //
    CRM_COMM_653("未能取得拼串数据！"), //
    CRM_COMM_654("根据号码[%s]获取地州失败,请确认号码是否输入正确!"), //
    CRM_COMM_655("类型代码1不能为空"), //
    CRM_COMM_656("首次订购类型不能为空"), //
    CRM_COMM_657("查询类型不能为空"), //
    CRM_COMM_658("撤销失败！%s"), //
    CRM_COMM_659("查询失败！%s"), //
    CRM_COMM_660("%s,该号码[%s]非中国移动号码"), //
    CRM_COMM_661("没有对应的积分兑换项."), //
    CRM_COMM_662("调用IBOSS接口查询礼品库存发生异常！"), //
    CRM_COMM_663("凤凰手机报兑换数量只能为1."), //
    CRM_COMM_664("查询库存失败！%s"), //
    CRM_COMM_665("调用一级BOSS通知WLAN平台失败!"), //
    CRM_COMM_666("内部错误"), //
    CRM_COMM_667("根据号码[%s]获取地州失败,请确认号码是否输入正确!"), //
    CRM_COMM_668("变更的终端IMEI新串号不是在15天内出库,不能办理手机保障服务变更业务！"), //
    CRM_COMM_669("未能正确获取到您的操作信息，请重试！"), //
    CRM_COMM_670("请选择操作类型！"), //
    CRM_COMM_671("%s,流程回退至端对端上级节点"), //
    CRM_COMM_672("参与原因不能为空"), //
    CRM_COMM_673("兑奖类型不能为空"), //
    CRM_COMM_674("奖品编码不能为空"), //
    CRM_COMM_675("奖品档次编码不能为空"), //
    CRM_COMM_676("卡号不能为空"), //
    CRM_COMM_677("校验码不能为空"), //
    CRM_COMM_678("根据号码[%s]获取地州失败,请确认号码是否输入正确!"), //
    CRM_COMM_679("验证码错误!"), //
    CRM_COMM_68("该业务不允许在异地受理!"), //
    CRM_COMM_680("获取组资料信息失败"), //
    CRM_COMM_681a("表[%s]数据为空"), //
    CRM_COMM_682("表[%s]字段[%s]不能为空!"), //
    CRM_COMM_682a("开发模式事务已强制回滚,订单标识[%s],业务类型[%s]"), //
    CRM_COMM_683("查询条件不能为空"), //
    CRM_COMM_684("无高级付费关系信息，不能进行取消操作！"), //
    CRM_COMM_685("获取接触信息详细无数据"), //
    CRM_COMM_686("功能模块编码不能为空！"), //
    CRM_COMM_687("生成会计凭证号(SEQ_FEE_LOG_ID)失败!eparchyCode=%s,logId=%s！"), //
    CRM_COMM_688("业务子流水不能为空！"), //
    CRM_COMM_689("收费方式不能为空！"), //
    CRM_COMM_690("系统业务类型不能为空！"), //
    CRM_COMM_691("返销标记不能为空！"), //
    CRM_COMM_692("受理日期不能为空！"), //
    CRM_COMM_693("不支持业务类型：%资料获取方式参数INFO_TAG_SET 配置错误。"), //
    CRM_COMM_694("运算符不正确![Params:%s]"), //
    CRM_COMM_695("参数不正确！[%s]"), //
    CRM_COMM_696("受理日期不能为空！"), //
    CRM_COMM_7("#业务登记后条件判断:该业务须包含铁通号码信息！"), //
    CRM_COMM_71("不在办理有效期内"), //
    CRM_COMM_76("请输入验证数据"), //
    CRM_COMM_8("查询二次确认表找不到对应记录，请确认SERIAL_NUMBER和FORCE_OBJECT是否正确！"), //
    CRM_COMM_81("无效业务类型编码"), //
    CRM_COMM_87("锁定失败！"), //
    CRM_COMM_888("%s"), //
	CRM_COMM_889("该共享优惠【%s】没有配置相应的共享资源类型！"), //
    CRM_COMM_9("IBOSS小额授信资料查询结果异常！"), //
    CRM_COMM_901("选择时间段不能超过%s"), //
    CRM_COMM_902("请配置TD_S_COMMPARA"), //
    CRM_COMM_903("传入串长度过大： CMD_STR > 40000!!"), //
    CRM_COMM_904("542006, 没有资源类型编码RES_TYPE_CODE!"), //
    CRM_COMM_905("542006, 请输入IMEI号或卡号!"), //
    CRM_COMM_906("根据服务号码查询用户数据异常!"), //
    CRM_COMM_907("未获取到备机更换信息!"), //
    CRM_COMM_908("未知校验类型！deal_type=[%s]!"), //
    CRM_COMM_909("铁通宽带用户【%s】资料查询异常! Message：%s"), //
    CRM_COMM_91("对不起，你尚未进行任何操作。"), //
    CRM_COMM_910("该机型参数配置不完整，请检查!"), //
    CRM_COMM_911("入参有误，SERIAL_NUMBER,BIZ_TYPE_CODE,REMOVE_TAG都不能为空"), //
    CRM_COMM_912("只能查询正常用户数据！"), //
    CRM_COMM_913("入参[%s]没传"), //
    CRM_COMM_914("外围仅支持统一认证,IN_MODE_CODE必须为11"), //
    CRM_COMM_915("身份凭证不存在！"), //
    CRM_COMM_916("注销身份凭证失败！"), //
    CRM_COMM_917("临时身份凭证不能延长失效时间！"), //
    CRM_COMM_918("延长身份凭证失败！"), //
    CRM_COMM_919("存储身份凭证失败！"), //
    CRM_COMM_920("该号码是异地用户，不允许办理客户合并！"), //
    CRM_COMM_921("源客户号码号码和目标客户号码相同！"), //
    CRM_COMM_922("无身份证验证权限！"), //
    CRM_COMM_92("对不起，你的操作有误：非新增和删除操作！"), //
    CRM_COMM_93("错误的操作，非新增和删除操作！"), //
    CRM_COMM_94("错误的操作，非新增和删除操作！"), //
    CRM_COMM_95("没有查询到信息！"), //
    CRM_COMM_96("获取查询IP电话号码类型无数据！"), //
    CRM_COMM_97("未传入SEQ"), //
    CRM_COMM_98("请先选择IP直通车产品！"), //
    CRM_COMM_982("用户有未完工的订单[%s][%s][%s]请稍后！"), //
    CRM_COMM_983("业务受理中，请稍后"), //
    CRM_COMM_984("选择的数据存在错误，请选择其他的记录。"), //
    CRM_COMM_99("未知查询类型"), //
    CRM_COMM_985("调用ESOP接口出错！"), //
    RM_TRADE_986("发送订单条数与数据库信息不一致"), //
    CRM_COMM_987("调用渠道扣款接口，没有返回渠道流水"), //
    CRM_COMM_988("服务开通回单失败"), //
    CRM_COMM_989("该记录接触标识为空不能修改"), //
    CRM_COMM_990("该条记录接触时间为空不能修改"), //
    CRM_COMM_923("全网唯一编码为空。"), //
    CRM_COMM_924("省份编码为空。"), //
    CRM_COMM_925("手机号码为空。"), //
    CRM_COMM_926("人工触发处理时间为空。"), //
    CRM_COMM_927("处理方式为空。"), //
    CRM_COMM_928("HLR加解黑类型为空。"), //
    CRM_COMM_929("数据来源为空。"), //
    CRM_COMM_930("HLR加解黑原因描述为空。"), //
    CRM_COMM_931("接入渠道为空。"), //
    CRM_COMM_932("2001,请配置正确的加黑业务类型参数,处理方式:%s;地州编码:%s。"), //
    CRM_COMM_933("2002,请配置正确的加黑业务类型参数,业务类型或加解黑标志为空。"), //
    CRM_COMM_1001("01,[MOB_NUM]用户手机号码错误，用户状态非正常!"), //
    CRM_COMM_1002("02,[OPER_CODE]操作编码错误!"), //
    CRM_COMM_1003("03,集团用户生效时间错误，集团用户已注销！"), //
    CRM_COMM_1004("04,[BIZ_CODE]业务代码错误!"), //
    CRM_COMM_1005("05,[SERVCODE]业务接入号错误!"), //
    CRM_COMM_1006("06,[SERV_CODE_PROP]业务接入号的属性错误!"), //
    CRM_COMM_1007("07,用户无签约关系（[BIZ_CODE,SERVCODE]业务代码、业务接入号和业务接入号的属性组合）!"), //
    CRM_COMM_1010("10,该产品无此类型业务！或该业务已终止!"), //
    CRM_COMM_1011("11,该业务已暂停!,"), //
    CRM_COMM_1012("98,读取[TD_B_ATTR_BIZ]配置SVC出错！"), //
    CRM_COMM_1014("该号码已经设定过今年的生日信息，"), //
    CRM_COMM_1013("98,读取[TD_B_ATTR_BIZ]配置获取成员mebSvcCode为空!"), //
    CRM_COMM_125112("查询COMMPARA参数表异常，没有找到PARAM_ATTR=2012的配置参数！"), //
    CRM_COMM_1025("该集团的成员总数已经超额,请联系管理员:目前该集团允许成员总数为：[%s];该集团现有成员总数为：[%s]"), //
    CRM_COMM_1026("不是新客户，不能办理本业务！"), //
    CRM_COMM_1027("用户已办理过预存话费送礼品业务！"), //
    CRM_COMM_1028("用户是一卡双号副卡不能办理本业务！"), //
    CRM_COMM_1029("用户是一卡付多号副卡不能办理本业务！"), //
    CRM_COMM_1030("用户是移动公话或随e行用户，不能办理本业务！"), //
    CRM_COMM_1031("用户是移动公司员工，不能办理本业务！"), //
    CRM_COMM_1032("用户办理过购机，不能办理本业务!"), //
    CRM_COMM_1033("用户办理过礼包，不能办理本业务!"), //
    CRM_COMM_1034("08,用户已在名单内!"), //
    CRM_COMM_1035("09,用户不在名单内!"), CRM_COMM_1036("TYPE_CODE 和 TYPE_ID 的行数不一致!"), CRM_COMM_1037("传入的参数TYPE_CODE:%s，不在规定的范围！"), CRM_COMM_1038("传入的参数TYPE_ID不能为空！"), CRM_COMM_1039("传入的参数TYPE_ID:%s，不正确！"), CRM_COMM_1040("输入参数QUERY_TYPE值错误！"),
    CRM_COMM_1041("为考虑系统稳定性，本接口禁止使用，请理解！"), CRM_COMM_1042("529002:X_GETMODE字段值不对，没有【%s】该类型！"), CRM_COMM_1043("-1:获取归属地州失败！"), CRM_COMM_1044("参数[%s]必须为自然数!"), CRM_COMM_1045("举报信息无资料！"), CRM_COMM_1046("服务号码不能为空！"), CRM_COMM_1047(
            "请配置在TD_B_TRADE_SMS中配置短信模板！"), CRM_COMM_1048("请输入开始日期参数！"), CRM_COMM_1049("请输入结束日期参数！"), CRM_COMM_1050("预约说明字符数请小于等于500!！"), CRM_COMM_1051("该业务类型未在预约承载配置表中配置，请配置！"), CRM_COMM_1052("该部门的未处理预约数量已达到配置的上限！"), CRM_COMM_1053("该部门信息未配置！"),
    CRM_COMM_1054("身份凭证缺失，或已失效！"), CRM_COMM_1055("身份凭证已经失效！"), CRM_COMM_1056("身份凭证延时长度超出限制！"), CRM_COMM_1101("X_TAG不存在"), CRM_COMM_1102("X_TAG值不正确[%s]"), CRM_COMM_1103("临时身份凭证鉴权时业务编码不能为空"), CRM_COMM_1104("Java财务完工处理异常"), CRM_COMM_1105("Java资源完工处理异常！"), CRM_COMM_1106(
            "获取费用校验规则TD_S_ACCT_RULES表无数据！"), CRM_COMM_1107("根据【FEE_TYPE_CODE=%s】获取费用校验规则TD_S_ACCT_RULES_CHECK表无数据！"), CRM_COMM_1108("规则校验%s字段值校验未通过"), CRM_COMM_1109("规则校验未通过"), CRM_COMM_1110("返销操作员工信息与原录入信息不符!"), CRM_COMM_1111("税率配置错误，请联系管理员!"),
    CRM_COMM_1112("调用客户管理接触信息接口出错:%s"), CRM_COMM_1113("不支持的查询"), CRM_COMM_1114("查询二次确认表找不到对应记录，请确认SERIAL_NUMBER和FORCE_OBJECT是否正确！"), CRM_COMM_1115("IBOSS小额授信资料查询结果异常！"), CRM_COMM_1116("IBOSS小额授信资料查询返回结果异常！"), CRM_COMM_1117("存在相同的问题！"),
    CRM_COMM_1118("520009-【%s】对应的代理商不存在或该代理商没有缴纳押金!"), CRM_COMM_1119("查询日期间隔不能超过【%s】天!"), CRM_COMM_1120("-1:X_GETMODE不存在"), CRM_COMM_1121("546000:TRADE_TYPE_CODE字段没传"), CRM_COMM_1122("450007:用户资料不存在"), CRM_COMM_1123("该用户有错单未处理,不能办理预约取消。"),
    CRM_COMM_1124("该用户没有该业务类型可取消数据！"), CRM_COMM_1125("入参有误，SERIAL_NUMBER,SUBSCRIBE_TYPE,TRADE_EPARCHY_CODE都必传"), CRM_COMM_1126("100001:输入参数IDTYPE是必须的！"), CRM_COMM_1127("100001:输入参数IDVALUE是必须的！"), CRM_COMM_1128("100001:输入参数BIZ_TYPE_CODE是必须的！"),
    CRM_COMM_1129("100001:输入参数PASSWD是必须的！"), CRM_COMM_1130("100001:输入参数OPR_NUMB是必须的！"), CRM_COMM_1131("200001: 用户资料不存在"), CRM_COMM_1132("200002: 用户服务密码不存在"), CRM_COMM_1133("200003: 用户服务密码错误"), CRM_COMM_1134("获取客户信息失败！"), CRM_COMM_1135("获取产品信息失败！"),
    CRM_COMM_1136("获取VIP信息失败！"), CRM_COMM_1137("您无权办理海南移动公司集团!"), CRM_COMM_1138("查询手机开卡归属地失败!"), CRM_COMM_1139("TD_S_TAG没有配置日志记录开关！"), CRM_COMM_1140("831009:该用户没有可返销业务类型数据！"), CRM_COMM_1141("100403:店员编码或密码错误，检查无此店员信息！"), CRM_COMM_1142(
            "该产品没有做相关的参数转换配置，请联系管理员！"), CRM_COMM_1143("545007:不存在该服务号码的用户资料"), CRM_COMM_1144("邮寄方式为邮政投递，邮寄地址不能为空！"), CRM_COMM_1145("邮寄方式为EMAIL投递，Email地址不能为空！"), //
    CRM_COMM_1146("子订单编码不存在！"), CRM_COMM_1147("订单编码不存在！"), CRM_COMM_1148("无此订单!"),CRM_COMM_1149("渠道编码不能为空!"),CRM_COMM_1150("操作员工号不能为空!"),CRM_COMM_1151("操作员联系号码不能为空!"),CRM_COMM_1152("业务类型不能为空!"),CRM_COMM_1153("生成采集验证工单出错!"),
    CRM_COMM_1154("全网唯一操作流水号不能为空!"),CRM_COMM_1155("客户名字不能为空!"),CRM_COMM_1156("登录员工工号不能为空!"),CRM_COMM_1157("验证结果不能为空!"),CRM_COMM_1158("帐号不能为空!"),CRM_COMM_1159("密码不能为空!"),CRM_COMM_1160("员工登录失败，请输入正确员工号和密码!"),
    CRM_COMM_1161("登录方式不能为空!"),
    CRM_COMM_1162("IMEI不能为空!"),
    CRM_COMM_1163("获取集团产品签约有礼送活动失败!"),
    CRM_COMM_1164("该集团产品当月的月消费额低于约定消费的金额，不能办理该活动！!"),
    CRM_COMM_1165("导入失败,excel中有空值存在"),
    CRM_COMM_1166("导入失败,excel不能为空"),
    CRM_COMM_1167("已有记录"),
    CRM_COMM_1168("加入失败,excel中有空值存在"),
    CRM_COMM_1169("加入失败,excel不能为空"),
    CRM_COMM_1170("参数值为不能空"),
    CRM_COMM_1171("USER_ID不存在"),
    CRM_COMM_1172("用户信息不存在"),
    CRM_COMM_1173("验证码不存在"),
    CRM_COMM_1174("您的验证码使用次数已超限"),
    CRM_COMM_1175("找不到[%s]对应的归档sql配置"),
    CRM_COMM_1176("加载归档默认的实现类异常"),
    CRM_COMM_1177("获取默认INTF_ID配置为空"),
    //4032
    CRM_COMM_1178("业务变更后开通参数不能为空！"),
    //4032
    CRM_COMM_1179("业务变更前开通参数不能为空！"),
    //5999 服务开通失败！
    CRM_COMM_1180("%s"),
    //2007
    CRM_COMM_1181("该号码不存在,请重新输入！"),
    //2007
    CRM_COMM_1182("2007:该用户不存在或未开户,不能进行此操作!"),
    //5999
    CRM_COMM_1183("调资源接口获取SIM资源信息出错！"),
    //2999
    CRM_COMM_1184("该换卡用户没有SIM咔信息！"),
    //5999
    CRM_COMM_1185("调资源接口获取SIM资源信息出错！"),
    
    CRM_COMM_1186("非法输入值！"),
    
    CRM_COMM_1187("验证不通过，请重试！"),
    
    CRM_COMM_1188("该号码已存在，请重试！"),
    
    CRM_COMM_1189("CMIOT终端营销活动配置已存在！"),
    
    CRM_COMM_1190("CMIOT终端营销活动配置不存在！"),
    
    CRM_COMM_1210("查询COMMPARA参数表异常，没有找到PARAM_ATTR=[%s]的配置参数！"),
    ;
  
    private final String value;

    private CrmCommException(String value)
    {

        this.value = value;
    }

    public String getValue()
    {

        return value;
    }
}
