
package com.asiainfo.veris.crm.order.pub.exception;

import com.asiainfo.veris.crm.order.pub.frame.bcf.exception.IBusiException;

public enum CTTException implements IBusiException
{
    CRM_CTT_1("铁通接口无返回！"), //
    CRM_CTT_2("铁通宽带开户业务办理失败, 原因: %s"), //
    CRM_CTT_3("查询铁通局向数据返回为空！"), //
    CRM_CTT_4("查询铁通局向数据返回异常，原因：%s"), //
    CRM_CTT_5("查询铁通设备信息返回为空！"), //
    CRM_CTT_6("查询铁通设备信息返回异常，原因：%s"), // 
    CRM_CTT_7("查询铁通促销活动返回为空！"), //
    CRM_CTT_8("查询铁通促销活动返回异常，原因：%s"), //
    CRM_CTT_9("查询铁通选号接口返回为空！"), //
    CRM_CTT_10("查询铁通选号接口返回异常，原因：%s"), //
    CRM_CTT_11("查询选号无数据！"), //
    CRM_CTT_12("查询促销换算返回异常，原因：%s"), //
    CRM_CTT_13("查询促销换算无数据！"), //
    CRM_CTT_14("查询铁通价格计划标识返回异常，原因：%s"), //
    CRM_CTT_15("铁通价格计划标识查询接口返回为空！"), //
    CRM_CTT_16("铁通计费区查询接口返回为空！"), //
    CRM_CTT_17("铁通计费区查询返回异常，原因：%s"), //
    CRM_CTT_18("铁通无线座机开户返回为空！"), //
    CRM_CTT_19("铁通无线座机开户返回异常，原因：%s"), //
    CRM_CTT_20("铁通无线座机用户查询返回异常，原因：%s"), //
    CRM_CTT_21("铁通无线座机停机返回为空！"), //
    CRM_CTT_22("铁通无线座机停机返回异常，原因：%s"), //
    CRM_CTT_23("铁通无线座机销户返回为空！"), //
    CRM_CTT_24("铁通无线座机销户返回异常，原因：%s"), //
    CRM_CTT_25("铁通无线座机复机返回为空！"), //
    CRM_CTT_26("铁通无线座机复机返回异常，原因：%s"), //
    CRM_CTT_27("铁通无线座机充值返回为空！"), //
    CRM_CTT_28("铁通无线座机充值返回异常，原因：%s"), //
    CRM_CTT_29("查询铁通无线座机当天充值记录查询返回为空！"), //
    CRM_CTT_30("查询铁通无线座机当天充值记录返回异常，原因：%s"), //
    CRM_CTT_31("当天没有查到充值记录，请核实后再操作！"), //
    CRM_CTT_32("铁通无线座机冲正返回为空！"), //
    CRM_CTT_33("铁通无线座机冲正返回异常，原因：%s"), //
    CRM_CTT_34("铁通无线座机价格计划修改返回为空！"), //
    CRM_CTT_35("铁通无线座机价格计划修改返回异常，原因：%s"), //
    CRM_CTT_36("铁通宽带用户信息查询返回为空！"), //
    CRM_CTT_37("铁通宽带用户信息查询返回异常，原因：%s"), //
    CRM_CTT_38("铁通宽带价格计划查询返回为空！"), //
    CRM_CTT_39("铁通宽带价格计划查询返回异常，原因：%s"), //
    CRM_CTT_40("铁通宽带价格计划修改返回为空！"), //
    CRM_CTT_41("铁通宽带价格计划修改返回异常，原因：%s"), //
    CRM_CTT_42("铁通宽带产品及销售包查询返回为空！"), //
    CRM_CTT_201("续费金额不能为空!"),
    CRM_CTT_202("续费金额为0，不需缴纳费用!"),
    CRM_CTT_203("铁通后付费缴纳返回为空！"),
    CRM_CTT_204("铁通后付费缴纳返回异常，原因：%s"),
    CRM_CTT_205("铁通后付费缴纳返回异常，原因：%s"),
    CRM_CTT_206("获取产品和销售包 无结果，原因：%s"),
    CRM_CTT_207("铁通后付费开户返回为空！"),
    CRM_CTT_208("铁通后付费开户返回异常，原因：%s"),
    CRM_CTT_209("用户号码不能为空！"),
    CRM_CTT_210("铁通后付费用户销户返回为空！"),
    CRM_CTT_211("铁通后付费用户销户返回异常，原因：%s"),
    CRM_CTT_212("后付费用户信息查询返回为空！"),
    CRM_CTT_213("铁通后付费用户信息查询返回异常，原因：%s"),
    CRM_CTT_214("铁通宽带用户群查询返回为空！"),
    CRM_CTT_215("铁通宽带退单接口返回为空！"),
    CRM_CTT_216("铁通宽带退单接口返回异常，原因：%s"),
    CRM_CTT_217("铁通用户上网记录查询接口返回为空！"),
    CRM_CTT_218("铁通用户上网记录查询接口返回异常，原因：%s"),
    CRM_CTT_219("铁通宽带密码修改接口返回为空！"),
    CRM_CTT_220("铁通宽带密码修改接口返回异常，原因：%s"),
    CRM_CTT_221("铁通宽带校验号码接口返回为空！"),
    CRM_CTT_222("铁通宽带校验号码接口返回异常，原因：%s"),
    CRM_CTT_223("铁通宽带用户资料修改接口返回为空！"),
    CRM_CTT_224("铁通宽带用户资料修改接口返回异常，原因：%s"),
    CRM_CTT_43("铁通宽带产品及销售包查询返回异常，原因：%s"), //
    CRM_CTT_44("铁通预付费用户信息查询返回为空！"), // 
    CRM_CTT_45("铁通预付费用户信息查询返回异常，原因：%s"), //
    CRM_CTT_46("铁通预付费价格计划查询返回为空！"), // 
    CRM_CTT_47("铁通预付费价格计划查询返回异常，原因：%s"), //
    CRM_CTT_48("铁通预付费修改价格计划返回为空！"), // 
    CRM_CTT_49("铁通预付费修改价格计划返回异常，原因：%s"), //
    CRM_CTT_50("铁通预付费用户冲正信息查询返回为空！"), // 
    CRM_CTT_51("铁通预付费用户冲正信息查询返回异常，原因：%s"), //
    CRM_CTT_52("铁通预付费冲正查询用户余额和使用状态返回为空！"), // 
    CRM_CTT_53("铁通预付费冲正查询用户余额和使用状态返回异常，原因：%s"), //
    CRM_CTT_54("铁通预付费冲正登记处理返回为空！"), // 
    CRM_CTT_55("铁通预付费冲正登记处理返回异常，原因：%s"), //
    CRM_CTT_56("铁通预付费销户登记处理返回为空！"), // 
    CRM_CTT_57("铁通预付费销户登记处理返回异常，原因：%s"), //
    CRM_CTT_58("铁通预付费开户返回为空！"), //
    CRM_CTT_59("铁通预付费开户返回异常，原因：%s"), //
    CRM_CTT_60("铁通无线座机话费余额查询返回为空！"), //
    CRM_CTT_61("铁通无线座机话费余额查询返回异常，原因：%s"), //
    CRM_CTT_62("获取产品和销售包查询返回为空"),
    CRM_CTT_63("预付费停机返回为空！"), //
    CRM_CTT_64("预付费停机返回异常，原因：%s"), //
    CRM_CTT_65("预付费复机返回为空！"), //
    CRM_CTT_66("预付费复机返回异常，原因：%s"), //
    CRM_CTT_67("费用组件数据为空！"), //
    CRM_CTT_68("费用组件费用需大于零！"), //
    CRM_CTT_70("铁通宽带开户接口返回为空！"), // 
    CRM_CTT_71("铁通宽带开户接口返回异常，原因：%s"), CRM_CTT_72("铁通宽带续费接口返回为空！"), CRM_CTT_73("铁通宽带续费接口返回异常，原因：%s"), CRM_CTT_74("铁通宽带开通进度查询接口返回为空！"), CRM_CTT_75("铁通宽带开通进度查询接口返回异常，原因：%s"), CRM_CTT_76("铁通宽带手机捆绑受理接口返回为空！"), CRM_CTT_77("铁通宽带手机捆绑受理接口返回异常，原因：%s"),
    CRM_CTT_78("铁通宽带冲正查询接口返回为空！"), CRM_CTT_79("铁通宽带冲正查询接口返回异常，原因：%s"), CRM_CTT_80("用户%s当天没有通过BOSS缴费，不能进行冲正！"), CRM_CTT_81("用户%s当天通过BOSS缴费的记录已经返销，不能再进行冲正！"), CRM_CTT_82("铁通宽带冲正接口返回为空！"), CRM_CTT_83("铁通宽带冲正接口返回异常，原因：%s"), CRM_CTT_84("铁通宽带销户接口返回为空！"),
    CRM_CTT_85("铁通宽带销户接口返回异常，原因：%s"),

    CRM_CTT_90("铁通用户信息不全，PRODUCT_TYPE:产品类型为空！"),
    CRM_CTT_91("只有以下网别的用户，才能办理此业务: 铁通宽带、固话网别、集团专网(铁通)、铁通400业务 、铁通集团虚拟网！"),
    CRM_CTT_92("无法根据终端类型获取到费用类型！");

    private final String value;

    private CTTException(String value)
    {

        this.value = value;
    }

    public String getValue()
    {
        return value;
    }

}
