
package com.asiainfo.veris.crm.order.pub.exception;

import com.asiainfo.veris.crm.order.pub.frame.bcf.exception.IBusiException;

public enum CustException implements IBusiException // 客户异常
{
    CRM_CUST_1("服务号码为【%s】的成员无客户信息！"), //
    CRM_CUST_10("业务受理前条件判断：客户不能异地办理该业务！"), //
    CRM_CUST_100("证件号码不能为空"), //
    CRM_CUST_101("客户证件类型错误"), //
    CRM_CUST_102("证件号码为空!"), //
    CRM_CUST_103("证件类型编码为空!"), //
    CRM_CUST_104("最大随行人数【%s】!"), //
    CRM_CUST_105("该服务号码[%s]客户信息不存在！"), //
    CRM_CUST_106("客户证件号码错误"), //
    CRM_CUST_107("vip卡号对应的大客户不存在"), //
    CRM_CUST_109("用户为银卡及以上的大客户"), // 
    CRM_CUST_11("该证件限制新开户或者该证件已经被使用!"), //
    CRM_CUST_110("获取手机号码客户信息无数据！"), //
    CRM_CUST_111("查找客户资料无数据"), //
    CRM_CUST_112("证件号码不能为空！"), //
    CRM_CUST_115("客服密码错误"), //
    CRM_CUST_116("证件号码不正确!"), //
    CRM_CUST_117("客户证件类型和证件号码不正确!"), //
    CRM_CUST_118("证件号码错误"), //
    CRM_CUST_119("客户证件类型和证件号码不正确!"), //
    CRM_CUST_12("该证件是黑名单资料！黑名单号码：%s"), //
    CRM_CUST_120("证件类型错误"), //
    CRM_CUST_121("邮寄标志不存在或为空!"), //
    CRM_CUST_122("邮寄内容不存在或为空!"), //
    CRM_CUST_123("邮寄方式不存在或为空!"), //
    CRM_CUST_124("邮寄方式不为空且长度不为1!"), //
    CRM_CUST_125("邮寄编码不能为非数字!"), //
    CRM_CUST_126("赠送号码客户资料不存在!"), //
    CRM_CUST_127("根据代扣号查询用户客户信息不存在"), //
    CRM_CUST_128("实名制办理中的证件类型为空！"), //
    CRM_CUST_129("实名制办理中的证件号码为空！"), //
    CRM_CUST_13("该服务号码[%s]客户信息不存在！"), //
    CRM_CUST_130("实名制办理中的证件类型不合法！"), //
    CRM_CUST_131("根据证件获取担保客户个人资料表无资料！"), //
    CRM_CUST_132("根据证件获取担保客户料表无资料！"), //
    CRM_CUST_133("根据证件获取客户个人资料表无资料！"), //
    CRM_CUST_134("该号码【%s】没有有效的客户信息！"), //
    CRM_CUST_135("客户接触信息修改失败！"), //
    CRM_CUST_136("该大客户用户信息不存在"), //
    CRM_CUST_137("客户积分不够"), //
    CRM_CUST_138("该客户不能办理为其他客户担保开机业务！"), //
    CRM_CUST_139("该用户不是大客户，不可以办理该业务！"), //
    CRM_CUST_14("尊敬的客户，您输入的担保人信息不完整，请验证后，重新输入！"), //
    CRM_CUST_140("该大客户不能办理为其他客户担保开机业务!"), //
    CRM_CUST_141("该大客户类型，不可以办理该业务!"), //
    CRM_CUST_142("该用户的大客户类型，不可以办理该业务!"), //
    CRM_CUST_143("尊敬的用户您好,根据该手机号码对应的担保人id获取担保人客户资料无数据"), //
    CRM_CUST_144("尊敬的用户您好,根据该手机号码对应的担保人id获取担保人客户档案资料无数据！"), //
    CRM_CUST_145("尊敬的用户您好,根据useCust_Id获取使用者客户资料无数据！"), //
    CRM_CUST_146("尊敬的用户您好,根据useCust_Id获取使用者客户档案资料无数据！"), //
    CRM_CUST_147("你输入的担保人姓名与该证件对应的姓名不一致，请重新输入担保人姓名!"), //
    CRM_CUST_148("客户级别不够"), //
    CRM_CUST_149("获取客户资料失败！"), //
    CRM_CUST_150("该客户为黑名单客户！"), //
    CRM_CUST_151("非VIP客户，不能转移VIP客户等级！"), //
    CRM_CUST_152("查询TD无线座机%s无客户信息，不能添加为无线座机！"), //
    CRM_CUST_153("查询成员%s无客户信息，不能添加为成员！"), //
    CRM_CUST_154("查询副卡%s无客户信息，不能添加为副卡！"), //
    CRM_CUST_155("查询主卡%s无客户信息，不能添加为主卡！"), //
    CRM_CUST_156("缺少客户信息[%s]"), //
    CRM_CUST_159("客户身份证号码或vip卡号错误"), //
    CRM_CUST_16("性别不能为空"), //
    CRM_CUST_160("客户资料不存在或客户详细信息不存在！"), //
    CRM_CUST_161("该号码【%s】没有客户资料信息！"), //
    CRM_CUST_162("INSURE_INFO填写错误[身份证&被保险人姓名&当前居住地址&有效通讯联系方式，中间用&符号隔开]"), //
    CRM_CUST_163("POST_INFO填写错误[邮寄姓名，邮寄地址，邮政编码。中间用~符号隔开]"), //
    CRM_CUST_164("输入错误，该客户不属于目标客户，限制办理当前业务"), //
    CRM_CUST_165("获取客户资料无数据!"), //
    CRM_CUST_167("获取大客户资料无数据!"), //
    CRM_CUST_168("尊敬的用户，您好！手机号码连带关系查询：获取客户资料信息无数据！"), //
    CRM_CUST_169("获取大客户资料无数据，用户当前套餐也不是全球通288/388/588/888商旅、上网套餐，不能办理该业务！"), CRM_CUST_17("性别值错误"), //
    CRM_CUST_170("随行人员过多"), //
    CRM_CUST_171("获取是否需要取客户接触信息标记失败!"), //
    CRM_CUST_172("客户等级不够!"), //
    CRM_CUST_173("vip卡号对应的大客户不存在!"), //
    CRM_CUST_174("客户密码错误!"), //
    CRM_CUST_175("客户证件类型错误!"), //
    CRM_CUST_176("客户证件号码错误!"), //
    CRM_CUST_178("获取大客户信息无数据!"), //
    CRM_CUST_179("1217:客户姓名不一致!"), //
    CRM_CUST_18("客户名称与账户名称不一致"), //
    CRM_CUST_180("该客户还不是大客户用户，不能办理大客户备卡申请业务！"), //
    CRM_CUST_181("【%s】的客户信息不存在，业务不能继续！"), //
    CRM_CUST_182("该客户还不是大客户用户，不能办理大客户备卡取消业务！"), //
    CRM_CUST_183("符合查询条件的客户信息不存在!"), //
    CRM_CUST_184("用户%s的家长号码:%s不是移动号段号码！"), //
    CRM_CUST_185("用户%s的老师号码:%s不是移动号段号码！"), //
    CRM_CUST_186("用户%s的校长号码:%s不是移动号段号码！"), //
    CRM_CUST_187("请检查用户%s的家长号码%s的位数！"), //
    CRM_CUST_188("请检查用户%s的校长号码%s的位数！"), //
    CRM_CUST_189("请检查用户%s的老师号码%s的位数！"), //
    CRM_CUST_19("客户积分不够"), //
    CRM_CUST_190("用户%s的家长号码:%s不是正常在网的本省移动用户！"), //
    CRM_CUST_191("用户%s的家长号码%s已经管理了一个号码为:%s,不能再管理另一个号码！"), //
    CRM_CUST_192("经办人只能选择个人证件"), //
    CRM_CUST_193("黑白名单数据为空!"), //
    CRM_CUST_194("无该客户CUST信息【%s】!"), //
    CRM_CUST_195("身份证年龄小于12岁，不能办理该业务！"), //
    CRM_CUST_196("身份证年龄大于120岁，不能办理该业务！"), //
    CRM_CUST_197("该工号没有代办入网的权限！（仅限自办营业厅工号能申请该权限）"), //
    CRM_CUST_198("经办人年龄不能小于16岁"), //
    CRM_CUST_199("经办人证件号码错误"), //
    CRM_CUST_1111("法人信息不能为空！"),
    CRM_CUST_1112("营业开始日期不能为空！"),
    CRM_CUST_1113("营业结束日期不能为空！"),
    CRM_CUST_1114("成立日期不能为空！"),
    CRM_CUST_1115("机构类型不能为空！"),
    CRM_CUST_1116("有效日期不能为空！"),
    CRM_CUST_1117("失效日期不能为空！"),
    CRM_CUST_2("查询客户信息无资料！"), //
    CRM_CUST_20("大客户号码不能为空"), //
    CRM_CUST_200("根据客户标识号获取客户资料无数据！"), //
    CRM_CUST_2001("新增家庭客户资料出错！"), //
    CRM_CUST_2002("增加家庭虚拟用户:查询主卡客户资料无数据！"), //
    CRM_CUST_2003("增加家庭虚拟用户出错！"), //
    CRM_CUST_2004("注销家庭客户资料出错！"), //
    CRM_CUST_2005("注销家庭虚拟客户资料出错！"), //
    CRM_CUST_2006("新增家庭成员优惠出错！"), //
    CRM_CUST_2007("删除家庭成员优惠出错！"), //
    CRM_CUST_2008("修改家庭成员优惠出错！"), //
    CRM_CUST_2009("未进行实名登记用户不可以办理!"), //
    CRM_CUST_201("客户标识号获取客户资料无数据！"), //
    CRM_CUST_202("未知的查询类型！"), //
    CRM_CUST_203("新增担保客户个人资料返回出错！"), //
    CRM_CUST_204("获取客户资料台帐无数据！"), //
    CRM_CUST_205("更新找到个人客户资料出错！"), //
    CRM_CUST_206("新增客户资料出错！"), //
    CRM_CUST_207("新增个人客户资料出错！"), //
    CRM_CUST_208("修改客户核心资料表预留字段返回出错！"), //
    CRM_CUST_209("获取客户资料台帐无数据！"), //
    CRM_CUST_21("大客户经理号码不能为空"), //
    CRM_CUST_210("更新客户资料出错！"), //
    CRM_CUST_211("获取个人客户资料修改台帐无数据！"), //
    CRM_CUST_212("更新找到个人客户资料出错！"), //
    CRM_CUST_213("新增客户资料出错！"), //
    CRM_CUST_214("获取个人客户资料新增台帐无数据！"), //
    CRM_CUST_215("新增个人客户资料出错！"), //
    CRM_CUST_216("修改客户核心资料表预留字段返回出错！"), //
    CRM_CUST_217("获取台帐流水异常！"), //
    CRM_CUST_218("获取客户个人资料台帐表为空！"), //
    CRM_CUST_219("获取客户资料台帐表为空！"), //
    CRM_CUST_22("大客户信息不存在！"), //
    CRM_CUST_220("修改客户核心资料表返回出错！"), //
    CRM_CUST_221("修改客户核心资料表预留字段返回出错！"), //
    CRM_CUST_222("修改客户个人资料返回出错！"), //
    CRM_CUST_223("修改使用客户个人资料返回出错！"), //
    CRM_CUST_224("vip卡号为空！"), //
    CRM_CUST_225("根据计费号码【%s】查询不到TF_F_CUST_VIP表的有效记录！"), //
    CRM_CUST_23("该号码对应的大客户信息不存在！"), //
    CRM_CUST_24("该客户信息[%s]不存在！"), //
    CRM_CUST_25("该大客户暂时未分配客户经理"), //
    CRM_CUST_26("该大客户经理无权限为此大客户停开机"), //
    CRM_CUST_27("弱密码管理:根据客户标识[%s]没有找到客户资料!"), //
    CRM_CUST_28("查询客户资料无信息！"), //
    CRM_CUST_29("获取客户资料无数据!"), //
    CRM_CUST_3("客户经理短信停开机：业务异常！"), //
    CRM_CUST_30("获取客户信息无客户资料"), //
    CRM_CUST_300("该号码对应的客户经理信息不存在！"), //
    CRM_CUST_3000("根据%s查询用户资料不存在！"), //
    CRM_CUST_3001("根据%s查询客户经理资料不存在！"), //
    CRM_CUST_3002("根据%s查询客户资料不存在！"), //
    CRM_CUST_3003("参数[%s]值错误！"), //
    CRM_CUST_3004("%s值必须小于%s！"), //
    CRM_CUST_3005("%s值不能超过%s！"), //
    CRM_CUST_3006("非集团管理员，无法登陆！"), //
    CRM_CUST_3007("集团未设置管理员！"), //
    CRM_CUST_3008("您没有权限进行此操作！"), //
    CRM_CUST_3009("集团没有设置密码，请联系客户经理设置密码！"), //
    CRM_CUST_3010("密码输入错误%s次，今日无法登陆！"), //
    CRM_CUST_3011("集团没有设置密码，请联系客户经理设置密码！"), //
    CRM_CUST_3012("集团没有设置密码，请联系客户经理设置密码！"), //
    CRM_CUST_3090("存储过程%s执行异常！异常原因：%s"), //
    CRM_CUST_3091("字段[%s]格式错误，无法转换为Date"), //
    CRM_CUST_31("[客服密码]或者[证件类型和号码]必须至少存在一项！ "), //
    CRM_CUST_32("【%s】的客户信息不存在，业务不能继续！"), //
    CRM_CUST_33("不是新客户，不能办理本业务！"), //
    CRM_CUST_34("查询服务号码无客户信息！"), //
    CRM_CUST_35("客户资料不存在"), //
    CRM_CUST_36("查询该证件号码宽带资料无信息"), //
    CRM_CUST_37("查询客户信息不存在【TF_F_CUSTOMER】"), //
    CRM_CUST_38("查询客户信息不存在【TF_F_CUST_GROUP】"), //
    CRM_CUST_39("查询客户信息出错"), //
    CRM_CUST_4("客户经理短信停开机:获取查询条件失败！"), //
    CRM_CUST_40("查询主卡:%s无客户资料!"), //
    CRM_CUST_41("此功能限用于VIP客户!"), //
    CRM_CUST_42("此用户的客户信息不存在！"), //
    CRM_CUST_43("读取客户资料为空!请检查客户资料是否同步成功!"), //
    CRM_CUST_44("对不起，非大客户不能办理！"), //
    CRM_CUST_45("对不起，根据您输入的证件类型和证件号码获取客户档案资料无数据!"), //
    CRM_CUST_46("根据USER_ID【%s】查询TF_F_CUST_VIP有效记录发生异常！"), //
    CRM_CUST_47("对不起，根据您输入的证件类型和证件号码无客户信息"), //
    CRM_CUST_48("对不起，您输入的证件类型和证件号码对应的客户为黑名单客!"), //
    CRM_CUST_49("非热线红名单客户不能进行垃圾短信开机操作！"), //
    CRM_CUST_5("客户经理短信停开机:客户经理或普通客户不存在，请检查输入！"), //
    CRM_CUST_50("服务号码[%s]查询不到用户年度拍照中高端客户信息！"), //
    CRM_CUST_51("该服务号码[%s]客户信息不存在！"), //
    CRM_CUST_52("该服务号码[%s]已加入黑名单，生效时间为%s！"), //
    CRM_CUST_53("该号码的客户资料不存在"), //
    CRM_CUST_54("该号码客户资料不存在!"), //
    CRM_CUST_55("该客户信息[%s]不存在！"), //
    CRM_CUST_56("该用户没有该业务类型可返销数据！"), //
    CRM_CUST_57("查询客户级别对应关系发生异常！"), //
    CRM_CUST_58("该用户有未完的生日畅打登记工单~~!业务流水号:%s"), //
    CRM_CUST_59("该证件已达最大开户限制数【%s】个，不能再次使用该证件办理该业务！"), //
    CRM_CUST_6("客户经理短信停开机:客户经理或普通客户不存在，请检查输入！"), //
    CRM_CUST_60("根据cust_id查询客户信息无数据"), //
    CRM_CUST_61("根据cust_id在tf_f_customer查询无数据"), //
    CRM_CUST_62("根据服务号码[%s]查询不到用户年度拍照中高端客户信息！"), //
    CRM_CUST_63("根据服务号码，未查询到生日畅打登记信息[%s]"), //
    CRM_CUST_64("根据证件号码[%s]获取客户[%s]无个人客户资料！"), //
    CRM_CUST_65("根据证件获取客户个人资料表无资料！"), //
    CRM_CUST_66("获取[SERIAL_NUMBER]客户资料错误！"), //
    CRM_CUST_67("获取该号码客户资料无数据"), //
    CRM_CUST_68("[%s]不在黑/白名单中，不能进行删除操作！"), //
    CRM_CUST_69("获取个人客户资料无数据!"), //
    CRM_CUST_7("村通工程特殊号码维护:一个村通工程号最多可以申请%s个特殊号码！"), //
    CRM_CUST_70("获取个人客户资料信息出错，业务不能继续！"), //
    CRM_CUST_71("获取核心客户资料无数据!"), //
    CRM_CUST_72("获取客户级别"), //
    CRM_CUST_73("获取客户信息无数据！"), //
    CRM_CUST_74("获取客户异动信息资料异常!"), //
    CRM_CUST_75("获取总机客户信息无数据！"), //
    CRM_CUST_76("寄送地邮政编码、寄送地址、收件人姓名、联系电话 四个条件必须同时为空或者同时不为空！"), //
    CRM_CUST_77("客户标识不能为空！"), //
    CRM_CUST_78("客户名称不能为空!"), //
    CRM_CUST_79("[%s]已经在黑/白名单中，请不要重复新增！"), //
    CRM_CUST_8("未查询到客户信息请检查"), //
    CRM_CUST_80("联系地址不能为空!"), //
    CRM_CUST_81("联系人不能为空!"), //
    CRM_CUST_82("没有查询到相应的客户信息!"), //
    CRM_CUST_83("没有该客户的信息！"), //
    CRM_CUST_84("没有该用户的大客户信息，不能办理该业务！"), //
    CRM_CUST_85("你的证件类型不是身份证，请先做资料变更再办理本业务！"), //
    CRM_CUST_86("请输入手机号码!"), //
    CRM_CUST_87("请选择客户经理！"), //
    CRM_CUST_88("身份证号不合法！"), //
    CRM_CUST_89("身份证号码ID_CARD,IC卡号IC_CODE不能为空!"), //
    CRM_CUST_891("客户姓名不符合要求！"), CRM_CUST_892("登记地址不符合要求！"), CRM_CUST_9("业务受理前条件判断：黑名单客户不能办理当前业务！"), //
    CRM_CUST_90("查询客户信息异常！"), //
    CRM_CUST_881("使用人证件号不能为空!"), //
    CRM_CUST_882("使用人证件与开户时填写证件不一致!"), //
    CRM_CUST_91("身份证号码ID_CARD不能为空"), //
    CRM_CUST_92("同一证件号码下面客户开户数不能超过%s个"), //
    CRM_CUST_93("未传入客户ID"), //
    CRM_CUST_94("未获取到此号码的随E行捆绑VIP信息![%s]"), //
    CRM_CUST_95("修改客户称谓失败~"), //
    CRM_CUST_96("业务受理前条件判断-获取客户核心资料无数据!"), //
    CRM_CUST_97("用户%s不是VIP钻金银客户,不能调整服务次数"), //
    CRM_CUST_98("用户【%s】的客户信息不存在，业务不能继续！"), //
    CRM_CUST_99("用户不是钻石卡或金卡大客户，不允许办理国际长途和国际漫游业务！"), //
    CRM_CUST_991("符合查询条件的客户信息不存在!"), //
    CRM_CUST_992("错误数据！该账户号码不存在！"), //
    CRM_CUST_993("获取TRADE_ID失败！"), //
    CRM_CUST_994("701020:s%！"), //
    CRM_CUST_995("解析服务状态:未输入用户标识！"), //
    CRM_CUST_996("根据集团客户编码[%s]未查询到集团客户信息"), //
    CRM_CUST_997("客户经理工号[%s]不存在！"), //
    CRM_CUST_998("员工[%s]不属集团客户经理！"), //
    CRM_CUST_999("推荐号码[%s]不属于集团成员"), //
    CRM_CUST_1000("推荐号码[%s]本月已经推荐了2次，不能再推荐"), CRM_CUST_1001("校验客户上次担保服务异常,本次不能受理"), CRM_CUST_1002("上次担保服务未结束,本次担保服务不能受理！"), CRM_CUST_1003("获取客户经理信息失败！"), CRM_CUST_1004("获取大客户免费换卡次数失败！"), CRM_CUST_1005("获取在网3年以上老客户免费换卡次数失败！"), CRM_CUST_1006(
            "该用户已经办理了实名制业务！"), CRM_CUST_1007("此证件类别无法通过短信办理实名制登记！"), CRM_CUST_1101("VIP卡号错误！"), CRM_CUST_1102("本次办理特殊开机业务不成功，您已经特殊开机一次!"), CRM_CUST_1103("本次办理特殊开机业务不成功，您已经特殊开机两次!"), CRM_CUST_1104("本次办理特殊开机业务不成功，您已经特殊开机超过允许次数!"), CRM_CUST_1105(
            "贵宾卡担保开机次数已达[%s]次，不能继续担保!"), CRM_CUST_1106("银卡担保开机次数已达[%s]次，不能继续担保!"), CRM_CUST_1107("金卡担保开机次数已达[%s]次，不能继续担保!"), CRM_CUST_1108("钻卡担保开机次数已达[%s]次，不能继续担保!"), CRM_CUST_1109("本次办理特殊开机业务失败，您上次特殊开机请求还未完成!"), ;

    private final String value;

    private CustException(String value)
    {

        this.value = value;
    }

    public String getValue()
    {

        return value;
    }
}
