
package com.asiainfo.veris.crm.order.pub.exception;

import com.asiainfo.veris.crm.order.pub.frame.bcf.exception.IBusiException;

public enum DMBusiException implements IBusiException // DM业务异常
{
    CRM_DM_1("DM错误，%s"), //
    CRM_DM_101("DM业务参数缺少！"), //
    CRM_DM_102("DM业务发送平台指令失败！"), //
    CRM_DM_103("DM业务返回参数数不对称！"), //
    /* --------------------- DM查询接口错误编码表 --------------------- */
    CRM_DM_104("内部错误！"), //

    CRM_DM_105("非注册用户（用户未在DM平台中注册）！"), //
    CRM_DM_106("非注册终端（终端未在DM平台中注册）！"), //
    CRM_DM_107("终端不支持固件升级功能！"), //
    CRM_DM_108("无可用升级包！"), //
    CRM_DM_109("终端不支持固件回退功能！"), // 
    CRM_DM_110("无可用回退包！"), //
    CRM_DM_111("终端不支持应用软件下载安装功能！"), //
    CRM_DM_112("无可用应用软件包！"), //
    CRM_DM_113("终端型号不存在！"), //
    CRM_DM_114("其它！"), //
    /* --------------------- 异地写卡发起方 错误编码表 --------------------- */
    CRM_DM_115("非正常在网用户不能办理远程写卡业务！"), //

    CRM_DM_116("异地写单号卡激活失败！"), //
    CRM_DM_117("异地写多号卡激活失败！"), //
    CRM_DM_118("该客户已经订购了手机支付业务，请客户直接联系归属地10086，由归属地客服接手写卡服务。"), //
    /* --------------------- DM业务开通 --------------------- */
    CRM_DM_119("该IMEI已开通DM业务，不能重复办理！"), //

    CRM_DM_120("该业务不允许在异地受理！"), //
    CRM_DM_121("该业务非大客户不能办理！"), //
    CRM_DM_122("该手机号码已开通DM业务，不能办理该业务！"), //
    CRM_DM_123("业务办理失败！"), //
    /* --------------------- DM业务变更 --------------------- */
    CRM_DM_124("此IMEI和输入的手机号码已存在绑定关系，不能办理变更操作！"), //

    CRM_DM_125("该IMEI没有开通DM业务，不能办理该业务！"), //
    CRM_DM_126("该业务不允许在异地受理！"), //
    CRM_DM_127("该业务非大客户不能办理！"), //
    CRM_DM_128("该手机号码已开通DM业务，不能变更为此号码！"), //
    CRM_DM_129("业务办理失败！"), //
    /* --------------------- DM业务注销 --------------------- */
    CRM_DM_130("获取页面参数失败！"), //

    CRM_DM_131("该手机号码没有开通DM业务，不能办理该业务！"), //
    CRM_DM_132("该业务不允许在异地受理！"), //
    CRM_DM_133("该手机号码没有开通DM业务，不能办理该业务！"), //
    CRM_DM_134("该IMEI没有开通DM业务，不能办理该业务！"), //
    CRM_DM_135("业务办理失败！"), //
    /* --------------- DM业务锁定、解锁、数据清除 -------------- */
    CRM_DM_136("该业务不允许在异地受理！"), //

    CRM_DM_137("该手机号码没有开通DM业务，不能办理该业务！"), //
    CRM_DM_138("省代码不存在！"), //
    CRM_DM_139("发送报文失败！"), //
    CRM_DM_140("业务办理失败！"), //
    /* ------------------- DM业务操作取消 -------------------- */
    CRM_DM_141("发送报文失败！"), //

    CRM_DM_142("业务办理失败！"), //

    CRM_DM_143("查询应用软件无返回信息！"), CRM_DM_144("生成流水号失败！"), CRM_DM_145("发送请求无返回信息！"),

    CRM_DM_146("发送平台指令失败，请稍候再试！"),

    CRM_DM_147("该手机号码没有开通DM业务，无法办理取消！"),

    CRM_DM_148("传入业务标志为空！"),

    CRM_DM_149("该手机号码没有开通DM业务，无法办理取消！"),

    CRM_DM_150("获取DM业务受理资料无数据！"),

    CRM_DM_151("业务请求无返回信息！"),

    CRM_DM_152("平台请求发送成功但记录失败！"),

    CRM_DM_153("请输入手机号码或者IMEI号码！"),

    CRM_DM_154("用户信息不存在！"),

    CRM_DM_2("%s:%s");

    private final String value;

    private DMBusiException(String value)
    {

        this.value = value;
    }

    public String getValue()
    {
        return value;
    }

}
