
package com.asiainfo.veris.crm.order.pub.exception;

import com.asiainfo.veris.crm.order.pub.frame.bcf.exception.IBusiException;

public enum ElementException implements IBusiException // 产品元素异常
{
    CRM_ELEMENT_1("%s%s],无法再新增该服务。"), //
    CRM_ELEMENT_100("优惠手机号不是省内移动号码，不能享受打多少送多少的赠送优惠；即用户考取的是省外高校，则优惠手机号仅限为原号码！"), //
    CRM_ELEMENT_101("优惠手机号是本地号码，不能享受打多少送多少的赠送优惠；即用户考取的是本地高校，则优惠手机号仅限为原号码！"), //
    CRM_ELEMENT_102("请确认优惠手机号是否为正常用户号码！"), //
    CRM_ELEMENT_103("优惠手机号不是动感地带品牌用户，不能享受打多少送多少的赠送优惠；必须先转为动感地带品牌方可办理！"), //
    CRM_ELEMENT_104("不支持的元素操作!"), //
    CRM_ELEMENT_105("不允许删除附加产品下的优惠!"), //
    CRM_ELEMENT_107("不支持的元素操作!"), //
    CRM_ELEMENT_108("X_TRADE_DISCNT不存在，请重新选择优惠！"), //
    CRM_ELEMENT_109("X_TRADE_SVC不存在，请重新选择服务！"), //
    CRM_ELEMENT_11("产品依赖互斥判断:新增服务状态[%s.%s]和服务状态[%s.%s]互斥，不能同时生效，业务不能继续办理！"), //
    CRM_ELEMENT_110("%s%s]的服务。"), //
    CRM_ELEMENT_111("短号[%s]校验没有通过，请修改!"), //
    CRM_ELEMENT_112("包元素属性表参数配置有误！"), //
    CRM_ELEMENT_113("本界面只查询动感地带用户M值！"), //
    CRM_ELEMENT_114("不存在查询的优惠信息！"), //
    CRM_ELEMENT_115("查询包信息无数据! PACKAGE_ID:%s"), //
    CRM_ELEMENT_116("查询包元素信息失败！"), //
    CRM_ELEMENT_117("查询服务名称出错"), //
    CRM_ELEMENT_118("产品依赖互斥判断:产品[%s|%s]下，包[%s|%s]是必选的，业务不能继续，请重新办理！"), //
    CRM_ELEMENT_119("传入的DISCNT_CODE[%s]与PRODUCT_ID[%s]无法对应！"), //
    CRM_ELEMENT_12("产品依赖互斥判断:新增服务状态[%s.%s]不能生效，因为它所依赖的服务状态[%s]不存在。业务不能继续办理！"), //
    CRM_ELEMENT_120("此类优惠您已经参与过%s次兑换,无法再领取!"), //
    CRM_ELEMENT_121("第%s%s行产品[%s]有必填属性[%s %s]未选择，请选择。"), //
    CRM_ELEMENT_122("服务编码为[%s]的服务信息不存在!"), //
    CRM_ELEMENT_123("第%s%s行产品[%s]有必填元素未选择，请选择。"), //
    CRM_ELEMENT_124("叠加包只能做订购操作！"), //
    CRM_ELEMENT_125("动力100优惠变更:获取已有优惠信息失败![USER_ID_A=%s][USER_ID=%s][PRODUCT_ID=%s][PACKAGE_ID=%s][DISCNT_CODE=%s]"), //
    CRM_ELEMENT_126("服务【%s】与【%s】互斥！不能同时办理"), //
    CRM_ELEMENT_127("服务代码必须以01结尾！"), //
    CRM_ELEMENT_128("服务代码必须以基本接入号开始！"), //
    CRM_ELEMENT_129("服务代码扩展必须为6位"), //
    CRM_ELEMENT_13("服务编码（BIZ_CODE）未传"), //
    CRM_ELEMENT_130("服务代码校验不通过，请重新填写！"), //
    CRM_ELEMENT_131("服务开通有必填参数未填。"), //
    CRM_ELEMENT_132("该服务无法订购该优惠!"), //
    CRM_ELEMENT_133("根据特殊优惠标识[%s]查询特殊优惠资料不存在！"), //
    CRM_ELEMENT_134("该号码已有相应的优惠，请到取消优惠后再办理!"), //
    CRM_ELEMENT_135("该用户没有开通国际漫游服务，请先开通国际漫游服务!"), //
    CRM_ELEMENT_136("该用户已经订购了年包赠送流量优惠，不能办理业务！"), //
    CRM_ELEMENT_137("根据service_id没有查到有效的服务信息"), //
    CRM_ELEMENT_138("根据服务编码[%s]无法获取服务信息"), //
    CRM_ELEMENT_139("根据服务编码[%s]找不到服务信息"), //
    CRM_ELEMENT_14("产品依赖互斥判断:新增服务状态[%s.%s]不能生效，因为它所依赖的服务状态[%s.%s]不存在。业务不能继续办理！"), //
    CRM_ELEMENT_140("根据优惠编码[%s]找不到优惠信息"), //
    CRM_ELEMENT_141("根据员工判断元素权限异常"), //
    CRM_ELEMENT_142("关闭服务【%s】失败!"), //
    CRM_ELEMENT_143("获取服务信息异常!"), //
    CRM_ELEMENT_144("根据优惠编码、产品编码查询不到资源包信息，[DISCNT_CODE]%s"), //
    CRM_ELEMENT_145("获取套餐信息异常！"), //
    CRM_ELEMENT_146("获取优惠生效，终止时间异常！"), //
    CRM_ELEMENT_147("获取优惠信息失败"), //
    CRM_ELEMENT_148("获取语音状态信息失败!"), //
    CRM_ELEMENT_149("开通服务【%s】失败!"), //
    CRM_ELEMENT_15("产品依赖互斥判断:服务状态[%s.%s]不能被删除，因为它被用户的另一个服务状态[%s.%s]所依赖。业务不能继续办理！"), //
    CRM_ELEMENT_150("开通资费【%s】失败!"), //
    CRM_ELEMENT_151("没配置虚拟用户优惠,请配置"), //
    CRM_ELEMENT_152("没有查到有效的服务信息"), //
    CRM_ELEMENT_153("没有查询到对应的服务信息"), //
    CRM_ELEMENT_154("没有获取到用户优惠信息"), //
    CRM_ELEMENT_155("获取成员老的优惠关系无数据，无法注销！"), //
    CRM_ELEMENT_156("没有家庭套餐相关的参数配置"), //
    CRM_ELEMENT_157("没有需要提交的服务!"), //
    CRM_ELEMENT_158("没有找到副卡的优惠信息！"), //
    CRM_ELEMENT_159("没有找到无线音乐会员的局数据"), //
    CRM_ELEMENT_16("产品依赖互斥判断:新增服务状态[%s.%s]不能生效，因为它所依赖的服务状态[%s]不存在。业务不能继续办理！"), //
    CRM_ELEMENT_160("没有找到无线座机的优惠信息！"), //
    CRM_ELEMENT_161("没有找到主卡的优惠信息！"), //
    CRM_ELEMENT_162("您订购的手机公交(公交商户:%s)当前非正常状态,无法充值!"), //
    CRM_ELEMENT_163("您选择删除的元素%s在您预约变更的主产品里是必选元素，业务无法继续！"), //
    CRM_ELEMENT_164("您选择增加的元素%s在您预约变更的主产品里无法被选择，业务无法继续！"), //
    CRM_ELEMENT_165("请不要选择重复优惠[%s]"), //
    CRM_ELEMENT_166("获取用户现有优惠出错！"), //
    CRM_ELEMENT_167("请填写产品的优惠及服务信息！"), //
    CRM_ELEMENT_168("请先在增加该号码的相关优惠"), //
    CRM_ELEMENT_169("请选择服务后再提交!"), //
    CRM_ELEMENT_17("产品依赖互斥判断:依赖[AB]记不正确！[%s]"), //
    CRM_ELEMENT_170("取得用户选择的服务绑定优惠失败！"), //
    CRM_ELEMENT_171("取得用户预约服务INST_ID失败！"), //
    CRM_ELEMENT_172("取得用户预约优惠INST_ID失败！"), //
    CRM_ELEMENT_173("权限不足，不能查询其它地州优惠！"), //
    CRM_ELEMENT_174("删除的服务下面还有成员，不能做删除操作！"), //
    CRM_ELEMENT_175("商品订单中：用户标识=[%s]在受理报文中未选择资费!"), //
    CRM_ELEMENT_176("手机红包查询接口调用异常:%s"), //
    CRM_ELEMENT_177("获取用户优惠出错！"), //
    CRM_ELEMENT_178("退订资费【%s】失败!"), //
    CRM_ELEMENT_179("未订购该类优惠或已退订，请确认！"), //
    CRM_ELEMENT_18("产品依赖互斥判断:%s，不能同时生效，业务不能继续办理！"), //
    CRM_ELEMENT_180("未能取得要修改的优惠！"), //
    CRM_ELEMENT_181("未找到有效的包标识%s信息"), //
    CRM_ELEMENT_182("无法找到服务对应的优惠!"), //
    CRM_ELEMENT_183("新增额外服务次数'%s'超过上限'%s',新增失败"), //
    CRM_ELEMENT_184("需要同步的优惠编码不能做变更！请成员退出后新增！"), //
    CRM_ELEMENT_185("虚拟优惠参数没有配置"), //
    CRM_ELEMENT_186("虚拟优惠配置不对"), //
    CRM_ELEMENT_187("选择的产品中有元素的参数配置有问题!"), //
    CRM_ELEMENT_188("没有选择服务，请确认是否有权限办理该业务！"), //
    CRM_ELEMENT_189("选择的产品中有元素的参数配置有问题，参数不全，无法计算开始时间!"), //
    CRM_ELEMENT_190("已经存在优惠编码%s"), //
    CRM_ELEMENT_191("用户不存在对应的优惠编码%s"), //
    CRM_ELEMENT_192("用户订购的元素%s未到结束时间，不能删除!"), //
    CRM_ELEMENT_193("用户还没有申请来电拒接，不能办理本业务"), //
    CRM_ELEMENT_194("用户已经订购%s，如须成功单独退订该服务，须先退订该产品包下的其他服务"), //
    CRM_ELEMENT_195("用户已经关闭通短信提醒功能！"), //
    CRM_ELEMENT_196("用户已经开通短信提醒功能！"), //
    CRM_ELEMENT_197("优惠%s的“可办理渠道”内容不正确！"), //
    CRM_ELEMENT_198("优惠%s的“明细费用构成”内容不正确！"), //
    CRM_ELEMENT_199("没有选择优惠，请为成员选择一个优惠！"), //
    CRM_ELEMENT_2("服务不存在"), //
    CRM_ELEMENT_20("产品依赖互斥判断:%s， 业务不能继续办理！"), //
    CRM_ELEMENT_200("优惠%s的“目标市场细分”内容不正确！"), //
    CRM_ELEMENT_201("优惠%s的“优惠内容”内容不正确！"), //
    CRM_ELEMENT_202("优惠%s的“语音批价类型1”内容不正确！"), //
    CRM_ELEMENT_203("优惠%s的“语音批价类型2”内容不正确！"), //
    CRM_ELEMENT_204("优惠%s的“语音批价类型3”内容不正确！"), //
    CRM_ELEMENT_205("优惠%s的“语音批价类型4”内容不正确！"), //
    CRM_ELEMENT_206("优惠%s的“语音批价类型5”内容不正确！"), //
    CRM_ELEMENT_207("优惠%s的“语音批价类型6”内容不正确！"), //
    CRM_ELEMENT_208("优惠%s的“语音批价类型7”内容不正确！"), //
    CRM_ELEMENT_209("优惠%s的“语音批价类型8”内容不正确！"), //
    CRM_ELEMENT_210("业务规则限制：所填短号(在同一VPMN集团)已经被使用！所填短号为：%s"), //
    CRM_ELEMENT_211("优惠%s的“语音赠送类型1”内容不正确！"), //
    CRM_ELEMENT_212("优惠%s的“语音赠送类型2”内容不正确！"), //
    CRM_ELEMENT_213("优惠%s的“语音赠送类型3”内容不正确！"), //
    CRM_ELEMENT_214("优惠编码缺失"), //
    CRM_ELEMENT_215("优惠编码为 %s的优惠尚在捆绑期内，不能被删除"), //
    CRM_ELEMENT_216("优惠没有对应的计费优惠:%s"), //
    CRM_ELEMENT_217("优惠没有修改操作，请检查您的输入！"), //
    CRM_ELEMENT_218("有优惠在捆绑期内。操作不能执行！"), //
    CRM_ELEMENT_219("元素类型【%s】输入有误，只能为S|D|R!"), //
    CRM_ELEMENT_22("产品依赖互斥判断:获取包与包之间限制关系类型错误![%s]"), //
    CRM_ELEMENT_220("元素没有任何变化！"), //
    CRM_ELEMENT_221("%s,该服务（优惠）设置为 4-未到元素结束日期不能取消"), //
    CRM_ELEMENT_222("用户不存在该项优惠"), //
    CRM_ELEMENT_223("只能是服务或者优惠"), //
    CRM_ELEMENT_224("主体服务不允许删除！"), //
    CRM_ELEMENT_225("资费编码【%s】没有配置!"), //
    CRM_ELEMENT_226("用户产品变更：获取已有定制记录失败！"), //
    CRM_ELEMENT_227("用户产品变更：获取用户已有服务失败！"), //
    CRM_ELEMENT_228("用户已经存在该优惠"), //
    CRM_ELEMENT_229("用户优惠变更：资源删除未找到原资源！"), //
    CRM_ELEMENT_23("产品依赖互斥判断:获取包资料[%s]无数据"), //
    CRM_ELEMENT_230("用户优惠变更：资源修改未找到原资源！"), //
    CRM_ELEMENT_231("优惠编码为[%s]的优惠信息不存在!"), //
    CRM_ELEMENT_232("优惠元素个数限制，已有优惠已经达到包元素上限"), //
    CRM_ELEMENT_233("元素类型【%s】输入有误，只能为D!"), //
    CRM_ELEMENT_234("元素类型【%s】输入有误，只能为S|D|R!"), //
    CRM_ELEMENT_235("%s,根据服务ID无法查到产品ID"), //
    CRM_ELEMENT_236("操作类型【%s】错误!"), //
    CRM_ELEMENT_237("元素ID 【%s】没有有效的PACKAGE_ID"), //
    CRM_ELEMENT_238("您选择增加的元素%s在您预约变更的主产品里无法被选择，业务无法继续！"), //
    CRM_ELEMENT_239("您选择删除的元素%s在您预约变更的主产品里是必选元素，业务无法继续！"), //
    CRM_ELEMENT_24("套餐包编码错误或缺失"), //
    CRM_ELEMENT_240("未到元素结束日期不能取消!"), //
    CRM_ELEMENT_241("用户订购的元素%s未到结束时间，不能删除!"), //
    CRM_ELEMENT_242("资费编码【%s】没有配置!"), //
    CRM_ELEMENT_243("产品【%s】的模型下不可选【%s】资费!"), //
    CRM_ELEMENT_244("该产品无法办理特殊优惠【%s】!"), //
    CRM_ELEMENT_245("优惠【%s】没有修改操作，请检查您的输入！"), //
    CRM_ELEMENT_246("%s,没找到服务元素"), //
    CRM_ELEMENT_247("用户未订购该服务【%s】，无法修改!"), //
    CRM_ELEMENT_248("请选择必选优惠组【%s】里的元素！"), //
    CRM_ELEMENT_249("包元素属性表参数配置有误！"), //
    CRM_ELEMENT_25("产品依赖互斥判断: 资费包[%s]中只能指定[%s-%s]种资费！"), //
    CRM_ELEMENT_250("取得用户选择的服务绑定优惠失败！"), //
    CRM_ELEMENT_251("用户订购的产品%s未到结束时间，不能删除!"), //
    CRM_ELEMENT_252("取得用户预约服务INST_ID失败！"), //
    CRM_ELEMENT_253("取得用户预约优惠INST_ID失败！"), //
    CRM_ELEMENT_254("全球通签约用户优惠配置有误！"), //
    CRM_ELEMENT_255("元素ID【%s】已经被订购，不允许再次操作！"), //
    CRM_ELEMENT_256("元素ID 【%s】没有有效的PRODUCT_ID"), //
    CRM_ELEMENT_257("%s编码的优惠不存在"), //
    CRM_ELEMENT_258("订购该优惠必须传生效方式参数！"), //
    CRM_ELEMENT_259("生效方式参数错误，开通的优惠不能使用该生效方式！"), //
    CRM_ELEMENT_26("产品依赖互斥判断:包[%s]选择元素最多[%s]个, 当前已选择[%s]个, 业务不能继续!"), //
    CRM_ELEMENT_260("您选择增加的元素%s在您现有的主产品里无法被选择，业务无法继续！"), //
    CRM_ELEMENT_261("该号码没有本月月底取消的优惠，无法回退！"), //
    CRM_ELEMENT_262("该号码没有下月预约生效的优惠，无法回退！"), //
    CRM_ELEMENT_263("根据优惠编码获取信息不存在"), //
    CRM_ELEMENT_264("【%s】没有订购一号通业务！"), //
    CRM_ELEMENT_265("没有优惠信息，请确认后再进行操作！"), //
    CRM_ELEMENT_266("已退订，当天不能再次办理该类优惠！"), //
    CRM_ELEMENT_267("获取优惠转出号码[%s]优惠[%s]的结束时间失败!"), //
    CRM_ELEMENT_268("%s没有选择任何元素！"), //
    CRM_ELEMENT_269("获取优惠转出号码[%s]的IMEI失败!"), //
    CRM_ELEMENT_27("产品依赖互斥判断:包[%s]选择元素最少[%s]个, 当前已选择[%s]个, 业务不能继续!"), //
    CRM_ELEMENT_270("产品依赖互斥判断:%s优惠不可以在此界面申请!"), //
    CRM_ELEMENT_271("产品依赖互斥判断:%s优惠不可以在此界面取消!"), //
    CRM_ELEMENT_272("产品依赖互斥判断:%s优惠绑定期限未满不能取消!"), //
    CRM_ELEMENT_273("产品依赖互斥判断:您在以往的业务【%s】曾经办理过同样服务【%s】，请取消后再办理！"), //
    CRM_ELEMENT_274("产品依赖互斥判断:用户当前已经有相应的服务[%s]，不能新增！"), //
    CRM_ELEMENT_275("产品依赖互斥判断:用户当前没有相应的服务[%s-%s-%s][%s]，不能删除或修改！"), //
    CRM_ELEMENT_276("产品依赖互斥判断:%s，业务不能继续，请重新办理！"), //
    CRM_ELEMENT_277("产品依赖互斥判断:当前订购的产品[%s]中的包[%s]和产品[%s]中的包[%s]互斥，不能同时生效，业务不能继续办理！"), //
    CRM_ELEMENT_279("%s是必选的，业务不能继续，请重新办理！"), //
    CRM_ELEMENT_28("产品依赖互斥判断:包[%s]选择元素最少[%s]个最多[%s]个, 当前已选择[%s]个, 业务不能继续!"), //
    CRM_ELEMENT_280("产品依赖互斥判断:%s。业务不能继续办理！"), //
    CRM_ELEMENT_281("产品依赖互斥判断:%s。业务不能继续办理！"), //
    CRM_ELEMENT_282("产品依赖互斥判断:%s。业务不能继续办理！"), //
    CRM_ELEMENT_283("产品依赖互斥判断:获取包与包之间限制关系类型错误![%s]"), //
    CRM_ELEMENT_284("业务登记后判断:判断包元素必选,传入未知的元素类型!"), //
    CRM_ELEMENT_285("产品依赖互斥判断:%s，不能同时生效，业务不能继续办理！"), //
    CRM_ELEMENT_286("产品依赖互斥判断:新产品包[%s|%s]不能生效, 因为它依赖的下列[服务 或 优惠]不存在，业务不能继续办理！\n\n%s"), //
    CRM_ELEMENT_287("产品依赖互斥判断:新产品包[%s|%s]不能生效, 因为它依赖%s[%s]不存在，业务不能继续办理！"), //
    CRM_ELEMENT_288("产品依赖互斥判断:依赖[AB]记不正确！[%s]"), //
    CRM_ELEMENT_289("产品依赖互斥判断:依赖[AB]记不正确！[%s]"), //
    CRM_ELEMENT_29("产品依赖互斥判断:不正确的产品元素类型标记[%s]！"), //
    CRM_ELEMENT_290("%s未到元素结束日期不能取消!"), //
    CRM_ELEMENT_291("产品依赖互斥判断:%s，不能同时生效，业务不能继续办理！"), //
    CRM_ELEMENT_296("产品依赖互斥判断:%s，不能删除！"), //
    CRM_ELEMENT_297("产品依赖互斥判断:不正确的产品元素类型标记%s!"), //
    CRM_ELEMENT_298("产品依赖互斥判断:%s，不能同时生效，业务不能继续办理！"), //
    CRM_ELEMENT_299("产品依赖互斥判断:%s，不能同时生效，业务不能继续办理！"), //
    CRM_ELEMENT_3("产品依赖互斥判断:%s，业务不能继续办理！[%s]"), //
    CRM_ELEMENT_30("产品依赖互斥判断:不正确的产品元素类型标记[%s]！"), //
    CRM_ELEMENT_301("没有查询到SERVICE_ID为%ss对应的服务信息！"), //
    CRM_ELEMENT_302("获取台帐资料出错！"), //
    CRM_ELEMENT_303("获取用户资料无数据！"), //
    CRM_ELEMENT_31("产品依赖互斥判断:%s，不能同时生效，业务不能继续办理！"), //
    CRM_ELEMENT_32("产品依赖互斥判断:依赖[AB]记不正确！[%s]"), //
    CRM_ELEMENT_33("产品依赖互斥判断:判断用户新增的所有元素的必选参数是否输入参数【%s】无效！"), //
    CRM_ELEMENT_34("用户已订购该服务【%s】，无法再次订购！"), //
    CRM_ELEMENT_35("服务编码不存在"), //
    CRM_ELEMENT_36("用户已订购该优惠【%s】，无法再次订购！"), //
    CRM_ELEMENT_37("用户未订购该服务【%s】，无法取消!"), //
    CRM_ELEMENT_38("用户未订购该优惠【%s】，无法取消!"), //
    CRM_ELEMENT_39("根据PRODUCT_ID没有找到对应的优惠信息"), //
    CRM_ELEMENT_40("元素ID不能为空"), //
    CRM_ELEMENT_41("元素类型不能为空"), //
    CRM_ELEMENT_42("元素类型的值只能是1或者2"), //
    CRM_ELEMENT_43("你之前未办理相应套餐或本月已经办理过变更套餐"), //
    CRM_ELEMENT_44("该号码【%s】没有有效的用户信息！"), //
    CRM_ELEMENT_45("%s短号校验失败"), //
    CRM_ELEMENT_46("该服务下没有绑定的资费数据！"), //
    CRM_ELEMENT_47("元素类型【%s】输入错误！只能为P/S/D"), //
    CRM_ELEMENT_48("元素类型【%s】输入错误！只能为R/S/D"), //
    CRM_ELEMENT_49("要变更的元素【%s】不在该用户的产品包内，不能进行操作！"), //
    CRM_ELEMENT_5("产品依赖互斥判断:%s, 业务不能继续办理!"), //
    CRM_ELEMENT_50("用户当前套餐不能升级为改套餐!"), //
    CRM_ELEMENT_51("要变更的元素【%s】与已订购的元素【%s】存在互斥！"), //
    CRM_ELEMENT_52("要变更的元素【%s】与该用户产品下已订购的元素必须部分依赖！"), //
    CRM_ELEMENT_53("要变更的元素【%s】与该用户产品下元素【%s】必须全部依赖！"), //
    CRM_ELEMENT_54("该优惠【%s】绑定了服务，不能直接删除！"), //
    CRM_ELEMENT_55("%s没有导入对应的短号！"), //
    CRM_ELEMENT_56("用户已订购该服务【%s】，不能重复订购！"), //
    CRM_ELEMENT_57("该服务【%s】不允许进行删除操作！"), //
    CRM_ELEMENT_58("该服务【%s】不允许进行修改操作！"), //
    CRM_ELEMENT_59("该元素【%s】必传参数未能获取！"), //
    CRM_ELEMENT_60("该元素【%s】的必传参数编码值输入错误！"), //
    CRM_ELEMENT_61("该元素【%s】的参数编码【%s】输入错误！"), //
    CRM_ELEMENT_62("该服务【%s】开通必须带优惠！"), //
    CRM_ELEMENT_63("该服务【%s】修改必须带优惠！"), //
    CRM_ELEMENT_64("该服务【%s】要修改的优惠编码【%s】错误！"), //
    CRM_ELEMENT_65("该服务【%s】的参数值在参数表内无对应值！"), //
    CRM_ELEMENT_66("获取服务优惠信息无数据!"), //
    CRM_ELEMENT_67("该优惠【%s】未在优惠参数表内配置！请检查优惠编码！"), //
    CRM_ELEMENT_68("用户%s短信服务状态为【%s】，不能办理该业务！"), //
    CRM_ELEMENT_69("该用户的语音服务状态为[%s],不能办理此业务！"), //
    CRM_ELEMENT_70("获取优惠编码对应的优惠信息出错,没有获取到记录信息"), //
    CRM_ELEMENT_71("取消亲情关系时，获取主卡优惠信息失败"), //
    CRM_ELEMENT_72("取消亲情关系时，获取子卡优惠信息失败"), //
    CRM_ELEMENT_73("524017-取消亲情关系时，获取子卡优惠信息失败"), //
    CRM_ELEMENT_74("获取优惠生效时间出错：无产品信息TD_B_PRODUCT-%s"), //
    CRM_ELEMENT_75("获取优惠生效，终止时间异常！"), //
    CRM_ELEMENT_76("用户已办理过相关优惠且优惠未生效，优惠编码为:%s优惠编码生效开始时间为:%s"), //
    CRM_ELEMENT_77("获取外省移动号码无数据!"), //
    CRM_ELEMENT_78("用户已存在该优惠，不可重复选择! 优惠名称【%s】"), //
    CRM_ELEMENT_79("没有查询到用户原WLAN优惠！"), //
    CRM_ELEMENT_8("产品依赖互斥判断：%s"), //
    CRM_ELEMENT_80("新优惠与原优惠重复！"), //
    CRM_ELEMENT_81("查询优惠类型无资料！"), //
    CRM_ELEMENT_82("查询优惠无资料！"), //
    CRM_ELEMENT_83("没有查询到用户原WLAN优惠！"), //
    CRM_ELEMENT_84("根据编码查询WLAN优惠失败！"), //
    CRM_ELEMENT_85("查询服务信息[TD_B_SERVICE]无资料！"), //
    CRM_ELEMENT_86("WLAN业务服务状态不匹配，业务无法继续！"), //
    CRM_ELEMENT_87("该用户没有开通WLAN服务，业务无法继续！"), //
    CRM_ELEMENT_88("获取外网服务号码无数据!"), //
    CRM_ELEMENT_89("用户%s没有开通了关爱一线通服务，无法取消！"), //
    CRM_ELEMENT_9("产品依赖互斥判断：V网成员新增特殊处理: %s"), //
    CRM_ELEMENT_90("用户:%s已经开通了关爱一线通服务，无法新增！"), //
    CRM_ELEMENT_91("获取优惠编码出错！"), //
    CRM_ELEMENT_92("用户当前没有优惠[858|呼入限制功能费]，不能删除！"), //
    CRM_ELEMENT_93("获取优惠编码出错！"), //
    CRM_ELEMENT_94("服务请求标识编码为空！"), //
    CRM_ELEMENT_95("服务请求标识为空！"), //
    CRM_ELEMENT_96("服务请求分类编码为空！"), //
    CRM_ELEMENT_97("业务受理前条件判断-特殊号码优惠包1，一年内不允许销户！"), //
    CRM_ELEMENT_98("业务受理前条件判断-特殊号码优惠包2，一年内不允许销户！"), //
    CRM_ELEMENT_99("当前优惠不存在,请确认"), //
    CRM_ELEMENT_2000("%s为携转用户，不允许办理该业务！"), //
    CRM_ELEMENT_2001("联通转接优惠[8]已失效，不能删除！"), //
    CRM_ELEMENT_2002("请选择查询类型！"), //
    CRM_ELEMENT_2003("起始号码不能比结束号码大！"), //
    CRM_ELEMENT_2004("服务号码【起始、终止】范围不能不能超过1000!"), //
    CRM_ELEMENT_2104("类型编码%s,业务编码：%s  已经存在！"), //
    CRM_ELEMENT_2124("您目前的操作权限不能将入网阀值调整至超过【30】！"), //
    CRM_ELEMENT_2125("您新增的记录已经存在或者修改的数据有误！"), //
    CRM_ELEMENT_2126("您目前的操作权限不能将入网阀值调整至超过【200】！"), //
    CRM_ELEMENT_2127("您目前的操作权限不能将入网阀值调整至超过【20】！"), //
    CRM_ELEMENT_2128("您目前的操作权限不能将入网阀值调整至超过【50】！"), //
    CRM_ELEMENT_2129("您目前的操作权限不能将入网阀值调整至超过【100】！"), //
    CRM_ELEMENT_304("产品级资费操作代码错误"), //
    CRM_ELEMENT_305("您不能通过此方式取消或更改服务或优惠【%s】,请到营业厅办理!"), //
    CRM_ELEMENT_500("当前二维码获取失败，请查询数据是否被删除"), // 二维码
    CRM_ELEMENT_306("产品依赖互斥判断:优惠【%s】不能删除, 因为它被用户的另一个优惠【%s】所依赖， 业务不能继续办理"), //
    CRM_ELEMENT_307("预约业务取消错误：%s"),//
    CRM_ELEMENT_308("订购优惠【%s】开始时间【%s】大于最大有效期【%s】,业务不能继续!"),//
    CRM_ELEMENT_309("您所预约【%s】套餐被【%s】套餐所依赖，不允许取消此工单!"),
    CRM_ELEMENT_310("%s");//
    
    private final String value;

    private ElementException(String value)
    {

        this.value = value;
    }

    public String getValue()
    {

        return value;
    }
}
