
package com.asiainfo.veris.crm.order.pub.exception;

import com.asiainfo.veris.crm.order.pub.frame.bcf.exception.IBusiException;

public enum FamilyException implements IBusiException
{

    CRM_FAMILY_1("修改关系表出错"), //
    CRM_FAMILY_10("注销家庭客户资料出错"), //
    CRM_FAMILY_11("注销家庭虚拟客户资料出错"), //
    CRM_FAMILY_12("操作类型错误0新增1删除"), //
    CRM_FAMILY_13("新增家庭成员优惠出错"), //
    CRM_FAMILY_14("删除家庭成员优惠出错"), //
    CRM_FAMILY_15("修改家庭成员优惠出错"), //
    CRM_FAMILY_16("操作类型出错0新增、1删除、2修改"), //
    CRM_FAMILY_17("删除家庭成员优惠出错"), //
    CRM_FAMILY_18("处理家庭成员用户:获取群用户号码无记录！"), //
    CRM_FAMILY_19("新增家庭成员关系出错"), //
    CRM_FAMILY_2("删除家庭成员优惠出错"), //
    CRM_FAMILY_20("删除家庭成员关系出错"), //
    CRM_FAMILY_21("修改家庭成员关系出错"), //
    CRM_FAMILY_22("新增家庭网优惠出错"), //
    CRM_FAMILY_23("删除家庭网优惠出错"), //
    CRM_FAMILY_24("增加家庭虚拟用户和主卡关系时出错"), //
    CRM_FAMILY_25("结束家庭虚拟用户和主卡关系时出错"), //
    CRM_FAMILY_26("修改家庭关系短号时出错"), //
    CRM_FAMILY_27("查询家庭客户台帐资料无数据"), //
    CRM_FAMILY_28("新增家庭用户资料出错"), //
    CRM_FAMILY_29("新增家庭用户付费关系出错"), //
    CRM_FAMILY_3("删除虚拟用户资料:注销虚拟集团用户资料无数据！"), //
    CRM_FAMILY_30("新增家庭用户帐户资料出错"), //
    CRM_FAMILY_31("查询家庭用户付费关系出错"), //
    CRM_FAMILY_32("注销家庭用户资料出错"), //
    CRM_FAMILY_33("注销虚拟用户资料:注销虚拟帐户资料出错"), //
    CRM_FAMILY_34("注销虚拟用户资料:注销虚拟帐户付费关系资料出错"), //
    CRM_FAMILY_35("删除亲情用户出错"), //
    CRM_FAMILY_36("退订宽带出错"), //
    CRM_FAMILY_37("退订宽带卡成功"), //
    CRM_FAMILY_38("更新亲情业务修改次数时，更新记录出错"), //
    CRM_FAMILY_39("插入亲情业务修改次数时出错"), //
    CRM_FAMILY_4("清理虚拟用户资料:注销虚拟客户资料出错"), //
    CRM_FAMILY_40("更新家庭群资料失败"), //
    CRM_FAMILY_41("更新家庭群成员资料失败"), //
    CRM_FAMILY_42("您不是动感地带、神州行轻松卡、神州行幸福卡用户，不能办理该业务！"), CRM_FAMILY_43("查询亲情优惠无数据"), CRM_FAMILY_44("根据INST_ID[%s]查询UU关系无数据"), CRM_FAMILY_45("查询不到主卡的亲情关系"), CRM_FAMILY_46("用户[%s]存在预约账期,请在预约账期生效后来办理该业务!"), CRM_FAMILY_47("用户[%s]不是自然月用户，请确认后在加入。"),
    CRM_FAMILY_48("对不起！你所设置亲情号码[%s]为非法号码(E001)！"), CRM_FAMILY_49("对不起！你所设置亲情号码[%s]为非法号码(E002)！"), CRM_FAMILY_5("清理虚拟用户资料:获取虚拟帐户付费关系资料出错"),
    CRM_FAMILY_501("号码[%s]为特殊号码，不享受套餐的优惠资费，请重新设置"), //
    CRM_FAMILY_51("对不起！你所设置亲情号码[%s]为非法号码(E003)！"), CRM_FAMILY_52("对不起！你所设置亲情号码[%s]为非法号码(E004)！"), CRM_FAMILY_53("没有找到虚拟用户"), CRM_FAMILY_54("主号码已存在亲亲网短号服务，不能重复办理！"), CRM_FAMILY_55("您还未申请亲情号码套餐！"), CRM_FAMILY_56("新增的亲情号码不能和主卡号码一致,请确认！"),
    CRM_FAMILY_57("号码[%s]已经在成员列表"), CRM_FAMILY_58("新增的副号码不能和主号码一致，请确认！"), CRM_FAMILY_59("请先从其他亲亲网退出再加入！"), CRM_FAMILY_60("组建亲亲网失败，因您已加入[%s]号码组建的亲亲网，不能再发起组建新的亲亲网。若需组建新的亲亲网应先退出现有亲亲网，咨询电话10086。"), //CRM_FAMILY_60("你已经是亲亲网成员副卡用户，不能创建亲亲网或为亲亲网新增成员"), //
    CRM_FAMILY_6("清理虚拟用户资料:注销虚拟帐户资料出错"), CRM_FAMILY_61("TD二代无线固话号码不能办理亲亲网业务！"), CRM_FAMILY_62("非移动全球通、神州行和动感地带品牌用户不能作为副号码！"), CRM_FAMILY_63("短号[%s]已经在成员短号列表"), //
    CRM_FAMILY_64("副号的短号不能和主号的短号一致，请确认！"), CRM_FAMILY_65("副号的短号不能和已存在的副号的短号一致，请确认！"), CRM_FAMILY_66("副号码不能和已存在的副号码一致，请确认！"), CRM_FAMILY_67("根据主卡查询不到亲亲关系"), CRM_FAMILY_68("您还未开通任何亲亲网套餐,不能办理该业务！"), CRM_FAMILY_69("非主号码不能为亲亲网成员办理短号业务！"), //
    // 接口异常提示信息
    CRM_FAMILY_70("SERIAL_NUMBER为空"), CRM_FAMILY_71("X_TAG为空"), //
    CRM_FAMILY_72("SERIAL_NUMBER_B为空"), CRM_FAMILY_73("SERIAL_NUMBER_B长度不对，长度必须是11或12"), //
    CRM_FAMILY_74("SERIAL_NUMBER_B和SEQUEN_NUM为空"), CRM_FAMILY_75("SERIAL_NUMBER_C为空"), //
    CRM_FAMILY_76("SERIAL_NUMBER_C长度不对，长度必须是11或12"), CRM_FAMILY_77("操作类型不能被识别（新增0,修改1,查询3）"), //
    CRM_FAMILY_78("号码[%s]无效"), CRM_FAMILY_701("SERIAL_NUMBER_B不能存在两个相同的值"), //
    CRM_FAMILY_202001("新增的副号码[%s]重复"), CRM_FAMILY_202002("新增副号的短号[%s]重复"),
    CRM_FAMILY_702("EFFECT_TAG值不能被识别（0－下月生效、1－立即生效）"), CRM_FAMILY_703("X_TAG值不能被识别"), //
    CRM_FAMILY_704("成员长度与增删标识长度或生效标识长度不一致"), CRM_FAMILY_705("生效标志EFFECT_TAG不能为空"), //
    CRM_FAMILY_706("输入数据为空"), CRM_FAMILY_707("该号码不是您的家庭成员号码,不能被删除"), //
    CRM_FAMILY_708("主卡不能被删除"), CRM_FAMILY_709("副卡只能删除自己"), CRM_FAMILY_710("产品ID[%s]无效"), //
    CRM_FAMILY_711("PRODUCT_ID不能为空"), CRM_FAMILY_712("优惠[%s]无效"), CRM_FAMILY_713("DISCNT_CODE不能为空"), //
    CRM_FAMILY_714("APP_DISCNT_CODE不能为空"), CRM_FAMILY_715("主卡的短号不能为空"), //
    CRM_FAMILY_716("短号[%s]非法,短号必须为【520-539】"), CRM_FAMILY_717("非移动三大品牌用户不能作为主号码！"), //
    CRM_FAMILY_718("副卡[%s]的短号不能为空"), CRM_FAMILY_719("DISCNT_CODE_B不能为空"), //
    CRM_FAMILY_720("SHORT_CODE不能为空"), CRM_FAMILY_721("传入参数SERIAL_NUMBER_B的长度与X_TAG或SHORT_CODE的长度不一致"), //
    CRM_FAMILY_722("参数缺失:需要传入公告主题"), CRM_FAMILY_723("参数缺失:需要传入登录员工ID"), CRM_FAMILY_724("参数缺失:需要传入公告内容"), //
    CRM_FAMILY_725("参数缺失:需要传入公告接收对象"), //
    CRM_FAMILY_726("X_TAG参数传值不正确"), CRM_FAMILY_727("副号发起取消统一付费关系时MODIFY_TAG传值不为1"), //
    CRM_FAMILY_728("获取成员[%s]的统一付费关系无数据"), CRM_FAMILY_729("获取成员[%s]的统一付费关系主号无数据"), //
    CRM_FAMILY_730("查询统一付费关系无数据"), CRM_FAMILY_731("副号发起查询获取主号码信息无数据"), //
    CRM_FAMILY_732("成员号码[%s]不存在短号，不能删除"), CRM_FAMILY_733("成员号码[%s]不存在短号，不能修改"), //
    CRM_FAMILY_734("不能存在相同的号码"), CRM_FAMILY_735("不能存在相同的短号"), //
    CRM_FAMILY_736("短号[%s]不能与原短号相同"), CRM_FAMILY_737("获取界面受理参数有误"), CRM_FAMILY_738("界面受理信息没查询到"), //
    CRM_FAMILY_739("没有找到您的二次确认相关信息"), //
    CRM_FAMILY_740("办理亲亲网成员拒接时成员列表参数为空！"), CRM_FAMILY_741("您已经存在亲亲网，本次创建失败！"), //
    CRM_FAMILY_742("业务受理前条件判断-成员用户[%s]有未完工的限制业务【%s】！"), CRM_FAMILY_743("业务受理前条件判断-成员用户[%s]有未完工的限制业务【%s】！"), CRM_FAMILY_79("您还未设置亲情号码！"), CRM_FAMILY_80("[%s]已经是您的亲情号码，无需重复设置"), //
    CRM_FAMILY_746("您重新设置的短号与现有短号重复，请重新设置。短号使用范围为：520至529，当前已被使用短号：%s，请您选择未被使用短号设置。"),
    CRM_FAMILY_81("您还未设置满[%s]个亲情号码，可继续设置亲情号码，查询已设置的亲情号码请发送“CXQQ”至“10658666”。"), //
    CRM_FAMILY_82("号码[%s]已经是您的亲情号码，无需进行修改。"), CRM_FAMILY_83("对不起！号码[%s]不是原来设置的亲情号码。"), //
    CRM_FAMILY_84("查询不到主卡的亲亲关系"), CRM_FAMILY_85("查询不到成员的亲亲关系"), CRM_FAMILY_86("监务通用户不能办理亲亲网短号业务！"), //
    CRM_FAMILY_87("您还未开通家庭网服务，不能办理该业务！"), //
    CRM_FAMILY_88("主号码亲亲网套餐非永久有效，不能办理亲亲网短号业务"), CRM_FAMILY_89("您还未开通亲亲网业务,不能办理该业务"), //
    CRM_FAMILY_90("办理[全网拒收]时,必须是主号办理！"), CRM_FAMILY_91("提交数据为空，请确认！"), //
    CRM_FAMILY_92("每次只能给一个成员办理拒接挂机提醒服务！"), CRM_FAMILY_93("副号码只能给自己办理，请确认！"), //
    CRM_FAMILY_94("成员[%s]不存在亲亲网短号服务,不能办理该业务！"), //
    CRM_FAMILY_95("成员[%s]已存在挂机提醒服务,不能重复办理该业务！"), //
    CRM_FAMILY_96("用户资料有误，归属于多个亲亲网"), CRM_FAMILY_97("您是亲亲网副号码，不能注销亲亲网"), //
    CRM_FAMILY_98("亲亲网已被注销，请确认再办理！"), //
    CRM_FAMILY_99("您还未开通亲亲网业务！"), //
    CRM_FAMILY_100("成员[%s]已经被删除了，请确认！"), //
    CRM_FAMILY_101("您为原亲亲网用户，还未失效，请在下账期再来办理此业务！"), CRM_FAMILY_102("已经删除的成员[%s],请勾选立即生效，再删除！"), //
    CRM_FAMILY_103("副号优惠不能为空，请确认！"), CRM_FAMILY_104("亲亲网已存在全网拒接挂机提醒服务,不需要重复办理该业务！"), //
    CRM_FAMILY_105("亲亲网已存在成员拒接挂机提醒服务,不需要重复办理该业务！"), //
    CRM_FAMILY_106("您的亲亲网已经升级过了,不需要重复办理该业务！"),	//
    CRM_FAMILY_107("您是亲亲网副号码，不能升级亲亲网"),	//
    CRM_FAMILY_108("您的亲亲网成员超出10个，不能升级亲亲网，请删除成员！"),	//
    CRM_FAMILY_109("您的亲亲网升级优惠未生效，还不能增加成员，升级优惠生效时间[%s]！"),//
    CRM_FAMILY_110("您的亲亲网存在虚拟用户，但不存在主卡关系，数据出错！"),	//
    CRM_FAMILY_111("您的亲亲网存在升级下月1日生效，如需立即生效，请办理立即生效！"),	//
    CRM_FAMILY_112("亲亲网当月累计可删除9个成员，当前已删除[%s]个成员！"),	//
    CRM_FAMILY_113("尊敬的客户，亲亲网每月最多生效两批亲亲网成员。您组建亲亲网已超出批数限制，本次操作失败。 请您下月再操作！"),	//
    CRM_FAMILY_533("您还未开通任何亲亲网套餐,不能办理该业务！"),//
    CRM_FAMILY_538("您好，此号码为待激活用户，请给待号码激活后方可继续办理。"),
    CRM_FAMILY_539("您好，此号码为非实名用户，请补录实名信息后方可继续办理。"),
    CRM_FAMILY_7("新增家庭客户资料出错"), //
    CRM_FAMILY_8("增加家庭虚拟用户:查询主卡客户资料无数据"), //
    CRM_FAMILY_801("991010:获取TF_F_USER_INFOCHANGE数据异常[%s]"), //
    CRM_FAMILY_802("880015:该号码[%s]是非正常状态用户，不能作为主卡，请确认！"), //
    CRM_FAMILY_803("880010:该号码[%s]是其他统一付费关系的副卡，不能作为主卡，请先退出！"), //
    CRM_FAMILY_903("880110:该号码[%s]是其他CPE关系的副卡，不能作为主卡，请先退出！"), //
    CRM_FAMILY_804("880011:该号码[%s]存在多条统一付费的主号UU数据，请确认！"), //
    CRM_FAMILY_904("880111:该号码[%s]存在多条CPE的主号UU数据，请确认！"), //
    CRM_FAMILY_805("880012:该号码[%s]是[%s]用户，不能作为主卡，请确认！"), //
    CRM_FAMILY_806("880014:该号码[%s]是[宽带捆绑]用户，不能作为主卡，请确认！"), //
    CRM_FAMILY_807("880016:该号码[%s]存在[%s]优惠，不能作为主卡，请确认！"), //
    CRM_FAMILY_808("889917:该号码[%s]是非正常状态用户，不能作为副卡，请确认！"), //
    CRM_FAMILY_809("889916:该号码[%s]与主号码[%s]一致，不能作为副卡，请确认！"), //
    CRM_FAMILY_811("889910:该号码[%s]是其他统一付费关系的副卡，请先退出！"), //
    CRM_FAMILY_812("889911:该号码[%s]是其他统一付费关系的主卡，请先退出！"), //
    CRM_FAMILY_911("889913:该号码[%s]是其他CPE付费关系的副卡，请先退出！"), //
    CRM_FAMILY_912("889914:该号码[%s]是其他CPE付费关系的主卡，请先退出！"), //
    CRM_FAMILY_813("880010:该号码[%s]是[%s]用户，不能作为副卡，请确认！"), //
    CRM_FAMILY_814("该号码[%s]是[宽带捆绑]用户，不能作为副卡，请确认！"), //
    CRM_FAMILY_815("889915:该号码[%s]存在往月欠费，不能作为副卡，请确认！"), //
    CRM_FAMILY_816("889918:该号码[%s]存在[%s]优惠，不能作为副卡，请确认！"), //
    CRM_FAMILY_817("532009:获取号码[%s]账期无数据！"), //
    CRM_FAMILY_818("770011:修改或删除时，获取统一付费成员UU关系出错！"), //
    CRM_FAMILY_918("770111:修改或删除时，获取CPE成员UU关系出错！"), //
    CRM_FAMILY_819("770012:本次操作导致副卡数量超过[%s]个，请确认！"), //
    CRM_FAMILY_820("770013:主号存在预约办理的活动[%s]不能解散统一付费，请先返销该预约活动后，再来办理！"), //
    CRM_FAMILY_821("770070:获取统一付费成员[%s]付费关系无数据！"), //
    CRM_FAMILY_921("770170:获取CPE付费成员[%s]付费关系无数据！"), //
    CRM_FAMILY_822("770071:获取统一付费成员[%s]付费关系存在多条数据！"), //
    CRM_FAMILY_922("770171:获取CPE付费成员[%s]付费关系存在多条数据！"), //
    CRM_FAMILY_823("660017:接口校验号码是否可以办理统一付费业务时X_TAG不为1或2！"), //
    CRM_FAMILY_824("889930:该号码[%s]已办理集团统付业务，请确认！"), //
    CRM_FAMILY_825("660011:号码[%s]已开通统一付费[已终止但本月内仍有效]！"), //
    CRM_FAMILY_925("660111:号码[%s]已开通统一付费[已终止但本月内仍有效]！"), //
    CRM_FAMILY_826("660012:号码[%s]已开通统一付费！"), //
    CRM_FAMILY_926("660112:号码[%s]已开通CPE绑定付费！"), //
    CRM_FAMILY_827("660013:号码[%s]未开通统一付费，不能关闭！"), // 
    CRM_FAMILY_927("660113:号码[%s]未开通CPE绑定付费，不能关闭！"), //
    CRM_FAMILY_828("660015:mofiy_tag为非允许的操作类型！"), //
    CRM_FAMILY_829("660016:主号[%s]尚未开通统一账户付费关系，请确认！"), //
    CRM_FAMILY_929("660016:主号[%s]尚未开通CPE绑定主号账户付费关系，请确认！"), //
    CRM_FAMILY_830("532008:号码【%s】存在预约的帐期，账期生效时间为【%s】，账期生效后才能办理统一付费业务！"), //
    CRM_FAMILY_930("532108:号码【%s】存在预约的帐期，账期生效时间为【%s】，账期生效后才能办理CPE绑定付费业务！"), //
    CRM_FAMILY_831("76603:未找到虚拟用户资料"), //
    CRM_FAMILY_832("660014:号码[%s]已关闭统一付费,本月内仍有效！"), 
    CRM_FAMILY_932("660114:号码[%s]已关闭CPE绑定付费,本月内仍有效！"), 
    CRM_FAMILY_833("短号[%s]非法,短号必须为【520-529】"),//
    CRM_FAMILY_834("660017:铁通号码[%s]或者不归属移动号码，不能办理该业务！"), //
    CRM_FAMILY_835("889931:主号码为省局账户,副号码用户归属必须与之相同！"),
    CRM_FAMILY_836("889932:市县账户不可为归属省局的用户进行统付！"),
    CRM_FAMILY_6981("6981:该用户未锁定，无需解锁！"),
    CRM_FAMILY_6982("6982:该CPE用户在本月解锁次数已达【%s】次，无法继续办理！"),
    CRM_FAMILY_6983("6983:该用户【%s】为第一次绑定，必须输入设备号码！"),
    CRM_FAMILY_6984("6984:设备号码【%s】校验无效，请录入正确的设备号码！"),
    CRM_FAMILY_9("增加家庭虚拟用户出错"),
    CRM_FAMILY_16316("移动员工不能办理该业务！"),
    CRM_FAMILY_7001("该号码[%s]不是[%s]，不能作为统付成员，请确认！"), //
    CRM_FAMILY_7002("主号码[%s]存在[和商务融合产品包话费礼包（2018）]活动，不允许解除和商务统付关系！"),
    CRM_FAMILY_7003("统付的所有成员不属于同一个集团，请确认！"),
    CRM_FAMILY_68800935("68800935:号码[%s]存在和路通活动，不允许解除统一付费关系！"),
    CRM_FAMILY_66000238("66000238:号码[%s]存在[%s]，不允许解除统一付费关系！"),
    CRM_FAMILY_66000239("66000239:该号码【%s】的角色编码无法识别【%s】！"),
    CRM_FAMILY_6985("6985:该号码已存在！"),
    CRM_GROUP_3434("组网关系已被注销，请确认再办理！ "),
    CRM_GROUP_3535("没有找到虚拟用户！ "),
    CRM_GROUP_3636("查询不到组网关系！ "),
    CRM_GROUP_3737("您的多人约消组网存在虚拟用户，但不存在主卡关系，数据出错！ "),
    CRM_GROUP_3838("主号[%s]需要有参与【宽带1+多人约消活动】才可以组网。 "),
    CRM_GROUP_3939("您的多人约消组网成员已经超过3个，请删除成员！ ");

    private final String value;

    private FamilyException(String value)
    {

        this.value = value;
    }

    public String getValue()
    {

        return value;
    }
}
