
package com.asiainfo.veris.crm.order.pub.exception;

import com.asiainfo.veris.crm.order.pub.frame.bcf.exception.IBusiException;

public enum FeeException implements IBusiException // 费用异常
{
    CRM_FEE_1("产品级资费操作代码错误"), //
    CRM_FEE_10("宽带修改价格计划失败。"), //
    CRM_FEE_100("该用户存在欠费(实时结余小于0)，不可以添加为副号码！"), //
    CRM_FEE_101("查询用户欠费失败！"), //
    CRM_FEE_102("副号存在欠费，业务无法继续!"), //
    CRM_FEE_103("请进行付费关系的操作！"), //
    CRM_FEE_104("接口业务受理前条件判断：用户已经欠费不能办理业务！"), //
    CRM_FEE_107("付费限额必须为数字"), // 
    CRM_FEE_108("业务受理前条件判断：用户已经欠费不能办理业务！"), //
    CRM_FEE_109("业务受理前条件判断：该用户为托收用户的最后一个，已经欠费，请缴费后办理业务！"), //
    CRM_FEE_11("宽带续费失败。"), //
    CRM_FEE_110("业务受理前条件判断：用户已经欠费不能办理业务！"), //
    CRM_FEE_111("业务受理前条件判断：用户有往月欠费，请先结清往月欠费后再办理业务！"), //
    CRM_FEE_112("业务受理前条件判断:用户有往月欠费不能办理业务！"), //
    CRM_FEE_113("业务前特殊限制表判断-该用户已经欠费，不能办理当前业务！"), //
    CRM_FEE_114("业务前特殊限制表判断-无权办理代理商录文欠费用户过户！"), //
    CRM_FEE_115("业务前特殊限制表判断：该用户预存话费送话费未消费完，不能办理该业务！"), //
    CRM_FEE_116("POS缴费日志数据不存在，POS缴费可能已经撤销"), //
    CRM_FEE_117("[欠费控制]: F0用户当前余额低于%s元,不能办理该业务! 用户当前余额:%s元 用户预存款:%s元!"), //
    CRM_FEE_118("该用户实时结余为【%s元】，已经欠费。您没有集团用户欠费注销权限，请联系省集团客户部处理！"), //
    CRM_FEE_119("绑定/去绑定操作的计费类型错误"), //
    CRM_FEE_12("没有查到充值记录，请核实后在操作！"), //
    CRM_FEE_120("被代付号码的账目在同一个账期内不能被多个号码重叠代付相同额度的费用!"), //
    CRM_FEE_121("充值金额不能为空!"), //
    CRM_FEE_122("充值金额错误！"), //
    CRM_FEE_123("充值失败:%s"), //
    CRM_FEE_124("此发票已经清退押金！"), //
    CRM_FEE_125("当天没有查到充值记录，请核实后在操作！"), //
    CRM_FEE_126("多个默认付费帐户！"), //
    CRM_FEE_127("付费关系没有做变更"), //
    CRM_FEE_129("该用户实时结余为【%s元】，已经欠费，不能办理业务！"), //
    CRM_FEE_13("该用户实时欠费为【%s元】，已经欠费。您没有集团用户欠费注销权限，请联系省集团客户部处理！"), //
    CRM_FEE_130("付费类型不能为空"), //
    CRM_FEE_131("该号码没有查到充值记录，请核实后在操作！"), //
    CRM_FEE_132("该用户办理过高级付费关系变更业务，不能进行开户返销，如需返销请先取消高级付费关系变更！"), //
    CRM_FEE_133("该用户办理过普通付费关系变更业务，不能进行开户返销，如需返销请先取消普通付费关系变更！"), //
    CRM_FEE_134("该用户不存在包月费，无法修改！请选择新增"), //
    CRM_FEE_135("该用户已存在包月费，无法新增！"), //
    CRM_FEE_136("根据BOOS流水号码找不到正常费用数据，请联系管理员！"), //
    CRM_FEE_137("根据付款类型编码获取付款费用时，付款编码不能为空！"), //
    CRM_FEE_138("更新用户可兑换金额出错！"), //
    CRM_FEE_139("后付费话费缴纳失败！ 原因：%s"), //
    CRM_FEE_14("没有要返销回收欠费的SP结算费用！"), //
    CRM_FEE_140("您无权修改费用！应付%s元，实际付%s元"), //
    CRM_FEE_141("帐务缴费处理异常！"), //
    CRM_FEE_142("获取付款方式子表出错！"), //
    CRM_FEE_143("获取历史台帐出错！"), //
    CRM_FEE_144("台帐费用返销出错！"), //
    CRM_FEE_145("登记费用台帐子表出错！"), //
    CRM_FEE_146("登记费用台帐出错！"), //
    CRM_FEE_147("登记付款方式子表出错！"), //
    CRM_FEE_15("没有要收取欠费的SP结算费用！"), //
    CRM_FEE_16("您没有费用减免权限，实缴金额不能小于应缴金额！"), //
    CRM_FEE_17("您填写的包月费中含有非数字字符，不能受理！"), //
    CRM_FEE_18("请选择资费后再提交!"), //
    CRM_FEE_19("手工补录收款失败，原因:%s"), //
    CRM_FEE_2("该用户实时欠费为【%s元】，费用没有结清，不能办理业务！"), //
    CRM_FEE_20("输入缴费流水号错误"), //
    CRM_FEE_21("台帐费用稽核：费用子表中的费用总额和台帐主表中的数据不符!(%s, %s)(单位：分)"), //
    CRM_FEE_22("台帐费用稽核：费用子表中的押金和台帐主表中的数据不符!(%s, %s)(单位：分)"), //
    CRM_FEE_23("台帐费用稽核：费用子表中的营业费用和台帐主表中的数据不符!(%s, %s)(单位：分)"), //
    CRM_FEE_24("该用户实时欠费为【%s元】，已经欠费，不能办理业务！"), //
    CRM_FEE_25("台帐费用稽核：费用子表中的预存和台帐主表中的数据不符!(%s, %s)(单位：分)"), //
    CRM_FEE_26("台帐费用稽核：付款方式子表中的费用总额和台账表中的数据不符!(%s, %s)(单位：分)"), //
    CRM_FEE_27("台帐费用稽核：业务台账主表中没有该笔业务数据[%s]"), //
    CRM_FEE_28("无默认付费帐户！"), //
    CRM_FEE_29("无线座机预付费充值！ 原因：%s"), //
    CRM_FEE_3("后付费缴费返销失败。"), //
    CRM_FEE_30("修改费用状态失败~"), //
    CRM_FEE_31("续费金额不能为空!"), //
    CRM_FEE_32("续费金额为0，不需缴纳费用!"), //
    CRM_FEE_33("选择个人付费，不能填写代付比例和代付金额"), //
    CRM_FEE_34("业务前规则校验：用户欠费和实时余额是必须输入项目！"), //
    CRM_FEE_35("该用户往月欠费为【%s元】，费用没有结清。您没有集团用户欠费注销权限，请联系省集团客户部处理！"), //
    CRM_FEE_36("一次性费用A端支付比例与Z端支付比例之和必须为100"), //
    CRM_FEE_37("用户%s存在欠费(实时结余小于0)，不可以加为副卡!"), //
    CRM_FEE_38("用户集团预存金额为[%s],所需集团预存金额最少为[%s],不足本地兑换！"), //
    CRM_FEE_39("预付费冲正失败！ 原因：%s"), //
    CRM_FEE_4("后付费缴费返销失败！ 原因：%s"), //
    CRM_FEE_40("预付费修改价格计划！ 原因：%s"), //
    CRM_FEE_41("预付费预付费充值失败！ 原因：%s"), //
    CRM_FEE_42("月使用费A端支付比例与Z端支付比例之和必须为100"), //
    CRM_FEE_43("赠送金额不能为空!"), //
    CRM_FEE_44("支付额度超范围"), //
    CRM_FEE_45("主付费号码为空，请关闭浏览器重新登陆！"), //
    CRM_FEE_46("该用户往月欠费为【%s元】，费用没有结清，不能办理业务！"), //
    CRM_FEE_47("资费服务与上一节点数据不一致，请核对资料。"), //
    CRM_FEE_48("该用户预存金额为【%s元】，小于该优惠预存款，请到预存统购界面存款，然后再订购该优惠！"), //
    CRM_FEE_49("获取车务通成员新增付费信息失败！"), //
    CRM_FEE_5("获取付款类型错误!"), //
    CRM_FEE_50("获取的主付费手机号码无效！"), //
    CRM_FEE_51("没有查询到开通国际长途需要缴纳的押金数目！"), //
    CRM_FEE_53("没有找到该产品级资费！"), //
    CRM_FEE_54("没有查询到开通国际漫游需要缴纳的押金数目！"), //
    CRM_FEE_55("用户没有押金，不能办理国际长途和国际漫游！"), //
    CRM_FEE_56("押金少于开通国际长途需要缴纳的押金！"), //
    CRM_FEE_57("押金少于开通国际长途和国际漫游需要缴纳的押金！"), //
    CRM_FEE_58("用户无有效付费关系资料"), //
    CRM_FEE_59("对不起，您的话费余额不足，不能订购此套餐"), //
    CRM_FEE_6("获取是否优惠每月使用费错误!"), //
    CRM_FEE_60("获取用户实时费用信息出错！"), //
    CRM_FEE_61("该用户已欠费！"), //
    CRM_FEE_62("%s用户目前只欠携出方费用,不能办理报开业务!"), //
    CRM_FEE_63("%s用户目前已经欠携出方费用,并高额停机，不能办理报开业务!"), //
    CRM_FEE_64("%s用户目前已经欠携出方费用,并高额停机，不能办理报停业务!"), //
    CRM_FEE_65("%s用户目前已经欠携出方费用,并挂失停机，不能办理报停业务!"), //
    CRM_FEE_66("%s用户目前已经欠携出方费用,并局方停机，不能办理报开业务!"), //
    CRM_FEE_67("%s用户目前已经欠携出方费用,并局方停机，不能办理报停业务!"), //
    CRM_FEE_68("%s用户目前已经欠携出方费用,并欠费停机，不能办理报开业务!"), //
    CRM_FEE_69("%s用户目前已经欠携出方费用,并欠费停机，不能办理报停业务!"), //
    CRM_FEE_7("获取用户余额失败!"), //
    CRM_FEE_70("%s用户目前已经欠携出方费用,并已经报停，不能办理报停业务!"), //
    CRM_FEE_71("该用户存在欠费(实时结余小于0)，不可以加为成员！"), //
    CRM_FEE_72("该用户存在欠费(实时结余小于0)，不可以加为副卡！"), //
    CRM_FEE_73("该用户存在欠费(实时结余小于0)，不可以加为主卡！"), //
    CRM_FEE_74("包月费必须是数字"), //
    CRM_FEE_75("该用户存在欠费(实时结余小于0)，不可以加为子卡！"), //
    CRM_FEE_76("查询用户欠费失败！"), //
    CRM_FEE_77("未查到代表号的默认付费关系"), //
    CRM_FEE_78("无高级付费关系信息，不能进行取消操作！"), //
    CRM_FEE_79("未选中任何高级付费关系记录！"), //
    CRM_FEE_8("计费类型为空"), //
    CRM_FEE_80("未获取到正常的付费关系"), //
    CRM_FEE_81("根据付费关系用户ID未获取到正常用户"), //
    CRM_FEE_82("该服务号码当前欠费！"), //
    CRM_FEE_83("该注销的副号实时欠费，请交清欠款再做销户！"), //
    CRM_FEE_84("该服务号码往月欠费！"), //
    CRM_FEE_85("查询商品付费关系失败！"), //
    CRM_FEE_86("该注销的副号实时欠费，请与账务联系！"), //
    CRM_FEE_87("该主号码下有副号实时欠费，请交清欠款再做销户！"), //
    CRM_FEE_88("查询该主号码下有副号实时欠费出错，请与账务联系！"), //
    CRM_FEE_89("该用户存在欠费，请先结清欠费再办理复机业务"), //
    CRM_FEE_9("价格计划标识不能为空!"), //
    CRM_FEE_90("该用户存在欠费%s分，请先结清欠费再办理复机业务"), //
    CRM_FEE_91("您所办包%s|%s不允许零费用记录进系统，请您退出重试，如还存在问题，请联系系统管理员"), //
    CRM_FEE_92("您所办包%s|%s不允许零预存费用记录进系统，请您退出重试，如还存在问题，请联系系统管理员"), //
    CRM_FEE_93("您所办包%s|%s不允许实缴%s大于应缴%s在无权限下进系统，请您退出重试，如还存在问题，请联系系统管理员"), //
    CRM_FEE_94("费用不合法，费用须在0-10000元之间!"), //
    CRM_FEE_95("获取折扣出错！"), //
    CRM_FEE_96("付费限额必须是数字"), //
    CRM_FEE_97("费用不能为空！"), //
    CRM_FEE_98("押金数不得少于3000元！"), //
    CRM_FEE_99("该用户当天已经结算过租金，请明天或以后再来办理结算租金业务！"), //
    CRM_FEE_149("费用检查：传入的【ADVANCE_PAY】,【RES_FEE】,【OPER_FEE】费用之和【%s】不等于【X_FPAY_FEE】费用【%s】！"), //
    CRM_FEE_148("701014:调取费用信息异常【%s】"), //
    CRM_FEE_150("转账校验失败，存折费用不够！"), //
    CRM_FEE_151("配置异常：实缴[%s]小于应缴金额[%s]"), //
    CRM_FEE_152("实缴[%s]超过配置上限[%s]"), CRM_FEE_153("没有配置产品费用!"), CRM_FEE_154("该笔业务有缴费:%s 元,不能办撤销!"), CRM_FEE_155("金额格式有误！"), CRM_FEE_156("DEPOSIT_CODE为空！"), CRM_FEE_157("获取现金、充值卡账户余额出错！"), CRM_FEE_158("用户可以参加活动，但是现金、充值卡账户余额不足%s元！"), CRM_FEE_159(
            "用户可以参加活动，但是实时结余不足%s元！"), CRM_FEE_160("用户当前余额不够扣减【%s】元国际漫游/长途押金款，业务不能继续！"),
    CRM_FEE_170("%s");
    

    private final String value;

    private FeeException(String value)
    {

        this.value = value;
    }

    public String getValue()
    {

        return value;
    }
}
