package com.asiainfo.veris.crm.order.pub.exception;

import com.asiainfo.veris.crm.order.pub.frame.bcf.exception.IBusiException;

public enum PlatException implements IBusiException // 平台异常
{
    CRM_PLAT_1("%s,PLATSVC参数未配置生成"), //
    CRM_PLAT_2("%s须输入SP服务代码！"), //
    CRM_PLAT_3("%s须输入企业代码和SP服务代码！"), //
    CRM_PLAT_4("%s未查到匹配的SP服务信息!"), //
    CRM_PLAT_5("第三方平台确认失败:SP企业代码非法"), //
    CRM_PLAT_6("第三方平台确认失败:SP业务代码非法"), //
    CRM_PLAT_7("业务平台确认失败！"), //
    CRM_PLAT_8("%s操作代码错误"), //
    CRM_PLAT_9("%s业务代码错误"), //
    CRM_PLAT_11("%s企业业务编码错误"), //
    CRM_PLAT_12("%s:DM业务返回参数数不对称"), //
    CRM_PLAT_13("OPER_CODE:%s 取值不正确"), //
    CRM_PLAT_14("%s必传参数BIZ_TYPE_CODE为空"), //
    CRM_PLAT_15("游戏平台操作调用一级boss接口失败"), //
    CRM_PLAT_16("没有找到该全退订操作对应的平台信息,请检查配置文件"), //
    CRM_PLAT_17("该用户已经订购了手机钱包业务，请先去注销手机钱包业务后再来办理业务。"), //
    CRM_PLAT_18("该用户已经订购了手机支付业务，请先去注销手机支付业务后再来办理业务。"), //
    CRM_PLAT_19("获取平台参数出错！请增加"), //
    CRM_PLAT_20("没有找到集团平台服务信息[GRP_PLATSVC],请联系管理员"), //
    CRM_PLAT_21("%s:发送平台指令失败"), //
    CRM_PLAT_22("没有找到平台服务信息,请联系管理员"), //
    CRM_PLAT_23("此企业信息已存在!"), //
    CRM_PLAT_24("此企业信息不存在!"), //
    CRM_PLAT_25("已删除的企业信息不允许修改，请重新录入!"), //
    CRM_PLAT_26("已删除的企业信息不允许重复删除，请重新录入!"), //
    CRM_PLAT_27("手机支付平台返回错误！\n[%s]%s"), //
    CRM_PLAT_28("VC平台返回数据有误！"), //
    CRM_PLAT_29("从VC平台获取有价卡信息失败！"), //
    CRM_PLAT_30("VC平台返回数据有误！"), //
    CRM_PLAT_31("查询平台服务[TD_B_PLATSVC]无资料！"), //
    CRM_PLAT_32("%s为本省号码，<br/>请到\"手机支付帐户充值冲正\"界面办理充值业务！"), //
    CRM_PLAT_33("查询平台服务属性[TD_B_PLATSVC_ATTR]无资料！"), //
    CRM_PLAT_34("请确认TD_B_PLATSVC表中%s数据已经配置好"), //
    CRM_PLAT_35("MDO订购关系查询操作失败！<br>%s"), //
    CRM_PLAT_36("不能恢复操作码为非“04”的暂停操作，前次操作码为：%s"), //
    CRM_PLAT_37("登记调用调手机支付平台出错：错误编码%s"), //
    CRM_PLAT_38("第三方平台确认失败，您不能受理此业务！"), //
    CRM_PLAT_39("调用平台接口,无欢迎词反馈!"), //
    CRM_PLAT_40("发送平台指令失败，请稍候再试"), //
    CRM_PLAT_41("该用户便民卡平台侧无此业务！"), //
    CRM_PLAT_42("该用户此业务平台侧状态不正常！"), //
    CRM_PLAT_43("%s为本省号码，<br/>请到\"手机支付账户充值\"界面办理充值业务！"), //
    CRM_PLAT_44("根据SP服务代码查询时，SP_SVC_ID不能为空！ X_GETMODE=%s"), //
    CRM_PLAT_45("根据SP企业代码查询时，SP_ID不能为空！ X_GETMODE=%s"), //
    CRM_PLAT_46("获取手机邮箱个性化参数 失败 ！"), //
    CRM_PLAT_47("鉴权通过的号码是%s,请不要换号码%s充值，或者请重新鉴权"), //
    CRM_PLAT_48("没有获取到用户平台服务信息"), //
    CRM_PLAT_49("没有找到平台服务信息,请联系管理员"), //
    CRM_PLAT_50("模糊查询SP的服务信息和企业信息时，SP_NAME和BIZ_TYPE不能同时为空！ X_GETMODE=%s"), //
    CRM_PLAT_51("平台处理异常，操作不成功！"), //
    CRM_PLAT_52("平台返回错误：%s"), //
    CRM_PLAT_53("平台请求发送成功但记录失败"), //
    CRM_PLAT_54("在TF_B_TRADE未找到139邮箱预约受理记录,TRADE_TYPE_CODE:3739,USER_ID:%s"), //
    CRM_PLAT_55("如需开通企业飞信语音功能，请填入正确有效的CENTREX属性:【Centrex平台的企业ID】属性不允许为空"), //
    CRM_PLAT_56("手机支付批扣变更不成功！返回信息为：%s"), //
    CRM_PLAT_57("手机支付批扣登记不成功！返回信息为：%s"), //
    CRM_PLAT_58("手机支付批扣取消不成功！返回信息为：%s"), //
    CRM_PLAT_59("同时根据SP企业代码和SP服务代码查询时，SP_ID和SP_SVC_ID都不能为空！ X_GETMODE=%s"), //
    CRM_PLAT_60("无法变更，找不到该用户的平台信息！"), //
    CRM_PLAT_61("宜居通平台只能做退订操作！"), //
    CRM_PLAT_62("在TD_B_PLATSVC_SMS找到多条记录,SERVICE_ID:%s"), //
    CRM_PLAT_63("支付失败->%s"), //
    CRM_PLAT_64("在TF_B_TWO_CHECK未找到或找到多条 平台业务 交易流水、短号码对应关系,OUTER_TRADE_ID:%s"), //
    CRM_PLAT_65("在TF_B_TWO_CHECK未找到或找到多条 平台业务 交易流水、短号码对应关系,OUTER_TRADE_ID:%s"), //
    CRM_PLAT_66("在TF_F_USER_PLATSVC_EC06_LOG表未找到有效记录,TRADE_ID:%s"), //
    CRM_PLAT_67("%s须输入企业代码！"), //
    CRM_PLAT_68("便民卡平台鉴权失败！"), //
    CRM_PLAT_69("该用户便民卡平台侧无此业务"), //
    CRM_PLAT_70("平台业务短信通知:没有输入手机号码！"), //
    CRM_PLAT_71("平台业务短信通知:没有输入短信内容！"), //
    CRM_PLAT_72("非法操作代码！"), //
    CRM_PLAT_73("分开关业务类型异常!"), //
    CRM_PLAT_74("%s！"), //
    CRM_PLAT_75("手机支付平台返回信息！X_RSPCODE=%s, DEAL_RESULT=%s, X_RSPDESC=%s ！"), //
    CRM_PLAT_76("sql_ref:SEL_BY_ID--->根据ID=%sCHANNEL_ID=%s发现多条有效的纪录！"), //
    CRM_PLAT_77("sql_ref:SEL_BY_ID--->根据ID=%s发现多条有效的纪录!！"), //
    CRM_PLAT_78("sql_ref:SEL_BY_LOGIN_ID--->根据LOGIN_ID=%s发现多条有效的纪录！"), //
    CRM_PLAT_79("在状态变更中发现语音服务有多个变化!"), //
    CRM_PLAT_80("重复订购叠加包的次数不能大于%s次"), //
    CRM_PLAT_81("礼品编码不存在!"), //
    CRM_PLAT_82("调积分红包接口失败!"), //
    CRM_PLAT_83("业务的属性值为必填值，请输入改属性值重新提交"), //
    CRM_PLAT_84("该业务不能在该渠道进行订购操作"), CRM_PLAT_86("该用户没有权限进行操作"), CRM_PLAT_908("您好！您的139邮箱尚未开通，直接回复kt139+邮箱密码即可开通139邮箱免费版。"), CRM_PLAT_2998_1("流水号不能为空或者错误"), //
	CRM_PLAT_90("过渡期业务不支持订购"),//
	CRM_PLAT_91("该用户已经订购旧版本服务不允许同时订购新版本服务"),//
    CRM_PLAT_2998_2("手机号码不能为空"), //
    CRM_PLAT_2998_3("操作代码不能为空"), //
    CRM_PLAT_2998_4("生效时间不能为空"), //
    CRM_PLAT_2998_5("生效时间错误"), //
    CRM_PLAT_2998_6("SP服务商代码不能为空"), //
    CRM_PLAT_2998_7("业务代码不能为空"), //
    CRM_PLAT_2998_8("实体卡号不能为空"), //
    CRM_PLAT_2998_9("对不起，您的话费余额不足，不能订购此套餐"), //
    CRM_PLAT_2998_10("用户未订购农信通百事易，不能定制内容服务！"), //
    CRM_PLAT_0904("操作代码错误"), //
    CRM_PLAT_0072("SP暂停服务"), //
    CRM_PLAT_0998("用户有未完工工单"), //
    CRM_PLAT_0905("营销活动优惠期内业务，不允许退订"), CRM_PLAT_0908("您的139邮箱尚未开通，直接回复kt139+邮箱密码即可开通139邮箱免费版"), CRM_PLAT_0908_1("您订购的农信通包半年、全年套餐在有效期内，不允许退订农信通业务"), CRM_PLAT_0910("该用户的全部业务已暂停"), //
    CRM_PLAT_0906("存在约定使用的新业务尚未到达约定期限，约定期限结束后方可办理取消"),
    CRM_PLAT_0912_1("用户服务开关已关闭或已订购该业务"), //
    CRM_PLAT_0912_2("用户已经存在该业务的互斥服务，订购失败"), //
    CRM_PLAT_0912_3("用户服务已暂停,不能进行恢复和退订以外的操作"), //
    CRM_PLAT_0912_4("内置卡并没有处理挂失状态,无需解挂操作"), //
    CRM_PLAT_0912_5("用户服务已暂停,不能进行恢复和退订以外的操作"), //
    CRM_PLAT_0912_6("用户已订购该服务"), //
    CRM_PLAT_0912_7("内置卡号已经使用"), //
    CRM_PLAT_0912_8("服务未到期，或者您同时订购了两个手机电视服务，您现在还不能进行本操作"), //
    CRM_PLAT_0912_9("用户已经通过套餐订购该业务"), //
    CRM_PLAT_0912_10("用户已经通过实体卡订购该业务"), //
    CRM_PLAT_0913("用户未订购该业务或已退订"), //
    CRM_PLAT_0913_2("用户未订购套餐，请先订购"), //
    CRM_PLAT_0913_3("用户未实体卡订购该业务或者已经到期，不能续订，请直接订购！"), //
    CRM_PLAT_0914("未开通基本业务"), //
    CRM_PLAT_0921("用户已单向停机"), //
    CRM_PLAT_0922("用户已停机"), //
    CRM_PLAT_0922_1("用户未激活"), //
    CRM_PLAT_0923("用户预销户"), //
    CRM_PLAT_0924("用户销户"), //
    CRM_PLAT_0925("用户不存在"), //
    CRM_PLAT_0953_1("用户已经通过套餐订购该业务的互斥业务"), //
    CRM_PLAT_0953_2("用户已经通过实体卡订购该业务的互斥业务"), //
    CRM_PLAT_0975_1("叠加包套餐不能退订"), //
    CRM_PLAT_0975_2("套餐未传"), //
    CRM_PLAT_0975_3("套餐编码不正确"), //
    CRM_PLAT_0975_4("用户未订购包月流量套餐，不能订购叠加包！"), //
    CRM_PLAT_0975_5("用户包月流量套餐尚未用完，不能订购叠加包！"), //
    CRM_PLAT_0975_6("用户叠加包尚未用完，不能订购！"), //
    CRM_PLAT_0975_7("重复操作，用户已经订购该套餐！"), //
    CRM_PLAT_0975_8("叠加包套餐不能变更!"), //
    CRM_PLAT_0975_9("blackberry服务编码[biz_code]未传"), //
    CRM_PLAT_0975_10("原密码未传"), //
    CRM_PLAT_0975_11("新旧密码不能相同"), //
    CRM_PLAT_0975_12("旧密码校验错误，请重新输入正确的旧密码"), //
    CRM_PLAT_0975_13("密码过于简单"), //
    CRM_PLAT_0975_14("业务级别参数错误"), //
    CRM_PLAT_0978("套餐变更操作错误"), //
    CRM_PLAT_0979_1("内置号码挂失状态不允许用户进行解挂以外的操作"), //
    CRM_PLAT_0979_2("内置号码业务受理状态不允许用户进行该操作"), //
    CRM_PLAT_0981("套餐变更操作错误"), //
    CRM_PLAT_0983("用户DSMP已关闭,请先打开DSMP开关"), //
    CRM_PLAT_0984("用户已经存在该业务的互斥服务"), //
    CRM_PLAT_0950("开关信息错误"), //
    CRM_PLAT_0952("用户已经是普通会员"), //
    CRM_PLAT_0953("用户已经是高级会员"), //
    CRM_PLAT_0954_1("用户已经是特级会员"), //
    CRM_PLAT_0954("数据校验失败!业务代码,%s,%s,%s"), //
    CRM_PLAT_0955("待查询结果集超过限制%s个，请选择其他途径查询"), //
    CRM_PLAT_0956("业务平台编码不能为空"), //
    CRM_PLAT_0957("X_CHECK_TAG取值不能为空且只能为1"), //
    CRM_PLAT_0958("BIZ_TYPE_CODE取值不能为空且只能为37"), //
    CRM_PLAT_0959("获取用户商场数据失败，请确认该客户是否办理积分商城兑换业务"), //
    CRM_PLAT_0968_1("手持终端号已经被绑定"), //
    CRM_PLAT_0969("动作原因代码非法"), CRM_PLAT_0968_2("手机号码与手持终端号没有绑定，不能进行操作"), //
    CRM_PLAT_0976("用户未绑定或已去绑定"), //
    CRM_PLAT_0977("套餐包编码错误或缺失"), //
    CRM_PLAT_0982_1("用户品牌错误"), //
    CRM_PLAT_0982_2("只有神州行两城一家用户才能办理务工信息业务！"), //
    CRM_PLAT_0985("用户余额不足，不能办理手机电视！"), //
    CRM_PLAT_0986("用户当前服务是暂停状态，不能办理套餐变更或者套餐订购操作"), //
    CRM_PLAT_0985_1("该用户已订购过中国移动手机视频精彩15优惠套餐，无需再单独订购垂直栏目"), //
    CRM_PLAT_0999_1("其它错误"), //
    CRM_PLAT_0999_2("月末两天不能去绑定"), //
    CRM_PLAT_0999_3("该号码为智能网用户，不允许办理该业务"), //
    CRM_PLAT_0999_4("百事易频道和栏目的最多只能订购三个"), //
    CRM_PLAT_0999_5("帐务鉴权失败,原因:%s"), //
    CRM_PLAT_0999_6("宜居通平台只能做退订操作！"), //
    CRM_PLAT_0999_7("139邮箱套餐变更当月只能变更一次！"), //
    CRM_PLAT_0999_8("包年期间不允许退订!"), //
    CRM_PLAT_0999_9("业务代码，内容编排类型，内容编码必填！"), //
    CRM_PLAT_0999_10("帐户余额不足,不能办理手机支付开户"), //
    CRM_PLAT_1000_1("签约变更只支持营业厅和10086网厅！"), //
    CRM_PLAT_1000_2("接口参数检查，输入参数[%s]不存在！"), //
    CRM_PLAT_1000_3("一级boss接口调用，静态参数表中未配置业务类型对应关系"), //
    CRM_PLAT_1000_4("预付费用户请提供支付条件和支付额度参数[ATTR_CODE，ATTR_VALUE]"), //
    CRM_PLAT_1000_5("触发值超范围"), //
    CRM_PLAT_1000_6("支付额度超范围"), //
    CRM_PLAT_1000_7("attr_value参数内容错误，请检查attr_vlaue内容，为分隔符分隔的数字1|触发类型|触发额度|支付额度"), //
    CRM_PLAT_1000_8("该用户没有开通手机支付业务,或手机支付业务以被暂停！"), //
    CRM_PLAT_1000_9("手机号码非主号码！"), //
    CRM_PLAT_1000_10("手机已经签约手机支付自动交费"), //
    CRM_PLAT_1000_11("该手机没有开通手机代扣签约服务"), //
    CRM_PLAT_1000_12("用户在其他缴费渠道有代缴费签约记录"), //
    CRM_PLAT_1001_1("手机号码%s无效！"), //
    CRM_PLAT_1001_2("(客服密码)或者(证件类型和号码)，必须任选一项！"), //
    CRM_PLAT_1001_3("证件号码不能为空！"), //
    CRM_PLAT_1001_4("证件类型不能为空！"), //
    CRM_PLAT_1001_5("错误：无法查找到号码为%s的用户资料！"), //
    CRM_PLAT_1001_6("客服密码错误！"), //
    CRM_PLAT_1001_7("会员卡号码错误！"), //
    CRM_PLAT_1001_8("证件类型或证件号码错误！"), //
    CRM_PLAT_1001_9("客服密码，证件类型或证件号码错误！"), //
    CRM_PLAT_1001_10("证件类型不能为空！"), //
    CRM_PLAT_1001_11("手机号对应的用户不存在！"), //
    CRM_PLAT_1002("优惠信息不存在！"), //
    CRM_PLAT_1003("不能同时操作全网wlan和校园wlan服务"), //
    CRM_PLAT_1004("两个优惠不能操作代码不相同"), //
    CRM_PLAT_1007("WLAN售卡登记记录不是购卡请求待确认状态，您可能已经回复过了"), CRM_PLAT_1000("未找到对应的WLAN售卡登记记录![%s]"), CRM_PLAT_1005("ADC 开户，没有选择基本服务参数!"), CRM_PLAT_2998("飞信大包月业务存续期间不允许退订"), CRM_PLAT_85("当前服务状态非正常商用！服务编码：[%s]"), CRM_PLAT_87("文件不存在！"), CRM_PLAT_88(
            "请配置URL地址！"), CRM_PLAT_89("请配置品牌参数！"),
    CRM_PLAT_3027("受理渠道只允许受理和飞信“二新”业务，不允许订购该业务"),
    CRM_PLAT_3027_1("受理渠道只允许受理和飞信“三新”业务，不允许订购该业务"),
    CRM_PLAT_3027_2("受理渠道只允许受理和飞信非VOLTE业务"),
    CRM_PLAT_3027_3("受理渠道只允许受理和飞信非“二新”业务"),
    CRM_PLAT_3027_4("用户主动退订和飞信业务，则不自动开通."),
    CRM_PLAT_3027_5("用户非2G/3G/4G的中国移动用户,不允许办理和飞信业务!"),

    CRM_PLAT_3028_1("MAS业务端口类别有且仅有一个主端口，目前主端口个数为0!"),
    CRM_PLAT_3028_2("MAS业务端口类别仅能有1个主端口,目前存在多个主端口(%s)!"), 
    CRM_PLAT_3021("该业务仅限营业厅退订，请您前往当地营业厅办理，感谢您的支持!中国移动!"), 
    CRM_PLAT_3030("该业务限制在该渠道进行订购及退订")    , 
    CRM_PLAT_3031("已经订购和校园业务，不允许订购或者退订名校资源")    , 
    CRM_PLAT_3032("请在个人业务/日常业务/国内和多号业务/和多号业务受理界面办理和多号业务"),
    CRM_PLAT_3033("此特殊名单信息已存在!"),
    CRM_PLAT_3034("此特殊名单信息不存在!"),
    CRM_PLAT_3035("已删除的特殊名单信息不允许修改，请重新录入!"),
    CRM_PLAT_3036("已删除的特殊名单信息不允许重复删除，请重新录入!"),
    CRM_PLAT_3037("用户手机号码不允许修改，如需操作，请重新新增一条名单!");
    private final String value;

    private PlatException(String value)
    {

        this.value = value;
    }

    @Override
    public String getValue()
    {

        return value;
    }
}
