
package com.asiainfo.veris.crm.order.pub.exception;

import com.asiainfo.veris.crm.order.pub.frame.bcf.exception.IBusiException;

public enum ResException implements IBusiException // 资源异常
{
    CRM_RES_1("调用校验验证码资源接口失败"), //
    CRM_RES_2("资源校验出错：%s"), //
    CRM_RES_4("调用资源流程失败！"), //
    CRM_RES_5("调用资源查询实物流程出错！"), //
    CRM_RES_6("该用户的资源信息不存在"), //
    CRM_RES_7("该资源不存在或者已经被占用！"), //
    CRM_RES_8("获取提取的实物明细失败!"), //
    CRM_RES_9("获取资源实体卡信息异常"), //
    CRM_RES_10("资源未返回"), //
    CRM_RES_11("调用资源接口失败"), //
    CRM_RES_12("获取资源信息SIM卡无数据!"), //
    CRM_RES_13("获取资源信息手机号码无数据!"), //
    CRM_RES_14("资源校验SIM卡错误，[%s]卡号不可用!"), //
    CRM_RES_15("资源校验号码错误，[%s]"), //
    CRM_RES_16("资源校验手机号码错误，[%s]手机号码不可用!"), //
    CRM_RES_17("资源校验失败!"), //
    CRM_RES_19("根据服务号码未获取到用户的资源信息错误(USER_RES)[%s]"), //
    CRM_RES_20("无删除备卡记录！"), //
    CRM_RES_21("该卡已经被占用！[%s]"), //
    CRM_RES_22("无新增备卡记录！"), //
    CRM_RES_23("删除彩号预占临时表失败！"), //
    CRM_RES_24("该号码存在【用户开户或批量生成预开用户】未完工工单，不可以开户！"), //
    CRM_RES_25("该号码不可以开户，请检查该号码资料、对应卡资料或者对应用户资料!"), //
    CRM_RES_26("修改卡源占用表状态失败！"), //
    CRM_RES_27("查询新卡卡号资源资料失败！"), //
    CRM_RES_28("根据sim卡号查询卡资料失败，请检查地市编码是否和登录员工一致！simcardNo=%s, eparchyCode=%s！"), //
    CRM_RES_29("修改新卡为占用状态失败！"), //
    CRM_RES_30("更新号卡对应关系失败！"), //
    CRM_RES_31("查询新卡卡号资源资料失败！"), //
    CRM_RES_32("修改后的IMSI号和用户资源表里卡号对应的IMSI号不一致！"), //
    CRM_RES_33("修改卡源占用表的状态失败！"), //
    CRM_RES_34("资源状态复制失败！"), //
    CRM_RES_35("修改无线传真号码状态失败！"), //
    CRM_RES_36("获取资源资料失败！"), //
    CRM_RES_37("资源初始化必输项检验出错！"), //
    CRM_RES_38("IMEI资料修改失败！"), //
    CRM_RES_39("资源管理器返回预占失败！"), //
    CRM_RES_40("用户资源资料获取出错！"), //
    CRM_RES_41("释放员工占用资源失败！"), //
    CRM_RES_42("获取用户现有sim卡资料失败！"), //
    CRM_RES_43("删除选占资料失败！"), //
    CRM_RES_44("释放员工占用资源失败！"), //
    CRM_RES_45("资源管理器占用失败！"), //
    CRM_RES_46("删除选占资料失败！"), //
    CRM_RES_47("资源管理器返回恢复资源失败！"), //
    CRM_RES_48("获取用户资源资料无数据！"), //
    CRM_RES_49("计算代办费出错！"), //
    CRM_RES_50("计算代办费返销出错！"), //
    CRM_RES_51("获取台帐流水异常！"), //
    CRM_RES_52("获取当前省代码无有效数据！"), //
    CRM_RES_53("修改CMNET资源状态失败！"), //
    CRM_RES_54("修改CMNET占用资源失败！"), //
    CRM_RES_55("资源管理器占用删除失败！"), //
    CRM_RES_56("资源管理器返回占用结果失败！"), //
    CRM_RES_57("恢复原用户号码和sim卡绑定关系失败！"), //
    CRM_RES_58("获取有价卡台账出错！"), //
    CRM_RES_59("获取设备费用台帐资料无数据！"), //
    CRM_RES_60("实体卡销售出错！"), //
    CRM_RES_61("通过有价卡卡号和业务类型获取台帐资料出错！"), //
    CRM_RES_62("取有价卡换卡中新旧卡号出错！"), //
    CRM_RES_63("取起始至中止卡段出错！"), //
    CRM_RES_64("通过有价卡卡号和业务类型获取台帐资料出错！"), //
    CRM_RES_65("输入业务必输项内容出错！"), //
    CRM_RES_66("获取台帐资料无数据！"), //
    CRM_RES_67("调用资源更新接口出错！"), //
    CRM_RES_68("刮刮卡处理出错！"), //
    CRM_RES_69("获取当前省代码无有效数据！"), //
    CRM_RES_70("代理商补录不提供返销！"), //
    CRM_RES_71("调用资源返销接口出错！"), //
    CRM_RES_72("有价卡销售出错！"), //
    CRM_RES_73("该串号不存在社会渠道分销库中，请确认!"), //
    CRM_RES_74("该串号已经销售，不能再次销售!"), //
    CRM_RES_75("该串号目前为不可销售状态!"), //
    CRM_RES_76("此终端不属于该部门，不能办理!"), //
    CRM_RES_77("该串号已经在撮合采购串码库销售，不能再次销售!"), //
    CRM_RES_78("该抵金券档次不存在!"), //
    CRM_RES_79("资源管理器返回预占失败!"), //
    CRM_RES_80("输入的卡号不在同一号段!"), //
    CRM_RES_81("批处理出错，有价卡一次批处理10张，请分开处理!"), //
    CRM_RES_82("获取资源有价卡信息出错!"), //
    CRM_RES_83("557504:特殊补偿卡业务：没有找到该SIM卡类型的补偿费用！"), CRM_RES_84("获取当前成员的资源信息失败，缺少短号资源!"), CRM_RES_85("获取当前用户SIM卡信息失败!"), CRM_RES_86("查询资源接口根据SIM卡号【%s】获取SIM卡信息失败!"), CRM_RES_87("获取外网服务号码无数据!"), CRM_RES_88("调用资源获取销售价格失败!"), CRM_RES_89(
            "新旧实体卡类型不一致，无法更换!"), CRM_RES_90("获取%s实体卡资源未返回!"), CRM_RES_91("获取%s实体卡信息异常!"), CRM_RES_92("预开未返单用户无法办理该项业务,请为用户买断开户后再来办理!"),;

    private final String value;

    private ResException(String value)
    {

        this.value = value;
    }

    public String getValue()
    {

        return value;
    }
}
