
package com.asiainfo.veris.crm.order.pub.exception;

import com.asiainfo.veris.crm.order.pub.frame.bcf.exception.IBusiException;

public enum UUException implements IBusiException // 用户关系异常
{
    CRM_UU_1("%s 已经是家庭套餐TD无线座机[主卡手机号：%s]"), //
    CRM_UU_2("不存在对应的群内组成员关系[成员User_id: %s, TeamID: %s]，无法执行操作关系！"), //
    CRM_UU_3("查询成员%s无客户信息，不能添加为成员！"), //
    CRM_UU_4("查询副卡%s无客户信息，不能添加为副卡！"), //
    CRM_UU_5("查询主卡%s无用户信息，不能添加为主卡！"), //
    CRM_UU_6("家庭套餐TD无线座机只能添加本地用户！"), //
    CRM_UU_7("家庭套餐td无线座机只能添加本地用户！"), //
    CRM_UU_8("家庭套餐副卡只能添加本地用户！"), //
    CRM_UU_9("成员%s不可以是联通号码！"), //
    CRM_UU_10("副卡%s不可以是联通号码！"), //
    CRM_UU_11("主卡%s不可以是联通号码！"), //
    CRM_UU_12("%s 已经是家庭套餐副卡[主卡手机号：%s]"), //
    CRM_UU_13("成员%s只可以是移动号码！"), //
    CRM_UU_14("副卡%s只可以是移动号码！"), //
    CRM_UU_15("主卡%s只可以是移动号码！"), //
    CRM_UU_16("成员%s不能添加为成员：成员产品限制！"), //
    CRM_UU_17("副卡%s不能添加为副号：副卡产品限制！"), //
    CRM_UU_18("该号码已经开通了IP业务!绑定的手机号码为:%s"), //
    CRM_UU_19("该号码是影号副号码，不能办理复机业务"), //
    CRM_UU_20("家长号码已经管理了一个号码，号码为:%s,不能再管理另一个号码！"), //
    CRM_UU_21("请检查用户%s的家长号码没有传入，请重新传入！"), //
    CRM_UU_22("没有获取到有效的副号码信息！"), //
    CRM_UU_23("%s 已经是家庭套餐主卡"), //
    CRM_UU_24("要删除的副卡号码%s不在主卡%s的亲情中！"), //
    CRM_UU_25("要新增的副卡号码%s已经在主卡%s的亲情中！"), //
    CRM_UU_26("被叫一号通,主号不能作为副号添加！"), //
    CRM_UU_27("被叫一号通最多只能绑定3个副号码！"), //
    CRM_UU_28("不存在[%s]的关系,不需要退出"), //
    CRM_UU_29("对不起，当前产品限制不可以办理此项亲情业务。%s"), //
    CRM_UU_30("对不起，当前亲情产品不允许添加非当前地州库号码或非移动号码%s"), //
    CRM_UU_31("服务号码为【%s】的成员存在与家庭相关的营销活动,不能销户！"), //
    CRM_UU_32("副号码的个数不能大于3个,业务中止办理"), //
    CRM_UU_33("副号码校验失败！--%s"), //
    CRM_UU_34("%s的产品ID[%s]不能办理家庭套餐的TD无线座机"), //
    CRM_UU_35("副卡必须是移动或者联通的号码！%s"), //
    CRM_UU_36("该服务号码[%s]已是[%s]的被叫一号通副号码！不能再作为其他号码的副号码！"), //
    CRM_UU_37("该服务号码[%s]已是[%s]的主叫一号通副号码！不能再作为其他号码的副号码！"), //
    CRM_UU_38("该服务号码[%s]已是融合一号通主号码！不能再作为其他号码的副号码！"), //
    CRM_UU_39("获取亲情品牌出错%s"), //
    CRM_UU_40("没有长途拨打权限的主号码[%s]，不能加该外地号码[%s]作为副号码！"), //
    CRM_UU_41("您输入的号码%s不允许加入神州新干线亲情"), //
    CRM_UU_42("申请副号码出错--%s"), //
    CRM_UU_43("用户没有主号码，不能进行一卡多号业务状态设置！"), //
    CRM_UU_44("用户有名为【%s】的【%s】，结束至%s，请先为客户退出家庭再办理销户"), //
    CRM_UU_45("%s的产品ID[%s]不能办理家庭套餐的副卡"), //
    CRM_UU_46("主副号码绑定失败！%s"), //
    CRM_UU_47("主叫一号通,主号不能作为副号添加！"), //
    CRM_UU_48("主叫一号通最多只能绑定1个副号码！"), //
    CRM_UU_49("主显号码有且只能有一个！"), //
    CRM_UU_50("注销副号码出错--%s"), //
    CRM_UU_51("总机信息与UU表中记录不一致，请联系系统管理员！"), //
    CRM_UU_52("[%s]不是[%s]集团成员!"), //
    CRM_UU_53("错误数据：[%s]不存在子产品的uu关系!请联系管理员!"), //
    CRM_UU_54("用户存在月底注销的uu关系，不允许选择立即生效！"), //
    CRM_UU_55("没有长途拨打权限的主号码[%s]，不能加该外地号码[%s]作为副号码！"), //
    CRM_UU_56("亲情业务调用服务失败：方法名称[MethodName]是必须的！"), //
    CRM_UU_57("查询用户下月产品信息出错：无记录！"), //
    CRM_UU_58("查询用户欠费失败！"), //
    CRM_UU_59("查询通用参数[2902]出错，请确保你登录地市正确！"), //
    CRM_UU_60("获取亲情品牌出错[%s]！"), //
    CRM_UU_61("对不起，用户预约产品不可以办理此项亲情业务！"), //
    CRM_UU_62("对不起，当前产品限制不可以办理此项亲情业务！"), //
    CRM_UU_63("查询家庭产品失败：无产品资料！"), //
    CRM_UU_64("查询关系类型出错，请检查是否配置了产品关系表！"), //
    CRM_UU_65("获取优惠生效时间出错：无产品信息TD_B_PRODUCT:[%s]！"), //
    CRM_UU_66("获取优惠生效，终止时间异常！"), //
    CRM_UU_67("此用户当前不是青青校园产品,不可以办理此业务！"), //
    CRM_UU_68("此用户当前不是快乐空间产品,不可以办理此业务！"), //
    CRM_UU_69("获取成员优惠失败！"), //
    CRM_UU_70("取消亲情关系时，获取主卡优惠信息失败！"), //
    CRM_UU_71("该用户 [%s] 不是正常用户状态，不可以办理本业务！"), //
    CRM_UU_72("该用户[%s]存在欠费(实时结余小于0)，不可以加为副卡！"), //
    CRM_UU_73("对不起，你的操作有误：非新增和删除操作！"), //
    CRM_UU_74("获取亲情通品牌出错：【%s】！"), //
    CRM_UU_75("没找到相应亲情产品的关系及优惠信息，请验证！"), //
    CRM_UU_76("从bak表中恢复UU表出错！"), //
    CRM_UU_77("根据Trade_id删除UU表出错！"), //
    CRM_UU_78("【%s】"), //
    CRM_UU_2001("修改关系表出错！"), //
    CRM_UU_80("注销一卡双号:注销虚拟集团用户资料无数据！"), //
    CRM_UU_81("注销亲情关系:注销虚拟集团用户资料无数据！"), //
    CRM_UU_82("该服务号码[%s]不是融合一号通主号码！不能作为[%s]的主叫一号通主号码！"), //
    CRM_UU_83("该服务号码[%s]不是[%s]的被叫一号通主号码！不能作为[%s]的主叫一号通主号码！"), //
    CRM_UU_84("此用户未办理家庭套餐！"), //
    CRM_UU_85("未查询到此用户的家庭套餐！"), //
    CRM_UU_86("该成员服务号码[%s]不是指定集团的VPMN成员！"), //
    CRM_UU_87("您还不是家庭帐户成员！"), //
    CRM_UU_88("操作重复:用户已在名单内无法新增"), //
    CRM_UU_89("该成员与商品用户不存在BB关系"), //
    CRM_UU_90("操作重复:已经不存在用户关系不需要删除"), //
    CRM_UU_91("该服务号码[%s]不是集团产品[%s]成员!"), CRM_UU_92("%s 已经是IMS自选群副卡[主卡手机号：%s]!"), CRM_UU_93("%s 已经是IMS自选群主卡!"), //
    CRM_UU_94("根据副卡用户标识[%s]查询不到副卡关系，不能删除副卡用户！"), //
    CRM_UU_95("根据服务号码[%s]查询关系[%s]无数据!"), //
    CRM_UU_96("子卡用户信息不存在,或者该用户为异地用户"), //
    CRM_UU_97("主卡用户信息不存在,或者该用户为异地用户"), //
    CRM_UU_98("子卡和主卡直接的对应在亲情通关系错误"), //
    CRM_UU_99("主卡不存在亲情通关系"), //
    CRM_UU_100("注销亲情关系:注销虚拟集团账户资料无数据！"), //
    CRM_UU_102("获取当前成员的UU关系失败，缺少用户关系！"), //
    CRM_UU_101("号码[%s]是统一账户付费副卡号码，不允许办理集团统付业务。"), //
    CRM_UU_103("不存在对应有效成员订购关系[成员User_id: %s, RelationCode: %s]！"), //
    CRM_UU_104("不存在对应有效成员订购关系[成员Serial_number: %s, RelationCode: %s]！"), CRM_UU_105("不存在有效的订购关系[USER_ID_B: %s, USER_ID_A: %s,RelationCode: %s]！"); //
    private final String value;

    private UUException(String value)
    {

        this.value = value;
    }

    public String getValue()
    {

        return value;
    }
}
