
package com.asiainfo.veris.crm.order.pub.exception;

import com.asiainfo.veris.crm.order.pub.frame.bcf.exception.IBusiException;

public enum VpmnUserException implements IBusiException
{
    VPMN_USER_1("该VPMN编码%s用户信息不存在, 请重新输入!"), //
    VPMN_USER_2("该VPMN编码%s客户信息不存在, 请重新输入!"), //
    VPMN_USER_3("该VPMN编码%s不是母VPMN用户, 业务不能办理!"), //
    VPMN_USER_4("该VPMN编码%s暂没有网外号码, 业务不能继续办理!"), //
    VPMN_USER_5("新增网外号码%s已属于VPMN集团%s的网外号码, 业务不能继续办理!"), //
    VPMN_USER_6("根据用户标识%s查询用户VPN信息不存在, 业务不能继续办理!"), //
    VPMN_USER_7("该VPMN编码%s集团已到达最大网外号码数, 业务不能继续办理!"), //
    VPMN_USER_8("删除的网外号码【%s】不属于VPMN集团【%s】的网外号码, 业务不能继续办理!"), //
    VPMN_USER_9("新增网外号码短号码不能以[0,1,5,9]开头, 业务不能继续办理"), //
    VPMN_USER_10("新增网外号码短号码与VPMN集团短号相同, 业务不能继续办理!"), //
    VPMN_USER_11("新增网外号码短号码与VPMN集团的子VPMN集团短号相同, 业务不能继续办理!"), //
    VPMN_USER_12("该VPMN编码%s不是子VPMN用户, 业务不能办理!"), //
    VPMN_USER_13("该VPMN编码%s已是此母VPMN%s的子VPMN, 业务不能继续办理!"), //
    VPMN_USER_14("因存在没有开通“免6发送短号短、彩信”功能的V网[%s], 不能建立子母VPMN, 业务不能继续办理!"), //
    VPMN_USER_15("该VPMN编码%s不是VPMN集团，不能办理此业务!"), //
    VPMN_USER_16("该VPMN编码%s是母VPMN用户, 此界面不受理母VPMN网外号码业务!"), //
    VPMN_USER_17("发往智能网优惠参数不存在, 请检查参数配置!"), //
    VPMN_USER_18("跨省集团信息数据不准确[字段rsrv_str1字段的格式为：省份ID|GT码]!"), //
    VPMN_USER_19("该集团的用户类型不能选择跨省集团, 获取集团资料的VPN号为空!"), //
    VPMN_USER_20("该服务号码%sVPN资料信息不存在!"), //
    VPMN_USER_21("无850服务, 请新增!"), //
    VPMN_USER_22("该行业类型的VPN_NO已经全部被使用，请重新选择行业类型！"), //
    VPMN_USER_23("自动生成短号存储过程【CREATE_SHORTCODE】调用异常%s,%s"), //
    VPMN_USER_24("由于您是4G套餐用户，如需加入VPMN集团必须办理规定的集团套餐之一。"), //
    VPMN_USER_25("4G随E行用户不能加入VPMN集团。"), //
    VPMN_USER_26("家庭网短号用户不能订购国开行用户开通锚定功能服务!"), //
    VPMN_USER_27("集团已订购“漫游短号服务（发指令）（801）”,成员短号不能为空!"), //
    VPMN_USER_28("根据用户标识%s查询集团用户信息不存在, 业务不能继续办理!"), //
    VPMN_USER_29("该成员服务号码【%s】不属于任何VPN集团!"), //
    VPMN_USER_30("该成员所依赖的VPMN用户信息不存在，业务不能继续！"), //
    VPMN_USER_31("该成员所依赖的VPMN客户信息不存在，业务不能继续！"), //
    VPMN_USER_32("该成员所依赖的VPMN集团客户信息不存在，业务不能继续！"), //
    VPMN_USER_33("该集团V网限制办理，请和集团客户经理联系！"), //
    VPMN_USER_34("该集团VPN资料无数据，业务不能继续！"), //
    VPMN_USER_35("此集团用户数已达到最大用户数，不能再新增用户，请注销部分用户或修改此集团最大用户数后办理成员新增业务！"), //
    VPMN_USER_36("您%s已经登记集团3元套餐（JDD）,在本界面不能选择其它套餐集团5元套餐(JDE）/集团8元套餐（JDF）。"), //
    VPMN_USER_37("您%s已经登记集团5元套餐（JDE）,在本界面不能选择其它套餐集团3元套餐（JDD）/集团8元套餐（JDF）。"), //
    VPMN_USER_38("您%s已经登记集团8元套餐（JDF）,在本界面不能选择其它套餐集团3元套餐（JDD）/集团5元套餐(JDE）。"), //
    VPMN_USER_39("由于您是4G套餐用户，如需加入VPMN集团必须办理规定的集团套餐之一。"), //
    VPMN_USER_40("该服务号码[%s]VPN优惠信息不存在，业务不能继续办理！"), //
    VPMN_USER_41("该服务号码[%s]VPN成员服务信息不存在，业务不能继续办理！"), //
    VPMN_USER_42("该服务号码[%s]所在VPMN集团用户[%s]的VPN信息不存在，业务不能继续办理！"), //
    VPMN_USER_43("此界面不受理母VPMN业务!"), //
    VPMN_USER_44("不是跨省VPMN集团，不能办理此业务!"), //
    VPMN_USER_45("本集团不能订购跨省V网优惠[%s]！"), //
    VPMN_USER_46("用户%s开始生效的VPN优惠已经是：【%s】。"), //
    VPMN_USER_47("用户%s已变更过JDD或JDE或JDF优惠,请下账期再办理!"), //
    VPMN_USER_48("尊敬的客户, 本VPMN集团不存在子母VPMN, 请到[集团产品资料修改]界面开通(免6发送短号短、彩信功能)功能！"), //
    VPMN_USER_49("用户没有下账期%s才开始生效的JDD或JDE或JDF优惠！"), //
    VPMN_USER_50("用户没有%s开始生效的JDD或JDE或JDF优惠！"), //
    VPMN_USER_51("用户下账期%s开始生效的VPN优惠已经是：%s"), //
    VPMN_USER_52("网外号码应为5位到15位, 请确认!"), //
    VPMN_USER_53("短号码为3-7位, 请确认!"), //
    VPMN_USER_100("该号码%s资料信息不存在，请重新输入！"), //
    VPMN_USER_101("该号码【%s】账户信息不存在，请重新输入！"), //
    VPMN_USER_102("该号码%s已办理过V网免费体验活动！"), //
    VPMN_USER_103("该号码%s是非当月新增V网用户（含当月退订，再次办理），不能办理集团3元优惠活动！"), //
    VPMN_USER_104("该号码【%s】不是VPMN集团成员，不能办理集团3元优惠活动！"), //
    VPMN_USER_105("该号码【%s】不是当前账期%s到%s加入V网集团，不能办理集团3元优惠活动！"), //
    VPMN_USER_106("该号码[%s]V网套餐%s不是集团3元套餐（JDD），不能办理集团3元优惠活动！"), //
    VPMN_USER_107("该号码%s资料信息不存在，请重新输入！"), //
    VPMN_USER_108("该号码【%s】服务状态处于非正常状态！"), //
    VPMN_USER_109("该号码【%s】已办理过双网有礼活动！"), //
    VPMN_USER_110("该号码【%s】已办理过%s,不可办理双网有礼活动！"), //
    VPMN_USER_111("该号码【%s】不是亲亲网主号码,不能办理双网有礼活动！"), //
    VPMN_USER_112("获取亲亲网主号码【%s】失败！"), //
    VPMN_USER_113("该号码【%s】未组建亲亲网,不能办理双网有礼活动！"), //
    VPMN_USER_114("该号码【%s】所组建的亲亲网无2个或以上副号码,不能办理双网有礼活动,请联系您的集团客户经理！"), //
    VPMN_USER_115("该号码【%s】不是VPMN集团成员,不能办理双网有礼活动,请联系您的集团客户经理！"), //
    VPMN_USER_116("请确认该用户【%s】是否存在V网关系！"), //
    VPMN_USER_117("该号码【%s】未办理如下套餐之一,优惠编码为:%s,不能办理双网有礼活动,请联系您的集团客户经理！"), //
    VPMN_USER_118("推荐号码【%s】用户信息不存在！"), //
    VPMN_USER_119("获取母VPMN下的子VPMN无数据！"), //
    VPMN_USER_120("没有获取到集团V网营销活动资料数据！"), //
    VPMN_USER_121("新增集团V网营销活动失败！"), //
    VPMN_USER_122("集团服务号【%s】查询用户VPN资料无数据！"), //
    VPMN_USER_123("用户【%s】已经是融合V网用户，不需要再次升级为融合V网！"), //
    VPMN_USER_124("只有VPMN用户才能做融合V网升级，请确认该集团用户的产品是否为VPMN【8000】！"), //
    VPMN_USER_125("该客户经理已经存在该权限，不能重复分配！"), //
    VPMN_USER_126("新增员工集团权限表出错！"), //
    VPMN_USER_127("您无权限操作别的业务区权限！"), //
    VPMN_USER_128("删除失败！"), //
    VPMN_USER_129("没有获取到VPMN客户经理信息数据！"), //
    VPMN_USER_130("您办理了VPMN升级融合V网业务，需要为成员定制资费!"), //
    VPMN_USER_131("获取用户编码失败！~"), //
    VPMN_USER_132("该集团正处在升级为融合集团中，执行时间定在【%s】,无需重复提交!"), //
    VPMN_USER_133("VPMN升级时，集团下的成员特殊资费信息失败!"), //
    VPMN_USER_134("获取批量成员默认优惠失败!"), //
    VPMN_USER_135("您办理了VPMN升级业务，需要成员定制资费【%s】!"), //
    VPMN_USER_136("您办理了集团VPMN升级融合VPMN业务，由于成员【%s】订购的资费不在可升级资费列表【%s】内，升级失败!"), //
    VPMN_USER_137("您要删除的VPMN客户经理权限信息不存在！"), //
    VPMN_USER_138("您导入的文件为空，请检查！"), //
    VPMN_USER_139("该集团【%s】下没有VPMN-8050产品且没有VPMN-8000产品!"), //
    VPMN_USER_140("该集团【%s】下有超过一个母集团，请选择按母VPMN编码查询!"), //
    VPMN_USER_141("该集团【%s】没有任何母集团或子集团!"), //
    VPMN_USER_142("母VPMN【%s】资料信息不存在，请重新输入！"), //
    VPMN_USER_143("没有查询到导入标识为【%s】的数据明细！"), //
    VPMN_USER_144("该成员服务号码【%s】不属于任何VPMN集团"), //
    VPMN_USER_145("批量数据处理异常【%s】"), //
    VPMN_USER_146("被推荐号码【%s】用户信息不存在"), //
    VPMN_USER_147("被推荐号码【%s】客户信息不存在"), //
    VPMN_USER_148("被推荐号码【%s】账户信息不存在"), //
    VPMN_USER_149("被推荐号码【%s】不属于任何集团VPMN成员，业务不能继续！"), //
    VPMN_USER_150("被推荐号码【%s】不是当账期加入V网集团！"), //
    VPMN_USER_151("被推荐号码【%s】V网套餐【%s】不是3元套餐费（JDD）！"), //
    VPMN_USER_152("被推荐号码【%s】已办理过V网营销活动！"), //
    VPMN_USER_153("服务号码【%s】用户账期信息不存在！"), //
    VPMN_USER_154("推荐号码【%s】用户信息不存在"), //
    VPMN_USER_155("推荐号码【%s】客户信息不存在"), //
    VPMN_USER_156("推荐号码【%s】账户信息不存在"), //
    VPMN_USER_157("推荐号码【%s】不属于任何集团VPMN成员，业务不能继续！"), //
    VPMN_USER_158("推荐号码【%s】的成员类型不是联系人，业务不能继续！"), //
    VPMN_USER_159("推荐号码【%s】不是集团成员，业务不能继续！"), //
    VPMN_USER_160("业务受限提示：用户有未完工的集团V网营销活动受理业务"), //
    VPMN_USER_161("推荐号码【%s】服务状态处于非正常状态！"), //
    VPMN_USER_162("被推荐号码【%s】已办理过%s,不可办理双网有礼活动！"), //
    VPMN_USER_163("被推荐号码【%s】不是亲亲网主号码,不能办理双网有礼活动！"), //
    VPMN_USER_164("被推荐号码【%s】未组建亲亲网,不能办理双网有礼活动！"), //
    VPMN_USER_165("被推荐号码【%s】所组建的亲亲网无2个或以上副号码,不能办理双网有礼活动！"), //
    VPMN_USER_166("被推荐号码【%s】不是VPMN集团成员,不能办理双网有礼活动！"), //
    VPMN_USER_167("被推荐号码【%s】未办理如下套餐之一,优惠编码为:%s,不能办理双网有礼活动！"), //
    VPMN_USER_168("被推荐号码【%s】已办理过双网有礼活动！"), //
    VPMN_USER_169("不存在对应有效成员的普通V网订购关系[成员Serial_number: %s]！"), //
    VPMN_USER_170("集团为跨省集团时,VPN号不能为空！"), //
    VPMN_USER_171("获取跨省集团的VPN号信息失败！"), //
    VPMN_USER_172("该集团不是跨省集团且未订购漫游短号服务包，不能为成员订购来电显示服务包！"), //
    VPMN_USER_173("成员没有订购VPMN相应的服务包，业务不能继续！"), //
    VPMN_USER_174("成员没有订购VPMN成员服务包中的860服务或者860服务已失效，业务不能继续！"), //
    VPMN_USER_175("该号码【s%】没有推荐用户！"), //
    VPMN_USER_176("该集团正处在跨省升级中，执行时间定在【%s】,无需重复提交!"), //
    VPMN_USER_177("跨省VPMN升级时，读取集团下的成员跨省资费信息失败!"), //
    VPMN_USER_178("您办理了跨省集团VPMN升级业务，需要成员定制资费【%s】!"), //
    VPMN_USER_179("获取全国下发的集团号信息失败!"), //
    VPMN_USER_180("获取集团升级默认的成员资费信息失败!"), //
    VPMN_USER_181("集团下存在校园卡成员，不能办理本业务!"), //
    VPMN_USER_182("集团下存在没有短号的成员，不能办理本业务!"), //
    VPMN_USER_183("集团下存在不以6打头的短号，不能办理本业务!"), //
    VPMN_USER_184("集团下存在以60打头的短号，不能办理本业务!"), //
    VPMN_USER_185("集团下存在长度不符合的短号，不能办理本业务 !"), //
    VPMN_USER_186("短号校验-%s"), //
    VPMN_USER_187("录入的短号信息未作变更,请核对短号后再做操作！"), //
    VPMN_USER_188("您输入的不是母VPMN编号，请确认~~！"), //
    VPMN_USER_189("您输入的母VPMN不存在子母关系，请确认~~！"), //
    VPMN_USER_190("子VPMN必须是VPMN集团，请确认~~！"), //
    VPMN_USER_191("输入子VPMN资料不存在，请确认~~！"), //
    VPMN_USER_192("用户免6发送短号短彩信服务(802)已存在，业务不能继续！"), //
    VPMN_USER_193("用户没有相应免6发送短号短彩信服务(802)，业务不能继续！"), //
    VPMN_USER_194("服务号码【%s】不属于任何VPMN集团成员，业务不能继续！"), //
    VPMN_USER_195("成员所依赖的集团没有订购VPMN成员呼叫权限控制包，业务不能继续！"), //
    VPMN_USER_196("请确认成员所依赖的集团是否订购了862主叫和863被叫服务！"), //
    VPMN_USER_197("成员所依赖的集团没有订购VPMN成员呼叫权限控制包的862主叫服务，业务不能继续！"), //
    VPMN_USER_198("成员所依赖的集团没有订购VPMN成员呼叫权限控制包的863被叫服务，业务不能继续！"), //
    VPMN_USER_199("限制呼叫VPMN外电话（862）服务实例参数已存在，业务不能继续！"), //
    VPMN_USER_200("限制呼叫VPMN外电话（862）服务已存在，业务不能继续！"), //
    VPMN_USER_201("获取用户已有限制呼叫VPMN外电话（862）服务失败！"), //
    VPMN_USER_202("限制接听VPMN外电话（863）服务已存在，业务不能继续！"), //
    VPMN_USER_203("限制接听VPMN外电话（863）服务实例参数已存在，业务不能继续！"), //
    VPMN_USER_204("获取用户已有限制接听VPMN外电话（863）服务失败！"), //
    VPMN_USER_205("活动类型[ACTIVE_TYPE=%s]不是V网免费体验活动的编码！"), //
    VPMN_USER_206("集团VPN_NO号【%s】查询用户VPN资料无数据！"), //
    VPMN_USER_207("集团用户ID【%s】和短号【%s】查询成员VPN资料无数据！"), //
    VPMN_USER_208("号码【%s】已加入VPMN集团!"), //
    VPMN_USER_209("您输入的【%s】不是母VMPN集团编号！"), //
    VPMN_USER_210("您输入的子VPMN编码【%s】不是VMPN集团！"), //
    VPMN_USER_211("没有符合条件的子母集团资料！"), //
    VPMN_USER_212("没有符合条件的查询结果！"), //
    VPMN_USER_213("短号验证错误，%s"), //
    VPMN_USER_214("该集团用户无%s服务，资料错误，请联系管理员！"), //
    VPMN_USER_215("该号码【%s】不是网外号码，请您输入正确的网外号码！"), //
    VPMN_USER_216("用户有下账期【%s】生效的V网优惠，不允许在该页面变更优惠！"), //
    VPMN_USER_217("用户的主套餐已变更，请重新刷新该成员三户资料缓存！"), //
    VPMN_USER_218("接口入参【%s】传入的参数‘%s’不正确！"), //
    VPMN_USER_219("更新短号临时表【TF_F_TEMPORARY_SHORTCODE】错误！请确认短号【%s】在用户编码为【%s】下的VPMN集团中是唯一的！"), //
    VPMN_USER_220("入表前短号验证失败，请重新输入短号!%s"), //
    VPMN_USER_221("本集团是跨省V网，成员新增必须订购跨省V网优惠！"), //
    VPMN_USER_222("主叫号码非VPN集团成员用户!"), //
    VPMN_USER_223("被查号码,跟主叫号码不在同一个VPN子母集团里面!"),
    VPMN_USER_224("新增子VPMN集团的短号码与母VPMN集团下子集团其它短号码重复，业务不能继续!"),
    VPMN_USER_225("新增子VPMN集团的短号码与母VPMN集团其它短号码重复，业务不能继续!"), //
    VPMN_USER_226("%s"),
    VPMN_USER_227("要办理的套餐已存在，不需要办理!"), //
    VPMN_USER_228("存储过程【P_CSM_OPENMOBILE_GRPMEB】调用异常%s,%s"); //
    
    private final String value;

    private VpmnUserException(String value)
    {
        this.value = value;
    }

    public String getValue()
    {
        return value;
    }
}
